export const SORCERER_SPELLS = [
    // Cantrips
    "酸液飞溅", "剑刃防护", "颤栗之触", "舞光术", "四象法门",
    "火焰箭", "交友术", "光亮术", "法师之手", "修复术",
    "传讯术", "心灵之楔", "次级幻象", "毒气喷涌", "魔法伎俩",
    "冷冻射线", "电爪", "术法爆发", "鸣雷破", "克敌先击",

    // Level 1
    "燃烧之手", "魅惑类人", "繁彩球", "七彩喷射", "通晓语言",
    "侦测魔法", "易容术", "脚底抹油", "虚假生命", "羽落术",
    "云雾术", "油腻术", "冰刃", "跳跃术", "法师护甲",
    "魔法飞弹", "致病射线", "护盾术", "无声幻影", "睡眠术",
    "雷鸣波", "巫术箭",

    // Level 2
    "变身术", "复苏秘法", "目盲术/耳聋术", "朦胧术", "匕首之云",
    "疯狂冠冕", "黑暗术", "黑暗视觉", "侦测思想", "龙息术",
    "强化属性", "变巨术/缩小术", "火焰刀", "炽焰法球", "造风术",
    "定身类人", "隐形术", "敲击术", "浮空术", "魔化武器",
    "心灵尖刺", "镜影术", "迷踪步", "魅影之力", "灼热射线",
    "识破隐形", "粉碎音波", "蛛行术", "暗示术", "蛛网术",

    // Level 3
    "闪现术", "鹰眼术", "法术反制", "昼明术", "解除魔法",
    "恐惧术", "火球术", "飞行术", "气化形体", "加速术",
    "催眠图纹", "闪电束", "高级幻影", "防护能量", "雪雨暴",
    "缓慢术", "臭云术", "巧言术", "吸血鬼之触", "水中呼吸",
    "水上行走",

    // Level 4
    "放逐术", "枯萎术", "魅惑怪物", "困惑术", "任意门",
    "支配野兽", "火焰护盾", "高等隐形术", "冰风暴", "变形术",
    "石肤术", "浓酸球", "火墙术",

    // Level 5
    "活化物件", "毕格比之手", "死云术", "寒冰锥", "造物术",
    "支配类人", "定身怪物", "疫病虫群", "伪装术", "突触静止",
    "心灵遥控", "传送法阵", "石墙术",

    // Level 6
    "秘法门", "连锁闪电", "死亡法阵", "解离术", "摄心目光",
    "石化术", "法术无效结界", "群体暗示术", "地动术", "欧提路克冰封法球",
    "阳炎射线", "真知术",

    // Level 7
    "延迟爆裂火球", "以太化", "死亡一指", "火焰风暴", "位面转移",
    "虹光喷射", "反转重力", "传送术",

    // Level 8
    "半位面", "支配怪物", "地震术", "焚云术", "律令震慑",
    "阳炎爆",

    // Level 9
    "异界之门", "流星爆", "律令死亡", "时间停止", "祈愿术"
];
