import { SpellItem } from './types';

export const SPELL_DB_LEVEL_0: SpellItem[] = [
  // ==========================================
  // 戏法 (Cantrips)
  // ==========================================
  {
    id: "toll-the-dead", name: "亡者丧钟", source: "PHB'24",
    level: 0, school: "死灵", castingTime: "动作", range: "60 尺", components: "声音, 姿势", duration: "立即",
    classes: ["法师","牧师","邪术师"],
    description: "你指向范围内你能看到的一个生物，目标附近10英尺内能听到一声悲伤的钟声。目标必须进行一次智力豁免检定，否则受到1d8 坏死伤害。如果目标缺失任何其生命值，它反而受到1d12 坏死伤害。",
    higherLevel: "当你的等级达到5级（2d8 或 2d12）、11级（3d8 或 3d12）和17级（4d8 或 4d12）时，伤害会增加一个骰子。"
  },
  {
    id: "friends", name: "交友术", source: "PHB'24",
    level: 0, school: "惑控", castingTime: "动作", range: "10 尺", components: "姿势, 材料 (一些化妆品)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","术士","法师","邪术师"],
    description: "你在范围内对一个你能看到的生物散发出一种友谊的感觉。目标必须成功通过一次智力豁免检定，*否则在法术*持续期间获得*魅惑*状态。如果目标不是人型生物，你们正在战斗，或者在过去24小时内你已经对它*施放了这个法术*，则目标自动成功。如果目标受到伤害，或者你进行攻击检定、造成伤害或强迫任何人进行豁免检定，法术会提前结束。*当法术*结束时，目标会知道它被你用*魅惑*状态影响了。"
  },
  {
    id: "message", name: "传讯术", source: "PHB'24",
    level: 0, school: "变化", castingTime: "动作", range: "120 尺", components: "姿势, 材料 (一根铜线)", duration: "1轮",
    classes: ["吟游诗人","奇械师","德鲁伊","术士","法师"],
    description: "你指向一个在你施法范围内的生物并低声传递一条信息。目标（只有目标）会听到这条信息，并且可以用只有你能听到的低语回复。如果你熟悉目标并且知道它在障碍物的另一侧，你可以通过固体物*体施放这个法术*。魔法沉默；1英尺厚的石头、金属或木头；或者一层薄铅板可*以阻挡这个法术*。"
  },
  {
    id: "mending", name: "修复术", source: "PHB'24",
    level: 0, school: "变化", castingTime: "1分钟", range: "触及", components: "声音, 姿势, 材料 (两块天然磁石)", duration: "立即",
    classes: ["吟游诗人","奇械师","德鲁伊","术士","法师","牧师"],
    description: "*这个法术*可以修复你触摸的物体上的一个断裂或撕裂，比如一个断裂的链条环节、两半断裂的钥匙、一件撕裂的斗篷或一个漏水的酒囊。只要断裂或撕裂的尺寸在任何方向上不超过1英尺，你都可以修复它，并且不会留下任何先前损坏的痕迹。*这个法术*可以物理修复魔法物品，但它不能恢复物品的魔法效力。"
  },
  {
    id: "elementalism", name: "元素主义", source: "PHB'24",
    level: 0, school: "变化", castingTime: "动作", range: "30 尺", components: "声音, 姿势", duration: "立即",
    classes: ["德鲁伊","术士","法师"],
    description: "你在范围内对元素施加控制，创造出以下一种效果。 召唤空气. 你在一个5英尺立方体内创造出一股足够强劲的微风，足以使布匹起皱、尘埃飞扬、树叶沙沙作响，以及关闭敞开的门窗。被某人或其他东西撑开的门窗不受影响。 召唤大地. 你在5英尺见方的区域内创造出一层薄薄的尘土或沙子覆盖表面，或者你可以在一块泥土或沙子上让一个单词以你的笔迹出现。 召唤火焰. 你在一个5英尺立方体内创造出一团无害的余烬和彩色、带香味的烟雾。你可以选择颜色和香味，余烬可以点燃该区域内的蜡烛、火把或灯具。烟雾的香味持续1分钟。 你召唤出一团细小的水雾，轻轻地湿润了5英尺立方体内的生物和物体。或者，你可以在开放的容器中或表面上创造出1杯清水，这些水在1分钟内蒸发。. 你创造出一团凉爽的雾气，轻微地湿润了5英尺立方体内的生物和物体。或者，你可以在敞开的容器中或表面上创造出1杯清水，这些水在1分钟内蒸发。 塑形元素. 你使得能够装进1英尺立方体的尘土、沙子、火焰、烟雾、雾气或水在1小时内呈现出一个粗糙的形状（如某种生物的形状）。"
  },
  {
    id: "light", name: "光亮术", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "触及", components: "声音, 材料 (一只萤火虫或萤光苔)", duration: "1小时",
    classes: ["吟游诗人","奇械师","术士","法师","牧师"],
    description: "你触摸一个大型或更小的物体，该物体没有被其他人穿戴或携带。*直到法术*结束，该物体在20英尺半径内发出明亮光照，并在额外的20英尺范围内发出微光光照。光的颜色可以由你选择。用不透明物体覆盖物体会阻挡光线。如果你再*次施放这个法术*，法术会结束。"
  },
  {
    id: "word-of-radiance", name: "光耀祷词", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "自身 (5尺 emanation)", components: "声音, 材料 (一个日爆标记)", duration: "立即",
    classes: ["牧师"],
    description: "燃烧的辉光从你身上爆发，形成一个5英尺范围的辐射。你在其中能看到的每个你选择的生物必须进行一次体质豁免检定，否则会受到1d6点光耀伤害。",
    higherLevel: "当你达到5级（4d6），11级（2d6）和17级（3d6）时，damage增加1d6。"
  },
  {
    id: "true-strike", name: "克敌机先", source: "PHB'24",
    level: 0, school: "预言", castingTime: "动作", range: "自身", components: "姿势, 材料 (一把你熟练且价值1+铜币的武器)", duration: "立即",
    classes: ["吟游诗人","术士","法师","邪术师"],
    description: "在魔法洞察的闪现指引下，你使用施法所用的武器进行一次攻击。这次攻*击使用你的法术*施放能力来决定攻击和伤害骰而不是使用力量或敏捷。如果攻击造成伤害，它可以是辐射伤害或者武器的正常伤害类型（由你选择）。",
    higherLevel: "无论你造成的是光耀伤害还是武器的正常伤害类型，当你达到5级（1d6）、11级（2d6）和17级（3d6）时，此次攻击会额外造成光耀伤害。"
  },
  {
    id: "ray-of-frost", name: "冷冻射线", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "60 尺", components: "声音, 姿势", duration: "立即",
    classes: ["奇械师","术士","法师"],
    description: "一道冰冷的蓝白光束直奔范围内的一个生物。对目*标进行远程法术*攻击。击中时，它受到1d8点寒冷伤害，并且其速度值在你下一回合开始前减少10英尺。",
    higherLevel: "当你达到5级（4d8）、11级（2d8）和17级（3d8）时，伤害增加1d8。"
  },
  {
    id: "blade-ward", name: "剑刃防护", source: "PHB'24",
    level: 0, school: "防护", castingTime: "动作", range: "自身", components: "声音, 姿势", duration: "专注，至多1分钟",
    classes: ["吟游诗人","术士","法师","邪术师"],
    description: "*在法术*结束之前，每当有生物对你进行攻击检定时，攻击者需从攻击检定中减去1d4。"
  },
  {
    id: "sacred-flame", name: "圣火术", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "60 尺", components: "声音, 姿势", duration: "立即",
    classes: ["牧师"],
    description: "类似火焰的光辉降临在你可以看到的范围内的一个生物身上。目标必须成功通过一次敏捷豁免，否则将受到 1d8 点辐射伤害。目标在这次豁免中无法从半掩体掩护 或四分之三掩体掩护 获得任何好处。",
    higherLevel: "当你达到5级（4d8）、11级（2d8）和17级（3d8）时，伤害增加1d8。"
  },
  {
    id: "thaumaturgy", name: "奇术", source: "PHB'24",
    level: 0, school: "变化", castingTime: "动作", range: "30 尺", components: "声音", duration: "1分钟",
    classes: ["牧师"],
    description: "你在范围内显现出一个小奇迹。你可以在范围内创造以下效果之一。如果你多*次施放这个法术*，你可以同时有多达三个其1分钟的效果处于激活状态。 改变之眼. 你在 1 分钟内改变自己眼睛的颜色。 震耳嗓音. 你的声音在1分钟内会变得比正常情况下大三倍。在此期间，你在魅力（威吓）检定上具有优势。 玩火. 你在 1 分钟内使一团火焰闪烁，变亮，变暗或变色。 *这个法术*允许你触摸的生物能够理解它听到或看到的任何口头或手语的交流。此外，当目标通过说话或手语进行交流时，任何至少知道一种语言的生物，只要能够听到说话或看到手语，就能理解它。. 你使一扇没有锁上的门或窗瞬间打开或关上。 幻听. 你使某种声音自施法距离内一点瞬间发出，例如雷鸣声，鸦叫声或不祥的低语声。 震动. 你使地面震动 1 分钟（完全无害）。"
  },
  {
    id: "druidcraft", name: "德鲁伊伎俩", source: "PHB'24",
    level: 0, school: "变化", castingTime: "动作", range: "30 尺", components: "声音, 姿势", duration: "立即",
    classes: ["德鲁伊"],
    description: "向自然之灵低语，你可以在射程内创造以下效果之一。 天气传感器. 你创造一个微小而无害的感官效应，并以之预报你所在地接下来 24 小时的天气状况。该效应可表现为一个代表晴空的金球，一朵代表雨天的云彩，代表雪日而飘飞的雪花等等。该效应将持续 1 轮。 开花. 你可以立即让一朵鲜花绽放，一颗种子破壳，一片叶蕾发芽。 感官效应. 你创造了一个无害的感官效果，比如飘落的树叶、幻影般的跳舞精灵、轻柔的微风、动物的声音，或是淡淡的臭鼬气味。这个效果必须适应在一个5英尺立方体内。 玩火. 你点燃或熄灭蜡烛、火把或篝火。"
  },
  {
    id: "mind-sliver", name: "心灵之楔", source: "PHB'24",
    level: 0, school: "惑控", castingTime: "动作", range: "60 尺", components: "声音", duration: "立即",
    classes: ["术士","法师","邪术师"],
    description: "你尝试暂时扰乱你能看到的范围内的一个生物的心智。目标必须成功通过一次智力豁免，否则将受到1d6点心灵伤害，并在其下一轮结束前进行的下一次豁免检定中减去1d4。",
    higherLevel: "当你达到5级（4d6），11级（2d6）和17级（3d6）时，damage增加1d6。"
  },
  {
    id: "vicious-mockery", name: "恶言相加", source: "PHB'24",
    level: 0, school: "惑控", castingTime: "动作", range: "60 尺", components: "声音", duration: "立即",
    classes: ["吟游诗人"],
    description: "你向一个你能看到或听到的目标释放一串带有微妙魅力的侮辱。目标必须进行一次感知豁免检定，否则将受到1d6点心灵伤害，并且在其下一回合结束前的下一次攻击检定中获得劣势。",
    higherLevel: "当你达到5级（4d6），11级（2d6）和17级（3d6）时，damage增加1d6。"
  },
  {
    id: "resistance", name: "提升抗性", source: "PHB'24",
    level: 0, school: "防护", castingTime: "动作", range: "触及", components: "声音, 姿势", duration: "专注，至多1分钟",
    classes: ["奇械师","德鲁伊","牧师"],
    description: "你触摸一个愿意的生物，并选择一种伤害类型：酸蚀、钝击、寒冷、火焰、闪电、死灵、穿刺、毒素、圣光、斩击或雷击。*在法术*结束前，当生物受到选择类型的伤害时，生物减少受到的总伤害1d4。一个生物每回合*只能从这个法术*中受益一次。"
  },
  {
    id: "starry-wisp", name: "星界小精灵", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "60 尺", components: "声音, 姿势", duration: "立即",
    classes: ["吟游诗人","德鲁伊"],
    description: "你对射程内的一个生物或物体发射一束光线。对目*标进行远程法术*攻击。命中时，目标受到1d8点辐射伤害，并且在你的下一个回合结束前，它在10英尺范围内发出微光光照，并且不能从*隐形*状态中获益。",
    higherLevel: "当你达到5级（4d8）、11级（2d8）和17级（3d8）时，伤害增加1d8。"
  },
  {
    id: "shillelagh", name: "橡棍术", source: "PHB'24",
    level: 0, school: "变化", castingTime: "附赠动作", range: "触及", components: "声音, 姿势, 材料 (槲寄生)", duration: "1分钟",
    classes: ["德鲁伊"],
    description: "你持有的棍棒或长棍被赋予了自然之力。在持续期间，你可以使用你的施法能力代替力量属性来决定使用该武器进行近战攻击的攻击和伤害骰，并且该武器的伤害骰变为d8。如果攻击造成伤害，它可以是原力伤害或者武器的正常伤害类型（由你选择）。如果你再*次施放这个法术*，或者你放开武器，法术会提前结束。",
    higherLevel: "当你达到5级（d10）、11级（d12）和17级（2d6）时，伤害骰会改变。"
  },
  {
    id: "minor-illusion", name: "次级幻影", source: "PHB'24",
    level: 0, school: "幻术", castingTime: "动作", range: "30 尺", components: "姿势, 材料 (少许羊毛)", duration: "1分钟",
    classes: ["吟游诗人","术士","法师","邪术师"],
    description: "你在范围内创造出一个声音或物体的影像，*持续时间为法术*的持续时间。请参见下面的描述以了解每个效果。如果你再*次施放这个法术*，幻觉就会结束。如果生物进行一次研究动作来检查声音或影像，该生物可以通过一次成功的智力(调查)检*定对抗你的法术*豁免难度等级来确定这是一个幻象。如果生物识破了幻象的本质，那么这个幻象对该生物来说就会变得模糊不清。 声音. 如果你创造一段声响，其音量可以是低声耳语也可以是高声尖叫。它可以是你或其他任何人的嗓音，或者是一头狮子的咆哮、一段鼓声以及任何你指定的其它声响。声响在持续时间内不会减弱，或者*你也可以于法术*终止前在不同的时间段创造几段分散的声响。 图像. 如果你创造一个物体的影像——比如一把椅子、泥泞的脚印或一个小箱子——它的大小不能超过一个5英尺的立方体。这个影像不能产生声音、光线、气味或其他任何感官效果。与影像的物理互动会揭示它是一个幻觉，因为物体可以穿过它。"
  },
  {
    id: "poison-spray", name: "毒气喷溅", source: "PHB'24",
    level: 0, school: "死灵", castingTime: "动作", range: "30 尺", components: "声音, 姿势", duration: "立即",
    classes: ["奇械师","德鲁伊","术士","法师","邪术师"],
    description: "你对射程内的一个生物喷射有毒雾气。对目*标进行远程法术*攻击。击中时，目标受到1d12毒素伤害。",
    higherLevel: "当你达到5级（4d12），11级（2d12）和17级（3d12）时，damage增加1d12。"
  },
  {
    id: "mage-hand", name: "法师之手", source: "PHB'24",
    level: 0, school: "咒法", castingTime: "动作", range: "30 尺", components: "声音, 姿势", duration: "1分钟",
    classes: ["吟游诗人","奇械师","术士","法师","邪术师"],
    description: "在你选择的射程内的某一点出现一只幽灵般的、漂浮的手。这只手持*续存在直到法术*持续时间结束。如果这只手与你的距离超过30英尺，或者你再*次施放这个法术*，它就会消失。*当你施放法术*时，你可以使用这只手来操纵一个物体，打开一个未上锁的门或容器，从打开的容器中存放或取出一个物品，或者将小瓶中的内容物倒出来。作为你后续回合中的一个魔法动作，你可以再次控制这只手。作为该动作的一部分，你可以移动这只手最多30英尺。该幽灵手不能攻击，也不能激活魔法物品或承载超过 10 磅重的物质。"
  },
  {
    id: "fire-bolt", name: "火焰箭", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "120 尺", components: "声音, 姿势", duration: "立即",
    classes: ["奇械师","术士","法师"],
    description: "你对射程内的生物或物体投掷一个火焰点。对目*标进行远程法术*攻击。命中时，目标受到1d10火焰伤害。*如果这个法术*击中了易燃物体，并且它没有被穿戴或携带，它将开始焚烧。",
    higherLevel: "当你达到5级（4d10）、11级（2d10）和17级（3d10）时，damage增加1d10。"
  },
  {
    id: "produce-flame", name: "燃火术", source: "PHB'24",
    level: 0, school: "咒法", castingTime: "附赠动作", range: "自身", components: "声音, 姿势", duration: "10分钟",
    classes: ["德鲁伊"],
    description: "一道摇曳的火焰出现在你的手中，并在持续时间内保持在那里。当火焰存在时，它不发出热量，也不会点燃任何东西，它在20英尺半径内发出明亮光照，并在额外的20英尺内发出微光光照。如果你再*次施放这个法术*，它就会结束。*直到法术*结束，你可以采取一个魔法动作，向距离你60英尺内的生物或物体投掷火焰。*进行远程法术*攻击。击中时，目标受到1d8火焰伤害。",
    higherLevel: "当你达到5级（4d8）、11级（2d8）和17级（3d8）时，伤害增加1d8。"
  },
  {
    id: "shocking-grasp", name: "电爪", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "触及", components: "声音, 姿势", duration: "立即",
    classes: ["奇械师","术士","法师"],
    description: "闪电从你身上跳向你试图触碰的生物。对该目标进*行一次近战法术*攻击。命中时，目标受到1d8闪电伤害，并且直到其下一个回合开始前不能进行机会攻击。",
    higherLevel: "当你达到5级（4d8）、11级（2d8）和17级（3d8）时，伤害增加1d8。"
  },
  {
    id: "guidance", name: "神导术", source: "PHB'24",
    level: 0, school: "预言", castingTime: "动作", range: "触及", components: "声音, 姿势", duration: "专注，至多1分钟",
    classes: ["奇械师","德鲁伊","牧师"],
    description: "你触摸一个自愿的生物并选择一项技能。*直到法术*结束，该生物在使用所选技能进行任何属性检定时都会增加1d4。"
  },
  {
    id: "spare-the-dying", name: "维生术", source: "PHB'24",
    level: 0, school: "死灵", castingTime: "动作", range: "15 尺", components: "声音, 姿势", duration: "立即",
    classes: ["奇械师","德鲁伊","牧师"],
    description: "选择一个射程内拥有0生命值且未死亡的生物。该生物变得稳重。",
    higherLevel: "当你达到5级（30英尺）、11级（60英尺）和17级（120英尺）时，射程加倍。"
  },
  {
    id: "dancing-lights", name: "舞光术", source: "PHB'24",
    level: 0, school: "幻术", castingTime: "动作", range: "120 尺", components: "声音, 姿势, 材料 (一点磷)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","奇械师","术士","法师"],
    description: "你在射程内创造出多达四个火炬大小的光源，使它们看起来像是火炬、灯笼或悬浮的发光球体，*持续时间为法术*持续时间。或者，你可以将这四个光源合并成一个模糊的人形中等大小的发光体。无论你选择哪种形式，每个光源都在10英尺半径内提供微光光照。作为一个附赠动作，你可以将光移动至多60英尺到射程内的某个空间。一个光必*须在由这个法术*创造的另一个光的20英尺范围内，如果一*个光超出了法术*的射程，它就会消失。"
  },
  {
    id: "thorn-whip", name: "荆棘之鞭", source: "PHB'24",
    level: 0, school: "变化", castingTime: "动作", range: "30 尺", components: "声音, 姿势, 材料 (带刺植物的茎)", duration: "立即",
    classes: ["奇械师","德鲁伊"],
    description: "你创造出一根长满荆棘的藤鞭，按照你的命令向射程内的生物猛击。对目标进*行一次近战法术*攻击。击中时，目标受到1d6点穿刺伤害，如果目标是大型或更小，你可以将其拉近至多10英尺。",
    higherLevel: "当你达到5级（4d6），11级（2d6）和17级（3d6）时，damage增加1d6。"
  },
  {
    id: "acid-splash", name: "酸液飞溅", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "60 尺", components: "声音, 姿势", duration: "立即",
    classes: ["奇械师","术士","法师"],
    description: "你在施法距离内一点创造出一颗酸液泡，在该点5尺球状范围内爆发。该球状区域内的每个生物必须通过一次敏捷豁免，否则受到1d6强酸伤害。",
    higherLevel: "当你达到5级（4d6），11级（2d6）和17级（3d6）时，damage增加1d6。"
  },
  {
    id: "chill-touch", name: "颤栗之触", source: "PHB'24",
    level: 0, school: "死灵", castingTime: "动作", range: "触及", components: "声音, 姿势", duration: "立即",
    classes: ["术士","法师","邪术师"],
    description: "通过传递坟墓的寒意，对触及范围内的目标进*行一次近战法术*攻击。击中时，目标受到1d10点亡灵伤害，并且在你的下一个回合结束之前无法恢复生命值。",
    higherLevel: "当你达到5级（4d10）、11级（2d10）和17级（3d10）时，damage增加1d10。"
  },
  {
    id: "prestidigitation", name: "魔法伎俩", source: "PHB'24",
    level: 0, school: "变化", castingTime: "动作", range: "10 尺", components: "声音, 姿势", duration: "1小时",
    classes: ["吟游诗人","奇械师","术士","法师","邪术师"],
    description: "你在射程内创造一个魔法效果。从下面的选项中选择效果。如果你多*次施放这个法术*，你可以同时有多达三个它的非即时效果活跃。 感官效应. 你创造一个立即生效的，无害的感观效应，比如一束火花，一阵风，微弱音乐或古怪的臭味。 玩火. 你立即点燃或熄灭一支蜡烛，一支火把或一小型营火。 清洁或弄脏. 你立即使一个不大于 1 立方尺的物件变得清洁或肮脏。 轻微感应. 你立即使一个不大于 1 立方尺的非活体物质变得冰冷、温暖或对其调味，其效应持续 1 小时。 魔法标记. 你在一个物件或一个表面上创造一块色斑，或者一个记号，又或者一个标志，其效应持续 1 小时。 你创造出一个非魔法的、无主的、非生命植物物质的物品。所创造物品的体积不能超过每施法者等级1立方英尺。你必须成功通过相应的手艺技能检定来制造复杂的物品。如果尝试使用任何创造出来的物品作为材料成分，*将导致法术*失败。[^1^]. 你创造了一个非魔法的小饰品或一个可以握在手中的幻象。它持续到你的下一个回合结束。一个小饰品不能造成任何伤害，也没有金钱价值。"
  },
  {
    id: "sorcerous-burst", name: "魔法爆发", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "120 尺", components: "声音, 姿势", duration: "立即",
    classes: ["术士"],
    description: "你对范围内的一个生物或物体投掷魔法能量。对目标进行远程攻击检定。命中时，目标受到1d8点你选择的类型的伤害：酸、冷、火、闪电、毒素、心灵或雷鸣。*如果你在此法术*中投掷了一个d8并得到了8点，你可以再投掷一个d8，并将其加到伤害上。*当你施放此法术*时，*你可以加到法术*伤害上的这些d8的最大数量等于你的施法能力调整值。",
    higherLevel: "当你达到5级（4d8）、11级（2d8）和17级（3d8）时，伤害增加1d8。"
  },
  {
    id: "eldritch-blast", name: "魔能爆", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "120 尺", components: "声音, 姿势", duration: "立即",
    classes: ["邪术师"],
    description: "你投掷出一束噼啪作响的能量。对范围内的一个生物或物*体进行远程法术*攻击。击中时，目标承受1d10点力量伤害。",
    higherLevel: "该法术在5级时创造两束光线，11级时创造三束光线，17级时创造四束光线。你可以将光线指向同一目标或不同目标。对于每束光线分别进行攻击检定。"
  },
  {
    id: "thunderclap", name: "鸣雷破", source: "PHB'24",
    level: 0, school: "塑能", castingTime: "动作", range: "自身 (5尺 emanation)", components: "姿势", duration: "立即",
    classes: ["吟游诗人","奇械师","德鲁伊","术士","法师","邪术师"],
    description: "每个位于你周围5英尺范围内的生物必须进行一次体质豁免检定，否则将受到1d6点雷鸣伤害。*该法术*的雷鸣之声可在100英尺外听见。",
    higherLevel: "当你达到5级（4d6），11级（2d6）和17级（3d6）时，damage增加1d6。"
  }
];
