import { SpellItem } from './types';

export const SPELL_DB_LEVEL_7: SpellItem[] = [
  // ==========================================
  // 7环法术 - PHB'24 Only
  // ==========================================

  {
    id: "gen-b0w9nc", name: "咒唤圣光", source: "PHB'24",
    level: 7, school: "咒法", castingTime: "动作", range: "90 尺", components: "声音、姿势", duration: "专注，至多10分钟",
    classes: ["牧师"],
    description: "你将来自上层位面的精魂咒唤，精魂表现为照耀以施法距离内一点为中心半径10尺、高40尺的柱状区域的光之立柱。对位于柱状区域内的你可见的生物，分别选择下列哪种光芒照耀于它。"
  },

  {
    id: "gen-cdoucd", name: "延迟爆裂火球", source: "PHB'24",
    level: 7, school: "塑能", castingTime: "动作", range: "150尺", components: "声音、姿势、材料（一颗蝙蝠粪和硫磺搓成的小球）", duration: "专注，至多1分钟",
    classes: ["术士","法师"],
    description: "一束黄光从你的指尖射向施法距离内你指定的一点，*并在法术*持续时间内在该点凝结成一颗珠子。法术终止时，珠子将伴着低吼炸裂成四窜的烈焰，位于目标点半径20尺球状区域内的每名生物都必须进行一次敏捷豁免。豁免失败者将承受全部累积的火焰伤害，豁免成功则只受到一半伤害。\n*该法术*的基础伤害为12d6，且若在你*回合结束时法术*尚未终止，则其伤害增加1d6。\n如果珠子爆炸前被生物触碰到，则该生物必须进行一次敏捷豁免。*豁免失败则法术*立即终止并触发爆炸效应。豁免成功则该生物可将珠子抛开至多40尺。当珠子进入一名生物的空间或撞到某个固态物件时，法术立即终止并且触发爆炸效应。\n珠子爆炸时，区域内未被着装或携带的可燃物件会开始燃烧。",
    higherLevel: "*使用的法术*位每比七环高一环，基础伤害就提高1d6。"
  },

  {
    id: "gen-dfic2", name: "圣言术", source: "PHB'24",
    level: 7, school: "塑能", castingTime: "附赠动作", range: "30尺", components: "声音", duration: "立即",
    classes: ["牧师"],
    description: "**你吟诵一句充盈上层位面** Planes力量的箴言。施法距离内所有由你指定的生物都必须进行一次魅力豁免。豁免失败者，若其生命值低于50，则基于其当前生命值承受以下效应，如圣言效应表中所示。无论其生命值如何，失败于豁免的天族生物、元素生物、妖精生物、邪魔生物均会被遣送回其起源位面（若其并不在其起源位面）**并且除非通过祈愿术**，否则其在24小时内不能以任何方式返回当前位面。"
  },

  {
    id: "gen-bzmq9", name: "以太化", source: "PHB'24",
    level: 7, school: "咒法", castingTime: "动作", range: "自身", components: "声音、姿势", duration: "至多8小时",
    classes: ["吟游诗人","牧师","术士","邪术师","法师"],
    description: "**你进入当前所处位面与以太位面** Plane边缘的重叠空间。**你*在法术*持续时间内一直呆在该以太边界**。在此期间，你可以向任意方向移动。如果你向上或向下移动，则你移动的每尺距离需要额外消耗一尺的移动力。你可以观察原位面，但是所有事物都以灰度显示，而你也看不到60尺外的东西。\n处于以太位面期间，只有同样处在以太位面的其他生物、物件和效应才能被你影响或影响你。不在以太位面的生物无法察觉你，也无法与你互动，除非有一项特性允许他们这么做。\n法术终止时，你立刻回到原本所在的位面中与以太边界中你所处位置相对应的空间位置。若你出现于一处被占空间，则你立刻被弹到最靠近的一处未占空间中，并受到两倍于你因此被移动尺数点的力场伤害。\n如*果你在施展法术*时正处于以太位面，或所在位面与以太位面不相连（**比如某个外层位面** ），*则法术*立即结束。",
    higherLevel: "使用*八环施展此法术*时，你可以指定至多三名自愿生物（包括你在内）；使用九环时，你可以指定至多六名自愿生物（包括你在内）。所有所选生物在你施法时必须距你10尺内。"
  },

  {
    id: "gen-dvxf65", name: "死亡一指", source: "PHB'24",
    level: 7, school: "死灵", castingTime: "动作", range: "60尺", components: "声音、姿势", duration: "立即",
    classes: ["术士","邪术师","法师"],
    description: "你向施法距离内的一个可见生物释放负能量。该生物必须进行一次体质豁免。豁免失败则受到7d8+30点暗蚀伤害，豁免成功则伤害减半。\n*被该法术*杀死的类人生物将在你下一回合开始时被唤起为一只受你操控的丧尸Zombie（见附录B），并在随后尽力遵循你的口头指令。"
  },

  {
    id: "gen-enrhjf", name: "火焰风暴", source: "PHB'24",
    level: 7, school: "塑能", castingTime: "动作", range: "150尺", components: "声音、姿势", duration: "立即",
    classes: ["牧师","德鲁伊","术士"],
    description: "一片烈焰风暴出现在施法距离内。风暴的区域由至多十个10尺立方区域组成。你可以自行安排各立方区域的组合方式。每个立方区域必须至少与一个其他的立方区域相连。区域内每个生物必须进行一次敏捷豁免。豁免失败者将受到7d10点火焰伤害，豁免成功则伤害减半。\n区域内所有未被着装或携带的可燃物件会开始燃烧。"
  },

  {
    id: "gen-asfnqo", name: "力场监牢", source: "PHB'24",
    level: 7, school: "塑能", castingTime: "动作", range: "100尺", components: "声音、姿势、材料（价值1500GP+的红宝石尘，作为法术耗材）", duration: "专注，至多1小时",
    classes: ["吟游诗人","邪术师","法师"],
    description: "你围绕施法距离内一处指定地点力场构筑出一个固定的立方状隐形Invisible监牢。你可以选择监牢的形式为笼状或盒状。\n笼状监牢为各边长至多20尺的立方体，其墙体由1/2寸粗的力场栅栏杆组成，每根杆子之间相距1/2寸。盒状监牢为各边长至多10尺的立方体，其墙体为由力场墙密封，并阻隔一切物质进出，也会阻挡任何从区域中向外界施展或从外界向区*域中施展的法术*。\n*施展该法术*时，*所有完全在法术*区域内的生物将被牢笼困住。部分处于区域内或者体型比区域更大的生物则被从区域中心向外推开，直至其完全离开该区域。\n牢笼内的生物不能以非魔法的手段离开。如果该生物试图使用传送或跨位面旅行来离开牢笼，则其必须先进行一次魅力豁免。豁免成功则该生物可以用该魔法离开牢笼。豁免失败者将无法以此离开牢笼*并浪费掉该法术*或效应。**该牢笼同时延伸至以太位面** 从而屏蔽途经以太位面的旅行。\n**该法术不能被解除魔法** 解除。"
  },

  {
    id: "gen-e7gm84", name: "海市蜃楼", source: "PHB'24",
    level: 7, school: "幻术", castingTime: "10分钟", range: "视野", components: "声音、姿势", duration: "10日",
    classes: ["吟游诗人","德鲁伊","法师"],
    description: "你使至多 1 里方形区域内的地形在视觉、听觉、嗅觉、甚至触觉上都像是某种其他的地形，不过其地形的大致形状仍保持不变。你可以让开阔的平原或者一条路可能变得像一片湿地，一座小山，一个裂谷或是其他困难或无法通行的地形。你还可以让一个池塘变得像一片茂盛的草地，一个悬崖变得像一个缓坡，或者让一个乱石沟变得像一条宽阔平坦的大路。\n另外，你还可以改变建筑物的外观，或者在本来没有建筑物的地方添上建筑物。*该法术*不可以伪装、隐藏或增添生物。\n*该幻术*是听觉、视觉、触觉和嗅觉的综合体，因而其可以把空旷的地面变成困难地形（反之亦然），乃至阻碍区域内的通行。幻象地形的任何一小部分（例如一块石头或者一根树枝）*被移动到法术*区域外时都会立刻消失不见。\n拥有真实视觉的生*物可以看穿幻术*，洞悉地形的真实形态；然而幻象的所有其他元素仍会得以保留，所以一个意识到这是幻象的生物仍然可以与该幻象进行物理互动。"
  },

  {
    id: "gen-hvdkdg", name: "魔邓肯豪宅术", source: "PHB'24",
    level: 7, school: "咒法", castingTime: "1分钟", range: "300尺", components: "声音、姿势、材料（一个价值15GP+的微缩模型门）", duration: "24小时",
    classes: ["吟游诗人","法师"],
    description: "你在施法距离内召唤一扇微微发光的门，*并维持至法术*持续时间结束。门宽5尺，高10尺，指向一个异次元居所。只要该门保持开启，你*和你施展该法术*时指定的任意生物都可以进入该异次元居所中。你可以在距该门不超过 30 尺处开启或关闭之（无需动作）。门在关闭状态下其无法被发现。\n门的另一侧是一个连接着众多房间的华丽大厅。整个居所的空气洁净清新而温暖舒适。\n你可以随意创造自己喜欢的房间构造，但不得超出50个相连的边长10尺的立方体。空间内依你喜好配置好家具和装饰，其内储备的食材足以制作供至多100人享用的九菜大宴。*由该法术*创造的家具和其他物品如果被移出豪宅，就会化作烟雾消散。\n一组共100名的近乎透明的仆从会招待任何进入房间的人。仆从的外貌着装由你决定，它们无法受伤并服从你的命令。每个仆从都可以完成一个普通人程度的工作，但它们不能攻击或者进行任何直接伤害其他生物的行动。因而仆从可以完成的工作包括：取来物品、清洁、修理、叠衣服、生火、上菜、倒酒等等。仆从不能离开该居所。\n*该法术*终止时，任何仍处于该异次元空间内的生物或物件都将被移出空间内，并出现在距离入口最近未被占据的空间内。"
  },

  {
    id: "gen-d6gsei", name: "魔邓肯之剑", source: "PHB'24",
    level: 7, school: "塑能", castingTime: "动作", range: "90尺", components: "声音、姿势、材料（一把价值250GP+的微缩模型剑）", duration: "专注，至多1分钟",
    classes: ["吟游诗人","法师"],
    description: "你在施法距离内创造出一个悬浮的灵体剑刃，*其在法术*持续时间内持续存在。\n幽灵剑出现时，你可以对该剑 5 尺内的一个目标进*行一次近战法术*攻击。命中时，目标受到 4d12+你的施法属性调整值 点力场伤害。\n在你的后续回合内，你能够以一个附赠动作将剑移动至多30尺至一处可见位置。随后你可以对相同或不同目标再次发动该攻击。"
  },

  {
    id: "gen-amxzlw", name: "位面转移", source: "PHB'24",
    level: 7, school: "咒法", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一根与一个存在位面调谐的价值250GP+的分叉金属棒）", duration: "立即",
    classes: ["牧师","德鲁伊","术士","邪术师","法师"],
    description: "你和至多八名手牵着手形成一个圆圈的自愿生物被转移到一个不同的存在位面。你可以概括地指名一个目的地，**比如火元素位面** Fire**的黄铜之城**，**或九层地狱** Hells**第二层迪斯帕特** 的宫殿，按照DM的判断，你将出现在目的地里或其附近。\n另外，如果你知道某个处于另一位面的传送法阵的印记序列，*则该法术*可以把你带到该法阵处。如果该传送法阵太小而装不下所有你转移的生物，则他们会出现在离传送法阵最近的未占据空间中。"
  },

  {
    id: "gen-cdu3ze", name: "律令巩固", source: "PHB'24",
    level: 7, school: "惑控", castingTime: "动作", range: "60尺", components: "声音", duration: "立即",
    classes: ["吟游诗人","牧师"],
    description: "你增强施法距离内你可见的至多六名生物的防御。*此法术赋予受术*者共计120点临时生命值 ，*由你在受术*者中任意分配。"
  },

  {
    id: "gen-hawwm5", name: "虹光喷射", source: "PHB'24",
    level: 7, school: "塑能", castingTime: "动作", range: "自身", components: "声音、姿势", duration: "立即",
    classes: ["吟游诗人","术士","法师"],
    description: "八条光线从你的手上闪出，作用于60尺锥形范围。每名位于锥形之中的生物进行一次敏捷豁免。为每个目标掷一次1d8来决定影响到它的射线种类，参照虹光射线表。"
  },

  {
    id: "gen-ewmcz", name: "投影术", source: "PHB'24",
    level: 7, school: "幻术", castingTime: "动作", range: "500里", components: "声音、姿势、材料（一尊价值5GP+的自塑像）", duration: "专注，至多1日",
    classes: ["吟游诗人","法师"],
    description: "你创造一个自己的幻象分身，*并使其在法术*持续时间内维持存在。该分身可以出现在施法距离内你曾见过的任何地点，而不论中间是否存在障碍物。该幻象看起来和听起来都与你一样，只是没有现实形体。幻象受到伤害时会立即消失，法术终止。\n你可以通过分身的眼睛视物，用分身的耳朵聆听，如同你处于它的位置一样。用一个魔法动作，你能使分身移动至多60尺，而其姿态、言语和行为均按照你的指定作表现。幻象可以完美地模仿你的举止。\n由于东西可以穿过幻象，任何与该幻象进行的物理互动都会暴露其幻觉本质。一名生物可以采取研究动作进行*一次对抗你法术*豁免DC的成功智力（调查）检定以看穿幻象。辨出幻象的生物可以看穿该影像，其产生的声响对该生物而言显得虚假。"
  },

  {
    id: "gen-cii4d", name: "再生术", source: "PHB'24",
    level: 7, school: "变化", castingTime: "1分钟", range: "触碰", components: "声音、姿势、材料（一个转经筒）", duration: "1小时",
    classes: ["吟游诗人","牧师","德鲁伊"],
    description: "一名你触碰的生物恢复4d8+15点生命值。在持续时间内，目标在其每回合开始时恢复1点生命值，且其失去的任何身体部位都将在2分钟后重新长出。"
  },

  {
    id: "gen-dm1tp", name: "复生术", source: "PHB'24",
    level: 7, school: "死灵", castingTime: "1小时", range: "触碰", components: "声音、姿势、材料（一颗价值1000GP+的钻石，作为法术耗材）", duration: "立即",
    classes: ["吟游诗人","牧师"],
    description: "你触碰一名已死，但死亡时间不超过100年，并非死于年老，且死亡时并非亡灵的生物，使其回生。\n生物以生命值全满的状态重生。*该法术*同样会中和在该生物死亡时仍在生效的毒素。*该法术*能治愈所有致命伤，恢复所有失去的身体部位。\n死而复生是一个痛苦的体验。目标进行D20检定时具有-4减值。目标每完成一次长休，其减值就减少1，直至减值变为0。\n*使用该法术*复活一名已死去365日或更久的生物会使你耗费大量精力。在你完成一次长休前，你将无法*再施展任何法术*，且此时你进行的一切D20检定具有劣势。"
  },

  {
    id: "gen-b67s31", name: "反转重力", source: "PHB'24",
    level: 7, school: "变化", castingTime: "动作", range: "100尺", components: "声音、姿势、材料（一颗天然磁石和铁屑）", duration: "专注，至多1分钟",
    classes: ["德鲁伊","术士","法师"],
    description: "*该法术*以施法距离内一点为中心，创造一个半径50尺、高100尺的重力反转柱状区域。区域内所有未被固定在地面上的生物和物件都会向上落去，直到碰到该区域顶端为止。一名生物可以进行一次敏捷豁免以抓住一件他能触及的固定物件，从而避免向上坠落。\n如果目标在坠落过程中撞上任何固体（比如天花板或被固定的物件），则坠落的物件和生物会受到同样情况下正常坠落时所会受到的冲击。如果一个物件或生物到达该区域的顶部并且没有撞到任何东西，则它将在持续时间内悬浮在该处。法术终止时，*所有受术**物件和受术*生物向下坠落。"
  },

  {
    id: "gen-mn9m0", name: "隔离术", source: "PHB'24",
    level: 7, school: "变化", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（价值5000GP+宝石粉尘，作为法术耗材）", duration: "直至被解除",
    classes: ["法师"],
    description: "你触碰一个物件或自愿生物，以魔法将其隔离起来。*在法术*持续期间，目标具有*隐形*状态并且不*会被预言系法术*作为目标，不会被魔法侦测，也不会被魔法远程观察到。\n如果目标是一个生物，它会进入静滞。它陷入*失能*状态，不会衰老，也不需要进食、饮水或呼吸空气。\n你可以设*置一个让该法术*提前终止的条件。该条件由你自由设定，但必须是发生在目标周围 1 里范围内或能在目标周围1里范围内看到的事件。例如：“1000 年以后”或者“当泰拉斯奎苏醒时”。*如果受术*者受到任何伤害，*则该法术*立刻终止。"
  },

  {
    id: "gen-evnmn", name: "拟像术", source: "PHB'24",
    level: 7, school: "幻术", castingTime: "12小时", range: "触碰", components: "声音、姿势、材料（价值1500GP+的红宝石粉末，作为法术耗材）", duration: "直至被解除",
    classes: ["法师"],
    description: "你创造一个野兽或类人生物的拟像，该生物在整段施法时间内必须一直在你的10尺内。结束施法时，你同时触碰该生物以及和该生物同样体型的一堆冰或者雪，然后冰雪变化为该生物的拟像。拟像是一个生物。它使用拟像对象本体在施法时的游戏数据，但其类别为构装，生命值上限为本体生命值上限的一半，并且它*无法施展拟像术*。\n拟像对你和你所选定的生物态度友善。它服从你的命令并在战斗中你的回合里行动。拟像不能升级，也不能进行短休和长休。\n如果拟像受到了伤害，想让其生命值恢复的唯一手段就是为其进行修理（作为长休 的一部分）。而若想要修理一个拟像，拟像必须在长休期间时刻处于你周围5尺内，且每为其恢复一点生命值就需要消耗你价值100GP*的法术*耗材。\n拟像会一直持续到其生命值降至0为止，在生命值降至0时它会变回冰雪并立刻融化。*再次施展此法术*时，任*何你已用此法术*创造出来的拟像都会立刻被摧毁。"
  },

  {
    id: "gen-ep5h8", name: "徽记术", source: "PHB'24",
    level: 7, school: "防护", castingTime: "1分钟", range: "触碰", components: "声音、姿势、材料（价值1000GP+的钻石粉末，作为法术耗材）", duration: "直到法术被解除或触发",
    classes: ["吟游诗人","牧师","德鲁伊","法师"],
    description: "*施展该法术*时，你在某个表面（诸如地板或墙的一部分）或某个能被关闭的物件里（诸如书本或宝箱）刻下一个伤害性的符纹。符纹可以覆盖周边不超过 10 尺直径的区域。如果你指定某个物件，则该物件必须待在其所在位置；如果该物件从你施法的位置被移动超过 10 尺，则其符*纹被破坏且法术*不被触发即告终止。\n该符纹近乎*隐形*，其*需要成功以法术*的豁免 DC 进行一次智力（调查）检定才能被发现。\n你在刻下符文时决定该符纹的触发条件并选择徽记承载的效应：死亡、争斗、恐惧、痛苦、睡眠或*震慑*。对应效应在下面详述。\n**设置触发条件**。 你在施法时决定由什么来触发符纹。刻画于表面的符纹其通常的触发条件包括：触碰或站立在符纹上；拿掉覆盖在符纹上的物件；进入符纹一定施法距离。刻画在物件内的符纹其通常的触发条件包括：打开物件；看到该符纹等。\n你可以进一步细化触发条件以便特定生物种类才能激活之（例如将符纹设定为影响异怪）。你还可以将符合条件者排除在符纹触发者之外，例如说出特定口令的人。\n符纹一旦被触发就会开始变大，使其周围 60 尺半径的球状区域处于微光光照并持续 10 分钟，*此后法术*即告终止。符纹生效时，所有位于球状区域内的*生物即成为法术*效应的目标。生物在一个回合内第一次进入该区域内或在其中结束其回合时，也同样会成为符文效应的目标。一个生物每回合只能成为其目标一次。"
  },

  {
    id: "gen-caa9a", name: "传送术", source: "PHB'24",
    level: 7, school: "咒法", castingTime: "动作", range: "10尺", components: "声音", duration: "立即",
    classes: ["吟游诗人","术士","法师"],
    description: "*此法术*立即将你和至多八名施法距离内你可见的自愿生物，或者施法距离内你可见的一个物件转移至你选择的目的地。如果目标为一个物件，则其必须为大型Large或更小，且不能被一名非自愿生物持握或携带。\n你必须知道目的地，且目的地必须与你位于同一个存在位面。你对目的地的熟悉程度决定了你抵达目的地的成功率。DM骰1d100并参照传送结果表和其后的详述。"
  }
];
