import { SpellItem } from './types';

export const SPELL_DB_LEVEL_1: SpellItem[] = [
  // ==========================================
  // 1环法术
  // ==========================================
  {
    id: "color-spray", name: "七彩喷射", source: "PHB'24",
    level: 1, school: "幻术", castingTime: "动作", range: "自身 (15尺 锥形)", components: "声音, 姿势, 材料 (一小撮彩色沙子)", duration: "立即",
    classes: ["吟游诗人","术士","法师"],
    description: "你发射出一系列令人眼花缭乱的闪烁、五彩斑斓的光芒。在你发出的15英尺锥形区域内的每个生物都必须成功进行一次体质豁免检定，否则直到你的下一个回合结束都会获得*目盲*状态。"
  },
  {
    id: "dissonant-whispers", name: "不谐低语", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "动作", range: "60 尺", components: "声音", duration: "立即",
    classes: ["吟游诗人"],
    description: "在你射程内你能看到的一个你选择的生物在它的脑海中听到了一段不和谐的曲调。目标必须进行一次智慧豁免检定。如果豁免失败，它将受到3d6点心灵伤害，并且必须立即使用它的反应（如果可用），尽可能远地沿着最安全的路线远离你。如果豁免成功，目标只受到一半的伤害。",
    higherLevel: "对于1级以上的法术位，每增加一级，伤害增加1d6。"
  },
  {
    id: "fog-cloud", name: "云雾术", source: "PHB'24",
    level: 1, school: "咒法", castingTime: "动作", range: "120 尺", components: "声音, 姿势", duration: "专注，至多1小时",
    classes: ["德鲁伊","术士","法师","游侠"],
    description: "你在射程内的某一点为中心创建一个20英尺半径的雾气球体。球体被重度遮蔽。它持续到持续时间结束，或者直到强风（*如由*造风术*法术*创造的）将其驱散。",
    higherLevel: "雾的半径每超过1级法术位就增加20英尺。"
  },
  {
    id: "detect-evil-and-good", name: "侦测善恶", source: "PHB'24",
    level: 1, school: "预言", castingTime: "动作", range: "自身 (30尺 半径)", components: "声音, 姿势", duration: "专注，至多10分钟",
    classes: ["圣武士","牧师"],
    description: "在持续时间内，你可以感知到距离自身30英尺内的任何异怪、天界生物、元素、精类生物、邪魔或不死生物的位置。你还可以*感知到圣居法术*是否在此处生效，如果生效，还可以感知其所在位置。法术被1英尺厚的石头、泥土或木头；1英寸厚的金属；或薄铅板所阻挡。"
  },
  {
    id: "detect-poison-and-disease", name: "侦测毒性和疾病", source: "PHB'24",
    level: 1, school: "预言 (ritual)", castingTime: "动作", range: "自身 (30尺 半径)", components: "声音, 姿势, 材料 (一片红豆杉叶)", duration: "专注，至多10分钟",
    classes: ["圣武士","德鲁伊","游侠","牧师"],
    description: "在持续时间内，你能感知到自身周围30英尺范围内的毒药、有毒或带毒生物以及魔法传染源的位置。你能感知到每种情况下的毒药、生物或传染源的类型。法术被1英尺厚的石头、泥土或木头；1英寸厚的金属；或薄铅板所阻挡。"
  },
  {
    id: "detect-magic", name: "侦测魔法", source: "PHB'24",
    level: 1, school: "预言 (ritual)", castingTime: "动作", range: "自身 (30尺 半径)", components: "声音, 姿势", duration: "专注，至多10分钟",
    classes: ["吟游诗人","圣武士","奇械师","德鲁伊","术士","法师","游侠","牧师","邪术师"],
    description: "在持续时间内，你能感知到自身周围30英尺内的魔法效果。如果你感知到这样的效果，你可以采取魔法动作，看到任何可见的带有魔法的生物或物体周围有微弱的光环，如果这*个效果是由法术*创造的，*你将了解法术*的魔法学派。法术被1英尺厚的石头、泥土或木头；1英寸厚的金属；或薄铅板所阻挡。"
  },
  {
    id: "guiding-bolt", name: "光导箭", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "动作", range: "120 尺", components: "声音, 姿势", duration: "1轮",
    classes: ["牧师"],
    description: "你向射程内的生物投掷一道光线。对该目*标进行远程法术*攻击。命中时，它受到4d6点辐射伤害，并且在你的下一个回合结束前，下一次对它的攻击掷骰获得优势。",
    higherLevel: "每比1级法术位高一级，伤害增加1d6。"
  },
  {
    id: "ice-knife", name: "冰刃", source: "PHB'24",
    level: 1, school: "咒法", castingTime: "动作", range: "60 尺", components: "姿势, 材料 (一滴水或一块冰)", duration: "立即",
    classes: ["德鲁伊","术士","法师"],
    description: "你制造出一块冰晶裂片，并将它射向施法距离内的一个生物。你对目标进*行一次远程法术*攻击。若击中，目标受到1d10点穿刺伤害。无论击中与否，裂片都会在之后爆裂。目标和周围 5 尺范围内的每个生物必须通过一次敏捷豁免检定，否则受到2d6点冷冻伤害。",
    higherLevel: "每高于1级的法术位，寒冷伤害增加1d6。"
  },
  {
    id: "purify-food-and-drink", name: "净化食粮", source: "PHB'24",
    level: 1, school: "变化 (ritual)", castingTime: "动作", range: "10 尺", components: "声音, 姿势", duration: "立即",
    classes: ["圣武士","奇械师","德鲁伊","牧师"],
    description: "你清除了范围内一个点为中心的5英尺半径球体内的非魔法食物和饮料中的毒素和腐烂。"
  },
  {
    id: "speak-with-animals", name: "动物交谈", source: "PHB'24",
    level: 1, school: "预言 (ritual)", castingTime: "动作", range: "自身", components: "声音, 姿势", duration: "10分钟",
    classes: ["吟游诗人","德鲁伊","游侠","邪术师"],
    description: "在持续时间内，你能够理解并与野兽口头交流，你可以使用影响力动作的任何技能选项与它们互动。大多数野兽对于与生存或陪伴无关的话题几乎没有什么可说的，但至少，一个野兽可以给你提供附近地点和怪物的信息，包括它在过去一天内所感知到的任何事物。"
  },
  {
    id: "animal-friendship", name: "化兽为友", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "动作", range: "30 尺", components: "声音, 姿势, 材料 (少量食物)", duration: "24小时",
    classes: ["吟游诗人","德鲁伊","游侠"],
    description: "在施法距离内指定一只你能看见的野兽。该野兽必须通过一次感知豁免，*否则将在法术*持续时间内被你*魅惑*。如果你或你的盟友对目标造成伤害，*则法术*终止。",
    higherLevel: "你使用的法术位每比一环高一环，就可以多选择一个野兽作为目标。"
  },
  {
    id: "command", name: "命令术", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "动作", range: "60 尺", components: "声音", duration: "立即",
    classes: ["吟游诗人","圣武士","牧师"],
    description: "你对射程内你能看到的一个生物说出一个词的命令。目标必须成功进行一次智慧豁免检定，否则在其下一个回合遵循该命令。从以下选项中选择命令：过来. 目标以最短最直接的路线向你移动，并在到达距你5尺时结束其回合。放下. 目标放下手中持握物并结束其回合。走开. 目标在其回合内以最快最有效的方式远离你。趴下. 目标获得*倒地*状态，然后结束其回合。立定. 在它的回合，目标不移动，也不采取任何动作或附赠动作。",
    higherLevel: "每超过1级的法术位，你可以额外影响一个生物。"
  },
  {
    id: "arms-of-hadar", name: "哈达之臂", source: "PHB'24",
    level: 1, school: "咒法", castingTime: "动作", range: "自身 (10尺 emanation)", components: "声音, 姿势", duration: "立即",
    classes: ["邪术师"],
    description: "召唤哈达尔，你使触手从自身爆发而出。在你周围10英尺范围内的每个生物必须进行一次力量豁免检定。未成功豁免的目标受到2d6点死灵伤害，并且在其下一个回合开始之前不能进行反应。成功豁免的目标只受到一半的伤害。",
    higherLevel: "对于高于1级的每个法术位，伤害增加1d6。"
  },
  {
    id: "tashas-hideous-laughter", name: "塔莎狂笑术", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "动作", range: "30 尺", components: "声音, 姿势, 材料 (一个馅饼和一根羽毛)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","法师","邪术师"],
    description: "在你射程内的你选择的一个生物必须进行一次智慧豁免检定。如果检定失败，它在持续时间内会处于倒地和*失能*状态。在那段时间里，如果它能够笑出声，它会无法控制地大笑，并且它不能自行结束*倒地*状态。在它的每个回合结束时以及每次它受到伤害时，它进行一次额外的智慧豁免检定。如果豁免是由伤害触发的，目标在这次豁免上具有优势。成功通过豁免，法术结束。",
    higherLevel: "对于超过1级的每个法术位，你可以额外选择一个目标。"
  },
  {
    id: "longstrider", name: "大步奔行", source: "PHB'24",
    level: 1, school: "变化", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (一撮泥土)", duration: "1小时",
    classes: ["吟游诗人","奇械师","德鲁伊","法师","游侠"],
    description: "你触摸一个生物。目*标的速度在法术*持续时间内增加10英尺。",
    higherLevel: "每超过1级的法术位，你可以额外选择一个生物作为目标。"
  },
  {
    id: "faerie-fire", name: "妖火", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "动作", range: "60 尺", components: "声音", duration: "专注，至多1分钟",
    classes: ["吟游诗人","奇械师","德鲁伊"],
    description: "在范围内的20英尺立方体内，物体被蓝色、绿色或紫罗兰色（你选择）的光勾勒出轮廓。如果立方体内的每个生物未能通过敏捷豁免，它们也会被勾勒出轮廓。在持续时间内，物体和受影响的生物在10英尺半径内发出微光光照，并且不能从*隐形*状态中受益。如果攻击者能够看到受影响的生物或物体，对受影响生物或物体的攻击检定具有优势。"
  },
  {
    id: "find-familiar", name: "寻获魔宠", source: "PHB'24",
    level: 1, school: "咒法 (ritual)", castingTime: "1小时", range: "10 尺", components: "声音, 姿势, 材料 (价值10+金币的燃烧香，法术会消耗掉它)", duration: "立即",
    classes: ["法师"],
    description: "你可以获得一只魔宠，这是一种以你选择的动物形态出现的灵体：蝙蝠、猫、青蛙、鹰、蜥蜴、章鱼、猫头鹰、老鼠、渡鸦、蜘蛛、鼬鼠，或其他具有挑战等级为0的野兽。魔宠出现在你范围内的一个未被占据的空间中，它具有所选形态的统计数据，但它是一个天界生物、精类生物或邪魔（由你选择），而不是野兽。你的魔宠独立行动，但它会服从你的命令。 心灵感应连接. 当你的魔宠在你100英尺范围内时，你可以与它心灵感应交流。此外，作为一个附赠动作，你可以透过魔宠的眼睛看东西，听到它所听到的，直到你的下一个回合开始，获得它所拥有的任何特殊感官的好处。最后，当你施放一个*接触范围的法术*时，你的魔宠可以传递接触。你的魔宠必须在你100英尺范围内，并*且在你施放法术*时必须采取一个反应动作来传递接触。 战斗. 魔宠是你的盟友以及你盟友的盟友。它有自己的先攻并在自己的回合行动。魔宠不能攻击，但它可以正常采取其他行动。 魔宠的消失. 当魔宠降至0点生命值时，它会消失。当你再*次施放这个法术*时，它会重新出现。作为一个魔法动作，你可以暂时将魔宠解雇到一个口袋维度。或者，你可以永远解雇它。当它被暂时解雇时，作为一个魔法动作，你可以让它在你30英尺范围内的未被占据的空间重新出现。每当魔宠降至0点生命值或消失到口袋维度时，它会留下它所穿戴或携带的任何物品。 仅限一个魔宠. 你一次不能拥有超过一个的魔宠。如果你在已经有魔宠的情况*下施放这个法术*，你会让它转而采取一个新的合适的形态。"
  },
  {
    id: "witch-bolt", name: "巫术箭", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (被闪电击中的小树枝)", duration: "专注，至多1分钟",
    classes: ["术士","法师","邪术师"],
    description: "一束噼啪作响的能量射向射程内的一个生物，在你和目标之间形成一道持续的闪电弧。对目标进*行一次远程法术*攻击。若命中，目标受到2d12点闪电伤害。在你的随后每个回合中，你可以使用一个附赠动作自动对目标造成1d12点闪电伤害，即使第一次攻击未命中。如果*目标离开了法术*的范围，或者它从你那里获得了掩护，*则该法术*结束。",
    higherLevel: "初始伤害随着每个高于1级的法术位增加1d12。"
  },
  {
    id: "sanctuary", name: "庇护术", source: "PHB'24",
    level: 1, school: "防护", castingTime: "附赠动作", range: "30 尺", components: "声音, 姿势, 材料 (镜子的一块碎片)", duration: "1分钟",
    classes: ["奇械师","牧师"],
    description: "你在范围内的生物周围设下防护。*直到法术*结束，任何用攻击*检定或伤害法术*瞄准被保护生物的生物必须进行一次智慧豁免，否则必须选择新目标或*失去攻击或法术*。*此法术*不能保护被保护生物免受区域效果影响。如果受保护的生物进行攻击检定、施法或造成伤害，法术就会结束。"
  },
  {
    id: "compelled-duel", name: "强令对决", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "附赠动作", range: "30 尺", components: "声音", duration: "专注，至多1分钟",
    classes: ["圣武士"],
    description: "你试图迫使一个生物与你决斗。射程内你能看到的一个生物必须进行一次智慧豁免检定。如果豁免失败，目标在对除了你之外的其他生物进行攻击检定时具有劣势，并且它不能自愿移动到距离你超过30英尺的地方。如果你对非目标生物进行攻击检定、对目标以外*的敌人施放法术*、你的盟友对目标造成伤害，或者你的回合结束时与目标的距离超过30英尺，*则法术*结束。"
  },
  {
    id: "shield", name: "护盾术", source: "PHB'24",
    level: 1, school: "防护", castingTime: "反应", range: "自身", components: "声音, 姿势", duration: "1轮",
    classes: ["术士","法师"],
    description: "一个难以察觉的魔法力场保护着你。直到你的下一个回合开始，你对AC有+5的加值，包括对触发攻击的防御，并且不受魔法飞弹的伤害。"
  },
  {
    id: "silent-image", name: "无声幻影", source: "PHB'24",
    level: 1, school: "幻术", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (少许羊毛)", duration: "专注，至多10分钟",
    classes: ["吟游诗人","术士","法师"],
    description: "你创造一个影像，其形象来自一个大小不超过边长 15 尺立方体的物件，生物或其他的可视现象。影像出现在施法距离内你能看见的一*处位置并在法术*持续时间内持续存在。该影像是纯粹的视觉影像；它不会被听觉，嗅觉或其他感官感受到。作为一个魔法动作，你可以让这个影像移动到范围内的任何地方。当影像改变位置时，你可以改变它的外观，使其动作看起来自然。例如，如果你创造了一个生物的影像并移动它，你可以改变影像，使其看起来像是在行走。与图像进行物理互动可以揭示它是一个幻象，因为物体可以穿过它。一个生物如果采取研究行动来检查图像，可以通过一次成功的智力(调查)检定（*对抗你的法术*豁免难度等级）来确定这是一个幻象。如果一个生物识破了这个幻象，该生物就能看穿这个图像。"
  },
  {
    id: "disguise-self", name: "易容术", source: "PHB'24",
    level: 1, school: "幻术", castingTime: "动作", range: "自身", components: "声音, 姿势", duration: "1小时",
    classes: ["吟游诗人","奇械师","术士","法师"],
    description: "*在法术*结束前，你让自己——包括你的衣物、盔甲、武器以及你身上的其他物品——看起来不同。你可以看起来矮1英尺或高1英尺，也可以看起来更重或更轻。你必须采取和你有相同基本肢体排列的形式。除此之外，幻觉的范围由你决定。*这个法术*所制造的变化无法通过物理检查。例如，如果*你使用这个法术*给你的装扮添加了一顶帽子，物体会穿过这顶帽子，任何触摸它的人都会感觉不到任何东西。要识破你的伪装，一个生物必须采取研究行动来检查你的外貌，并且*在对抗你的法术*抗力DC的智力(调查)检定中成功。"
  },
  {
    id: "hail-of-thorns", name: "棘雹术", source: "PHB'24",
    level: 1, school: "咒法", castingTime: "附赠动作", range: "自身", components: "声音", duration: "立即",
    classes: ["游侠"],
    description: "当你击中生物时，*这个法术*会创造出从你的远程武器或弹药中生长出的荆棘雨。攻击的目标以及它周围5英尺内的每个生物都需要进行一次敏捷豁免检定，若失败则受到1d10穿刺伤害，若成功则受到一半的伤害。",
    higherLevel: "对于高于1级的法术位，伤害增加1d10。"
  },
  {
    id: "grease", name: "油腻术", source: "PHB'24",
    level: 1, school: "咒法", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (一小块猪油或奶油)", duration: "1分钟",
    classes: ["奇械师","术士","法师"],
    description: "不燃的油脂覆盖在射程内某点为中心的10英尺范围内的地面，并在整个持续期间将其变为困难地形。当油脂出现时，在其区域内站立的每个生物都必须成功进行一次敏捷豁免检定，否则会受到*倒地*状态影响。进入该区域或在其回合结束时位于那里的生物也必须成功进行该豁免检定，否则会倒地*倒地*。"
  },
  {
    id: "healing-word", name: "治愈真言", source: "PHB'24",
    level: 1, school: "防护", castingTime: "附赠动作", range: "60 尺", components: "声音", duration: "立即",
    classes: ["吟游诗人","德鲁伊","牧师"],
    description: "你能看到的范围内你选择的一个生物恢复等于2d4加上你施法能力调整值的生命值。",
    higherLevel: "每高于1级的法术槽等级，治疗量增加2d4。"
  },
  {
    id: "mage-armor", name: "法师护甲", source: "PHB'24",
    level: 1, school: "防护", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (一块鞣制过的皮革)", duration: "8小时",
    classes: ["术士","法师"],
    description: "你触摸一个自愿的且没有穿戴护甲的生物。*直到法术*结束，目标的基础AC变为13加上它的敏捷调整值。如果目标穿上护甲，法术会提前结束。"
  },
  {
    id: "wrathful-smite", name: "激愤斩", source: "PHB'24",
    level: 1, school: "死灵", castingTime: "附赠动作", range: "自身", components: "声音", duration: "1分钟",
    classes: ["圣武士"],
    description: "目标在攻击中额外受到1d6点亡灵伤害，并且必须成功通过一次智慧豁免检定，*否则直到法术*结束都会处于*恐慌*状态。在其每个回合结束时，处于*恐慌*状态的目标可以重复进行豁免检定，成功*则自动结束法术*对自己的效果。",
    higherLevel: "对于每个高于1级的法术位，伤害增加1d6。"
  },
  {
    id: "bane", name: "灾祸术", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "动作", range: "30 尺", components: "声音, 姿势, 材料 (一滴血)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","牧师","邪术师"],
    description: "在你射程内你能看到的，你选择的最多三个生物必须分别进行一次魅力豁免检定。每当一个失败此检*定的目标在法术*结束前进行攻击检定或豁免检定时，该目标必须从攻击检定或豁免检定中减去1d4。",
    higherLevel: "每超过1级的法术位，你可以额外选择一个生物作为目标。"
  },
  {
    id: "hellish-rebuke", name: "炼狱叱喝", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "反应", range: "60 尺", components: "声音, 姿势", duration: "立即",
    classes: ["邪术师"],
    description: "伤害你的生物暂时被绿色火焰包围。它进行一次敏捷豁免检定，若失败则受到2d10火焰伤害，若成功则受到一半的伤害。",
    higherLevel: "每比1级法术位高一级，伤害增加1d10。"
  },
  {
    id: "searing-smite", name: "炽焰斩", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "附赠动作", range: "自身", components: "声音", duration: "1分钟",
    classes: ["圣武士"],
    description: "当你击中目标时，它会受到额外的1d6火焰伤害。*在法术*持续期间的每个回合开始时，目标会受到1d6火焰伤害，然后进行一次体质豁免检定。如果豁免失败，法术继续。如果豁免成功，法术结束。",
    higherLevel: "所有伤害随着每个高于1级的法术位增加1d6。"
  },
  {
    id: "burning-hands", name: "燃烧之手", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "动作", range: "自身 (15尺 锥形)", components: "声音, 姿势", duration: "立即",
    classes: ["术士","法师"],
    description: "一束薄火焰从你射出。在15英尺锥形区域内的每个生物都必须进行一次敏捷豁免检定，失败则受到3d6点火焰伤害，成功则伤害减半。在锥形区域内的易燃物体，如果没有穿戴或携带，开始焚烧。",
    higherLevel: "对于1级以上的法术位，每增加一级，伤害增加1d6。"
  },
  {
    id: "hunters-mark", name: "猎人印记", source: "PHB'24",
    level: 1, school: "预言", castingTime: "附赠动作", range: "90 尺", components: "声音", duration: "专注，至多1小时",
    classes: ["游侠"],
    description: "你用魔法标记一个在射程内你能看到的一个生物作为你的猎物。*直到法术*结束，每当你用攻击检定命中目标时，你对目标额外造成1d6点力量伤害。当你进行任何智慧（察觉或生存)检定时，你还拥有优势来寻找它。*如果在法术*结束前目标降至0生命值，你可以使用一个附赠动作将标记移动到射程内你能看到的新生物上。",
    higherLevel: "使用3-4级的法术位，你的专注可以持续更长时间（最长8小时），或者使用5级或更高的法术位（最长24小时）。"
  },
  {
    id: "cure-wounds", name: "疗伤术", source: "PHB'24",
    level: 1, school: "防护", castingTime: "动作", range: "触及", components: "声音, 姿势", duration: "立即",
    classes: ["吟游诗人","圣武士","奇械师","德鲁伊","游侠","牧师"],
    description: "你接触的生物恢复的生命值等于2d8*加上你的法术*施放能力调整值。",
    higherLevel: "治疗量随着法术位等级的提高而增加，每高于1级的法术位增加2d8。"
  },
  {
    id: "sleep", name: "睡眠术", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (一小撮沙子或玫瑰花瓣)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","术士","法师"],
    description: "在你施法范围内一点为中心的5英尺半径球体内的每个你选择的生物必须成功通过一次智慧豁免检定，否则直到其下一个回合结束都会处于*失能*状态，届时它必须重复进行豁免检定。如果目标第二次豁免失败，目标将在整个持续时间内处于*昏迷*状态。如果目标受到伤害，或其周围5英尺内的某人采取*行动将其从法术*效果中摇醒，则*该目标上的法术*结束。不睡觉的生物，比如精灵，或者对*力竭*状态有免疫的生物，自动通*过对抗这个法术*的豁免。"
  },
  {
    id: "bless", name: "祝福术", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "动作", range: "30 尺", components: "声音, 姿势, 材料 (价值5+金币的圣徽)", duration: "专注，至多1分钟",
    classes: ["圣武士","牧师"],
    description: "你祝福范围内的多达三个生物。*在法术*结束前，每当目标进行攻击检定或豁免检定时，目标可以加1d4到攻击检定或豁免检定上。",
    higherLevel: "每超过1级的法术位，你可以额外选择一个生物作为目标。"
  },
  {
    id: "divine-favor", name: "神恩", source: "PHB'24",
    level: 1, school: "变化", castingTime: "附赠动作", range: "自身", components: "声音, 姿势", duration: "1分钟",
    classes: ["圣武士"],
    description: "*直到法术*结束，你在武器攻击命中时额外造成1d4点辐射伤害。"
  },
  {
    id: "goodberry", name: "神莓术", source: "PHB'24",
    level: 1, school: "咒法", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (一枝槲寄生)", duration: "24小时",
    classes: ["德鲁伊","游侠"],
    description: "十个浆果出现在你的手中，并在持续时间内被注入魔法。一个生物可以使用附赠动作吃下一个浆果。吃下一个浆果可以恢复1生命值，并且这个浆果提供足够的营养来维持一个生物一天的需要。未被吃*掉的浆果在法术*结束时消失。"
  },
  {
    id: "chromatic-orb", name: "繁彩球", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "动作", range: "90 尺", components: "声音, 姿势, 材料 (一颗价值50+金币的钻石)", duration: "立即",
    classes: ["术士","法师"],
    description: "你对范围内的目标投掷一个能量球体。选择酸液、寒冷、火焰、闪电、毒素或雷鸣作为你创造的球体类型，然后对该目*标进行远程法术*攻击。击中时，目标受到3d8点所选类型的损害。如果你在两个或更多的d8骰子上掷出了相同的数字，球体会跃迁至你选择的30英尺范围内的不同目标。对新目标进行攻击检定，并进行新的伤害检定。除非你使用2级或*更高级别的法术**位施放该法术*，否则球体不会再次跃迁。",
    higherLevel: "随着每个高于1级的法术位，伤害增加1d8。球体能跳跃的最大次数等于消耗的法术位等级，并且每个施法中，一个生物只能被这个法术的目标一次。"
  },
  {
    id: "entangle", name: "纠缠术", source: "PHB'24",
    level: 1, school: "咒法", castingTime: "动作", range: "90 尺", components: "声音, 姿势", duration: "专注，至多1分钟",
    classes: ["德鲁伊","游侠"],
    description: "在你可见范围内的20英尺正方形地面上，长出缠绕的植物。*在法术*持续期间，这些植物将该区域的地面变为困难地形。法术结束时，它们会消失。当*你施放这个法术*时，区域内的每个生物（除了你以外）都必须在力量豁免上成功，否则将一直受到*束缚*状态，*直到法术*结束。一个束缚的生物可以采取行*动对抗你的法术*难度值进行一次力量（运动）检定。如果成功，它能从缠绕植物中挣脱出来，不再受它们*束缚*。"
  },
  {
    id: "feather-fall", name: "羽落术", source: "PHB'24",
    level: 1, school: "变化", castingTime: "反应", range: "60 尺", components: "声音, 材料 (一根小羽毛或绒毛)", duration: "1分钟",
    classes: ["吟游诗人","奇械师","术士","法师"],
    description: "在范围内选择最多五个下落的生物。下落生物的下降速度减慢至每轮60英尺，*直到法术*结束。*如果生物在法术*结束前着陆，该生物不会因坠落而受到伤害，且*对该生物的法术*效果结束。"
  },
  {
    id: "hex", name: "脆弱诅咒", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "附赠动作", range: "90 尺", components: "声音, 姿势, 材料 (一只风干的蝾螈眼)", duration: "专注，至多1小时",
    classes: ["邪术师"],
    description: "你对射程内你能看到的一个生物施加诅咒。*直到法术*结束，每当你用攻击检定击中目标时，你会额外对其造成1d6点坏死伤害。同时，*施放法术*时选择一项能力。目标在使用所选能力进行属性检定时有劣势。如果*目标在这个法术*结束前降至0生命值，你可以在之后的回合中使用附赠动作诅咒一个新的生物。",
    higherLevel: "使用2级（最多4小时）、3-4级（最多8小时）或5级及以上（24小时）的法术位，你的专注可以持续更长时间。"
  },
  {
    id: "expeditious-retreat", name: "脚底抹油", source: "PHB'24",
    level: 1, school: "变化", castingTime: "附赠动作", range: "自身", components: "声音, 姿势", duration: "专注，至多10分钟",
    classes: ["奇械师","术士","法师","邪术师"],
    description: "你采取疾走动作，*直到法术*结束，你可以再次作为附赠动作采取该动作。"
  },
  {
    id: "divine-smite", name: "至圣斩", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "附赠动作", range: "自身", components: "声音", duration: "立即",
    classes: ["圣武士"],
    description: "目标因攻击而受到额外的2d8辉光伤害。如果目标是恶魔或亡灵，伤害增加1d8。",
    higherLevel: "伤害随着高于1级的法术位每级增加1d8。"
  },
  {
    id: "inflict-wounds", name: "致伤术", source: "PHB'24",
    level: 1, school: "死灵", castingTime: "动作", range: "触及", components: "声音, 姿势", duration: "立即",
    classes: ["牧师"],
    description: "你触碰的生物需要进行一次体质豁免，豁免失败将受到 2d10 点黯蚀伤害，豁免成功则伤害减半。",
    higherLevel: "每比1级法术位高一级，伤害增加1d10。"
  },
  {
    id: "ray-of-sickness", name: "致病射线", source: "PHB'24",
    level: 1, school: "死灵", castingTime: "动作", range: "60 尺", components: "声音, 姿势", duration: "立即",
    classes: ["术士","法师"],
    description: "你对射程内的生物射出一道绿光。对该目*标进行远程法术*攻击。击中时，目标受到2d8毒素伤害，并在下一个回合结束前处于*中毒*状态。",
    higherLevel: "伤害随着高于1级的法术位每级增加1d8。"
  },
  {
    id: "armor-of-agathys", name: "艾嘉西斯之铠", source: "PHB'24",
    level: 1, school: "防护", castingTime: "附赠动作", range: "自身", components: "声音, 姿势, 材料 (一块蓝色玻璃碎片)", duration: "1小时",
    classes: ["邪术师"],
    description: "保护性的魔法冰霜围绕着你。你获得了5点临时生命值。*如果在法术*结束前有生物通过近战攻击检定命中你，那个生物会受到5点寒冷伤害。如果你没有临时生命值，法术会提前结束。",
    higherLevel: "随着每个高于1级的法术位，临时生命值和寒冷伤害都增加5点。"
  },
  {
    id: "heroism", name: "英雄气概", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "动作", range: "触及", components: "声音, 姿势", duration: "专注，至多1分钟",
    classes: ["吟游诗人","圣武士"],
    description: "你触摸的愿意的生物被注入了勇气。*直到法术*结束，该生物对*恐慌*状态免疫，并在其每个回合开始时*获得等于你法术*施放能力调整值的临时生命值。",
    higherLevel: "每超过1级的法术位，你可以额外选择一个生物作为目标。"
  },
  {
    id: "shield-of-faith", name: "虔诚护盾", source: "PHB'24",
    level: 1, school: "防护", castingTime: "附赠动作", range: "60 尺", components: "声音, 姿势, 材料 (一张祈祷卷轴)", duration: "专注，至多10分钟",
    classes: ["圣武士","牧师"],
    description: "一个闪烁的领域环绕着你射程内你选择的一个生物，在其持续时间内为其AC提供+2的加值。"
  },
  {
    id: "false-life", name: "虚假生命", source: "PHB'24",
    level: 1, school: "死灵", castingTime: "动作", range: "自身", components: "声音, 姿势, 材料 (一滴酒精)", duration: "立即",
    classes: ["奇械师","术士","法师"],
    description: "你获得2d4 + 4点临时生命值。",
    higherLevel: "对于每个高于1级的法术位，你获得5点额外的临时生命值。"
  },
  {
    id: "alarm", name: "警报术", source: "PHB'24",
    level: 1, school: "防护 (ritual)", castingTime: "1分钟", range: "30 尺", components: "声音, 姿势, 材料 (一个小铃铛和一小段银线)", duration: "8小时",
    classes: ["奇械师","法师","游侠"],
    description: "你设置一个针对不速之客的警报。在施法距离内指定一扇门窗或选择一个边长不大于20 尺的立方区域。*在法术*持续时间内，任何触*碰或进入被法术*保护区域的生物都会触发警报。施法时，你可以决定哪些生物不会触发警报，还可以选择警报方式为声音警报或是精神警报。声音警报. 警报将在其保护区域 60 尺范围内将响起持续 10 秒摇铃声。精神警报. 如果你距离目标区域不超过 1 里，警报会在你脑海中会传来\"乒\"的警报声。如果你在睡觉，则警报将使你惊醒。"
  },
  {
    id: "ensnaring-strike", name: "诱捕打击", source: "PHB'24",
    level: 1, school: "咒法", castingTime: "附赠动作", range: "自身", components: "声音", duration: "专注，至多1分钟",
    classes: ["游侠"],
    description: "当你击中目标时，缠绕的藤蔓出现在它身上，它必须进行一次力量豁免。大型或更大的生物在这次豁免上具有优势。如果豁免失败，目标将处于*束缚*状态，*直到法术*结束。如果豁免成功，藤蔓枯萎，法术结束。在受到束缚期间，目标在它的每个回合开始时受到1d6点穿刺伤害。目标或其附近的一个生物可以采取行动进行一次力量（运动）**检*定对抗你的法术*豁免**。*成功则法术*结束。",
    higherLevel: "对于每个高于1级的法术位，伤害增加1d6。"
  },
  {
    id: "tensers-floating-disk", name: "谭森浮碟术", source: "PHB'24",
    level: 1, school: "咒法 (ritual)", castingTime: "动作", range: "30 尺", components: "声音, 姿势, 材料 (一滴水银)", duration: "1小时",
    classes: ["法师"],
    description: "*这个法术*在你可以选择的范围内的未被占据空间中创建一个直径3英尺、厚度1英寸的水平圆形力场平面，它悬浮在地面上方3英尺处。这个圆盘持续存在，并且可以承载最多500磅的重量。如果放置的重量超过这个限制，法术就会结束，圆盘上的所有东西都会掉到地上。浮碟在你 20 尺内时静止不动。只要你与其距离超过20尺，浮碟就会跟随你移动，并保持在你的 20 尺范围内。浮碟可以自由通过崎岖地形，上落的阶梯，斜坡面或者诸如此类的地面，但它不能越过高差超过 10 尺的地面。例如，浮碟不能越过一个 10 尺深的坑；如果浮碟造在坑里，则它也无法离开这个深坑。如果你和浮碟间的距离超过 100 尺（通常是因为它受障碍所阻无法跟上你），*则法术*随即终止。"
  },
  {
    id: "jump", name: "跳跃术", source: "PHB'24",
    level: 1, school: "变化", castingTime: "附赠动作", range: "触及", components: "声音, 姿势, 材料 (一只蚱蜢的后腿)", duration: "1分钟",
    classes: ["奇械师","德鲁伊","术士","法师","游侠"],
    description: "你触摸一个愿意的生物。*在法术*持续期间的每个回合中，该生物可以通过花费10英尺的移动距离跳至多30英尺。",
    higherLevel: "每超过1级的法术位，你可以额外选择一个生物作为目标。"
  },
  {
    id: "illusory-script", name: "迷幻手稿", source: "PHB'24",
    level: 1, school: "幻术 (ritual)", castingTime: "1分钟", range: "触及", components: "姿势, 材料 (价值10+金币的墨水，施法时会消耗掉)", duration: "10 days",
    classes: ["吟游诗人","法师","邪术师"],
    description: "你在羊皮纸、纸张或其他合适的材料上书写，并赋予它持续时间的幻觉。对你和你施法时指定的任何生物来说，书写看起来是正常的，似乎是用你的手写的，并且传达了你书写文本时的意图。对所有其他人来说，书写看起来像是用未知或魔法文字写的，无法理解。或者，幻觉可以改变文本的含义、笔迹和语言，尽管语言必须是你知道的一种。*如果法术*被解除，原始的符文和幻象都会消失。拥有真实视觉的生物可以阅读隐藏的信息。"
  },
  {
    id: "comprehend-languages", name: "通晓语言", source: "PHB'24",
    level: 1, school: "预言 (ritual)", castingTime: "动作", range: "自身", components: "声音, 姿势, 材料 (一撮煤灰和盐)", duration: "1小时",
    classes: ["吟游诗人","术士","法师","邪术师"],
    description: "在持续时间内，你能理解你听到或看到的任何语言的字面意义。你也能懂任何你看到的书面语言，但你必须触摸到写有文字的表面。阅读一页文本大约需要1分钟。*这个法术*不解码符号或秘密信息。"
  },
  {
    id: "create-or-destroy-water", name: "造水术／枯水术", source: "PHB'24",
    level: 1, school: "变化", castingTime: "动作", range: "30 尺", components: "声音, 姿势, 材料 (水和沙子的混合物)", duration: "立即",
    classes: ["德鲁伊","牧师"],
    description: "你执行以下操作之一：造水. 你在射程内的一个开口容器中创造出多达10加仑的清水。或者，水以雨的形式在射程内的30英尺立方体内落下，扑灭那里的暴露火焰。枯水. 你使施法距离内一个打开的容器里的 10 加仑水分枯竭不见。或者使施法距离内一片 30 尺立方区域的浓雾消失不见。",
    higherLevel: "你每使用一个高于1级的法术位，可以额外创造或毁灭10加仑的水，或者将立方体的尺寸增加5英尺。"
  },
  {
    id: "identify", name: "鉴定术", source: "PHB'24",
    level: 1, school: "预言 (ritual)", castingTime: "1分钟", range: "触及", components: "声音, 姿势, 材料 (一颗价值100+金币的珍珠)", duration: "立即",
    classes: ["吟游诗人","奇械师","法师"],
    description: "你在施法过程中触摸一个物体。如果该物体是一件魔法物品或其他魔法物品，你将了解其属性以及如何使用它们，无论它是否需要同调，以及它有多少充能，如果有的话。你将了解是否有*任何持续的法术*影响该物品以及它们是什么。如果*该物品是由法术*创造的，你*将了解那个法术*的名称。如果你在施法过程中触摸一个生物，你会得知目前*有哪些持续法术*（如果有的话）正在影响它。"
  },
  {
    id: "protection-from-evil-and-good", name: "防护善恶", source: "PHB'24",
    level: 1, school: "防护", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (一瓶价值25+GP的圣水，法术会消耗它)", duration: "专注，至多10分钟",
    classes: ["圣武士","德鲁伊","法师","牧师","邪术师"],
    description: "*直到法术*结束，你触摸的一个自愿生物将受到保护，免受异怪、天界生物、元素生物、精类、魔族或不死生物的影响。此保护提供多种好处。这些类型的生物在攻击目标时具有劣势。目标也不会被它们附身，或获得魅惑或*恐慌*状态。如果目标已被此类生物附身、魅惑或*恐慌*，则目标在对抗相关效果的任何新豁免检定上具有优势。"
  },
  {
    id: "unseen-servant", name: "隐形仆役", source: "PHB'24",
    level: 1, school: "咒法 (ritual)", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (一根线和一块木头)", duration: "1小时",
    classes: ["吟游诗人","法师","邪术师"],
    description: "*这个法术*创造一个*隐形*、无意识、无形状的中型力量，它会按照你的命令执行简单任务，*直到法术*结束。仆从出现在你范围内地面上一个未被占据的空间。它拥有AC 10、1生命值和2点力量，并且它不能攻击。如果它的生命值降至0生命值，法术结束。在你的每个回合中，你可以作为一次附赠动作，通过心灵命令仆人移动最多15英尺并与物体互动。仆人可以执行人类能做的简单任务，比如取东西、清洁、修补、叠衣服、生火、上菜和倒饮料。一旦你下达命令，仆人将尽其所能完成任务，然后等待你的下一个命令。如果你命令仆从做一件需要它离开你身边 60 尺的工作，*则法术*随之终止。"
  },
  {
    id: "thunderous-smite", name: "雷鸣斩", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "附赠动作", range: "自身", components: "声音", duration: "立即",
    classes: ["圣武士"],
    description: "你的攻击伴随着在你周围300英尺内可听到的雷鸣声，目标因这次攻击额外受到2d6 雷鸣伤害。此外，如果目标是一个生物，它必须进行一次力量豁免检定，否则会被推向远离你10英尺并处于*倒地*状态。",
    higherLevel: "对于高于1级的每个法术位，伤害增加1d6。"
  },
  {
    id: "thunderwave", name: "雷鸣波", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "动作", range: "自身 (15尺 立方体)", components: "声音, 姿势", duration: "立即",
    classes: ["吟游诗人","德鲁伊","术士","法师"],
    description: "你释放出一股雷鸣般的能量波。在你周围15英尺立方体内的每个生物都必须进行一次体质豁免检定。如果豁免失败，生物会受到2d8点雷鸣伤害，并被推向离你10英尺远的地方。如果豁免成功，生物受到的伤害减半。此外，完全在立方体内的未固定物体会被推向远离你10英尺的地方，并且在300英尺内可以听到雷鸣般的巨响。",
    higherLevel: "伤害随着高于1级的法术位每级增加1d8。"
  },
  {
    id: "charm-person", name: "魅惑人类", source: "PHB'24",
    level: 1, school: "惑控", castingTime: "动作", range: "30 尺", components: "声音, 姿势", duration: "1小时",
    classes: ["吟游诗人","德鲁伊","术士","法师","邪术师"],
    description: "你能看到的范围内的一个类人生物进行一次智慧豁免检定。如果你或你的盟友正在与其战斗，则它具有优势。如果豁免失败，目标会带有*魅惑*状态，*直到法术*结束或直到你或你的盟友对其造成伤害。带有*魅惑*状态的生物对你是友好的。*当法术*结束时，目标会知道它被你魅惑了。",
    higherLevel: "每超过1级的法术位，你可以额外选择一个生物作为目标。"
  },
  {
    id: "magic-missile", name: "魔法飞弹", source: "PHB'24",
    level: 1, school: "塑能", castingTime: "动作", range: "120 尺", components: "声音, 姿势", duration: "立即",
    classes: ["术士","法师"],
    description: "你创造出三发光的魔法力量飞镖。每根飞镖击中你施法范围内能看到的一个你选择的生物。一根飞镖对其目标造成1d4 + 1点力场伤害。所有飞镖同时击中，你可以指挥它们击中一个生物或者多个生物。",
    higherLevel: "该法术每超过1级的法术位，就会额外创造一个飞镖。"
  }
];
