import { SpellItem } from './types';

export const SPELL_DB_LEVEL_2: SpellItem[] = [
  // ==========================================
  // 2环法术
  // ==========================================
  {
    id: "continual-flame", name: "不灭明焰", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (价值50+金币的红宝石粉尘，该法术会消耗掉)", duration: "直到被解除",
    classes: ["奇械师","德鲁伊","法师","牧师"],
    description: "你触摸的物体上冒出火焰。这个效果在20英尺半径内产生明亮光照，并在额外的20英尺范围内产生微光光照。它看起来像普通的火焰，但不产生热量，也不消耗燃料。火焰可以被覆盖或隐藏，但不会被闷熄或扑灭。"
  },
  {
    id: "gen-v8r1r7", name: "人类定身术", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (一根直的铁条)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","德鲁伊","术士","法师","牧师","邪术师"],
    description: "选择一个你能看到的范围内的类人生物。目标必须成功通过一次智力豁免检定，*否则在法术*持续期间获得*麻痹*状态。在它的每个回合结束时，目标重复进行豁免检定，成功*则自身结束法术*效果。",
    higherLevel: "每比2级法术位高一级，你可以额外选择一个人类生物作为目标。"
  },
  {
    id: "detect-thoughts", name: "侦测思想", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作", range: "自身", components: "声音, 姿势, 材料 (1铜币)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","术士","法师"],
    description: "你激活以下效果之一。*直到法术*结束，你可以在后续回合的魔法动作中激活任一效果。 感知思想. 你感知到30英尺范围内存在知道语言或具有心灵感应能力的生物的思维。你无法读取这些思维，但你知道有一个思考的生物存在。法术被1英尺厚的石头、泥土或木头；1英寸厚的金属；或薄铅板所阻挡。 读心. 选择一个你能看到的30英尺内的生物，或者通过\"感知思维\"选项检测到的30英尺内的生物。你了解到目标现在最关注的事情。如果目标不懂任何语言且不是心灵感应的，你将一无所获。作为你下一个回合的魔法行动，你可以试图更深入地探测目标的思维。如果你进行更深层次的探测，目标需进行一次智慧豁免检定。如果豁免失败，你能辨识出目标的推理、情感和其心中挥之不去的某个事物（如担忧、爱恋或憎恨）。如果豁免成功，法术结束。无论如何，目标都知道你在探测其思维，并且只要你没有将注意力从目标的思维上移开，目标就可以在其回合使用一个动作来进行一次智力（奥秘）检定，*对抗你的法术*豁免难度等级，在成*功时终止该法术*。"
  },
  {
    id: "locate-animals-or-plants", name: "动植物定位术", source: "PHB'24",
    level: 2, school: "预言 (ritual)", castingTime: "动作", range: "自身", components: "声音, 姿势, 材料 (血猎犬的毛发)", duration: "立即",
    classes: ["吟游诗人","德鲁伊","游侠"],
    description: "描述或命名一种特定的野兽、植物生物或非魔法植物。如果你周围5英里内存在此类生物或植物，你可以得知距离最近的一个的方向和距离。"
  },
  {
    id: "animal-messenger", name: "动物信使", source: "PHB'24",
    level: 2, school: "惑控 (ritual)", castingTime: "动作", range: "30 尺", components: "声音, 姿势, 材料 (少量食物)", duration: "24小时",
    classes: ["吟游诗人","德鲁伊","游侠"],
    description: "指定一只在施法距离内你能看见的小型野兽。该生物必须成功通过一次魅力豁免，否则它会为你传递一则消息（如果该生物的挑战等级不是0，则豁免自动成功）。你选择一个你曾造访过的地点，然后描述收信人的基本信息，如\"一个穿着城镇守卫制服的男人或女人\"或\"一个戴着尖顶帽子的红发矮人\"。你还需要说出一段不超过二十五个字的信息。目标*野兽将会在法术*持续时间内前往你选定的地点。会飞的信使 24 小时内可移动 50 里，不会飞的信使只能移动 25 里。野兽抵达目的地后，会模仿你的声音把信息传递给你描述的人。信使只会把信息传递给符合你描述的人。*如果法术*持续时间内信使未能抵达目的地则信息将遗失，而曾作为信使的野兽将自行寻路返回你施法的地点。",
    higherLevel: "你使用的法术位每比2环高一环，其法术持续时间就增加 48 小时。"
  },
  {
    id: "cloud-of-daggers", name: "匕首之云", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (一小片玻璃)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","术士","法师","邪术师"],
    description: "你在射程内的一点为中心召唤出一个5英尺的立方体中旋转的匕首。该区域内的每个生物都会受到4d4斩击伤害。如果生物进入立方体或在其内结束回合，或者立方体移动到它的空间内，也会受到这种伤害。一个生物每回合只受到一次这种伤害。在你的后续回合中，你可以采取一个魔法动作将立方体传送至多30英尺。",
    higherLevel: "随着每个高于2级的法术位，伤害增加2d4。"
  },
  {
    id: "augury", name: "卜筮术", source: "PHB'24",
    level: 2, school: "预言 (ritual)", castingTime: "1分钟", range: "自身", components: "声音, 姿势, 材料 (特别标记的棍棒、骨头、卡片或其他占卜用的符记，价值25+金币。)", duration: "立即",
    classes: ["德鲁伊","法师","牧师"],
    description: "你从一个超自然实体那里得到了一个关于你计划在未来30分钟内采取的行动结果的预兆。DM从预兆表中选择这个预兆。征兆预兆对于结果将会是...福祉善良悲哀BAD福祸相依好的和坏的漠不关心既*不好也不坏法术*没有考虑到可能改变结果的情况，*例如其他法术*。如果你在完成一次长休之前*多次施放该法术*，每次施放后，有累积的25%几率无法获得答案。"
  },
  {
    id: "gen-hsim3u", name: "变巨/缩小术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "30 尺", components: "声音, 姿势, 材料 (一撮铁粉)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","奇械师","德鲁伊","术士","法师"],
    description: "在持续时间内，法术可以增大或缩小你可以看到范围内的生物或物体（见下文选择的效果）。目标物体不能被穿戴或携带。如果目标是一个不情愿的生物，它可以进行一次体质豁免。如果豁免成功，法术没有效果。目标生物穿戴和携带的所有物品都会随着它的体型变化而变化。它掉落的任何物品会立即恢复到正常大小。投掷的武器或弹药在击中或错过目标后立即恢复到正常大小。 变巨. 目标的体型增加一个类别——例如从中等变为大型。目标在力量检定和力量豁免检定上具有优势。目标使用增大后的武器或徒手攻击在命中时额外造成1d4点伤害。 缩小. 目标的体型减小一个类别——例如从中等变为小型。目标在力量检定和力量豁免检定上具有劣势。目标使用缩小后的武器或徒手攻击在命中时造成的伤害减少1d4（这不能将伤害减少到1以下）。"
  },
  {
    id: "alter-self", name: "变身术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "自身", components: "声音, 姿势", duration: "专注，至多1小时",
    classes: ["奇械师","术士","法师"],
    description: "你变换了自身形态。施法时，从以下选项中选择其一生效，其效应维持至其持续时间结束。在持续时间内，你还可以以一个魔法动作将效应切换为另一个不同的选项。 水生适应. 你长出鳃和蹼。你可以在水下呼吸，并且获得的游泳速度等同于你的步行速度。 改变外貌. 你改变了自己的外貌。你可以自行设定自己的外观：包括身高、体重、面部细节、声线、头发长短、肤色以及（可能具有的）独特外貌特征。你可以让自己的外观形似其他种族的一员而你的任何数据都不会变化。你无法变为一个体型不同的生物，并且你的基础身体轮廓不会变化。例如，如果你两足行动，就不能变为四足生物。你可以在持续时间内以一个魔法动作改变这些外貌细节。 天生武器. 你长出爪子（挥砍）、獠牙（穿刺）、犄角（穿刺）或蹄（钝击）。当你使用徒手打击以这些新长的器官造成伤害时，它会造成1d6对应类型伤害，而非你通常的徒手打击伤害，并且你使用你的施法关键属性调整值而非力量调整值来作为攻击和伤害的调整值"
  },
  {
    id: "gen-bc1csu", name: "圣光打击", source: "PHB'24",
    level: 2, school: "变化", castingTime: "附赠动作", range: "自身", components: "声音", duration: "专注，至多1分钟",
    classes: ["圣武士"],
    description: "被攻击击中的目标会额外受到2d6辐射伤害。*直到法术*结束，目标在5英尺半径内发出明亮光照，对它的攻击检定具有优势，并且它不能从*隐形*状态中获益。",
    higherLevel: "每高于2级的法术位，伤害增加1d6。"
  },
  {
    id: "gen-bpjr1m", name: "奥术活力", source: "PHB'24",
    level: 2, school: "防护", castingTime: "附赠动作", range: "自身", components: "声音, 姿势", duration: "立即",
    classes: ["术士","法师"],
    description: "你利用自己的生命力来治愈自己。掷出一到两个未消耗的 生命值骰，并恢复与掷骰总数加上你的施法能力调整值相等的 生命值。之后这些骰子将被消耗掉。",
    higherLevel: "随着每个高于2级的法术位，你可以使用的未消耗的伤害骰数量增加一个。"
  },
  {
    id: "warding-bond", name: "守护之链", source: "PHB'24",
    level: 2, school: "防护", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (一对价值50+金币的铂金戒指，你和目标必须在法术持续期间佩戴)", duration: "1小时",
    classes: ["圣武士","牧师"],
    description: "你触摸另一个愿意的目标，并在你和目标之间创建一个神秘的连接，*直到法术*结束。当目标在你60英尺范围内时，它在AC和豁免检定上获得+1加值，并且对所有伤害具有提升抗性。此外，每次它受到伤害时，你也会遭受相同数量的伤害。如果你降至0点生命值，或者你和目标之间距离超过60英尺，法术就会结束。如果再次对连接的任一*生物施放该法术*，它也会结束。"
  },
  {
    id: "calm-emotions", name: "安定心神", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "60 尺", components: "声音, 姿势", duration: "专注，至多1分钟",
    classes: ["吟游诗人","牧师"],
    description: "在你选择的射程内的点为中心的20英尺半径球体内的每个类人生物都必须成功进行一次魅力豁免检定，否则会受到以下效果之一的影响（为每个生物选择）：*该生物直到法术*结束前对魅惑和*恐慌*状态具有免疫。如果该生物已经处于魅惑或*恐慌*状态，这些状态将在持续时间内被压制。该生物对它所敌视的、你选择的生物变得漠不关心。如果目标受到伤害或目睹其盟友受到伤害，这种漠不关心的状态就会结束。*当法术*结束时，生物的态度恢复正常。"
  },
  {
    id: "find-traps", name: "寻找陷阱", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作", range: "120 尺", components: "声音, 姿势", duration: "立即",
    classes: ["德鲁伊","游侠","牧师"],
    description: "你在视线范围内感知到范围内的任何陷阱。*对于这个法术*来说，陷阱包括任何被制造出来造成损害或其他危险的物体或机制。因此，*这个法术*可*以感知到警报术**或守卫刻文法术*或机械陷阱，但它不会揭示地板的自然弱点、不稳定的天花板或隐藏的陷坑。*这个法术*揭示了一个陷阱的存在，但不是它的位置。你可以了解到你感知到的陷阱所构成的危险的大致性质。"
  },
  {
    id: "find-steed", name: "寻获坐骑", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "动作", range: "30 尺", components: "声音, 姿势", duration: "立即",
    classes: ["圣武士"],
    description: "你召唤了一个异世界的生物，它在你选择的射程内的未被占据的空间中出现，表现为一匹忠诚的坐骑。这个生物使用超凡坐骑的统计数据块。如果你已*经通过这个法术*拥有了一个坐骑，那么坐骑将被新的坐骑替换。这个坐骑看起来像是一个大型的、可供骑行的动物，由你选择，比如马、骆驼、可怕的狼或麋鹿。每当*你施放这个法术*时，选择坐骑的生物类型——天界、精类或恶魔——这决定了统计数据块中的某些特征。 战斗. 该坐骑是你和你的盟友的伙伴。在战斗中，它共享你的先攻值，并且在骑乘时作为受控坐骑（如在骑乘战斗规则中定义的那样）。如果你处于*失能*状态，坐骑会在你的回合结束后立即行动并独立行动，专注于保护你。 坐骑消失. 如果坐骑降至0生命值或如果你死亡，它会消失。当它消失时，它会留下它所穿戴或携带的任何东西。如果你再*次施放这个法术*，你决定是召唤消失的坐骑还是另一个不同的坐骑。",
    higherLevel: "在统计数据块中使用法术位的等级作为法术的等级。"
  },
  {
    id: "enhance-ability", name: "强化属性", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (毛皮或羽毛)", duration: "专注，至多1小时",
    classes: ["吟游诗人","奇械师","德鲁伊","术士","法师","游侠","牧师"],
    description: "你触摸一个生物并选择力量、敏捷、智力、智慧或魅力。在持续时间内，目标在使用所选能力的属性检定时具有优势。",
    higherLevel: "对于每个高于2级的法术位，你可以额外选择一个目标生物。你可以选择为每个目标选择不同的能力。"
  },
  {
    id: "mind-spike", name: "心灵尖刺", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作", range: "120 尺", components: "姿势", duration: "专注，至多1小时",
    classes: ["术士","法师","邪术师"],
    description: "你将一股心灵能量的尖刺打入你能看到的范围内的一个生物的心智中。目标进行一次智慧豁免，如果豁免失败，则受到3d8点心灵伤害，如果豁免成功，则受到一半的伤害。如果豁免失败，*你还将在法术*持续时间内始终知道目标的位置，但仅限于你们俩在同一存在层面上时。在你拥有这种知识时，目标无法对你隐藏，如果它处于*隐形*状态，对你来说它不会从这个状态中获得任何好处。",
    higherLevel: "每超过2级的法术位，伤害增加1d8。"
  },
  {
    id: "aid", name: "援助术", source: "PHB'24",
    level: 2, school: "防护", castingTime: "动作", range: "30 尺", components: "声音, 姿势, 材料 (一小片白布)", duration: "8小时",
    classes: ["吟游诗人","圣武士","奇械师","德鲁伊","游侠","牧师"],
    description: "*选择法术*距离内至多三个生物。每个目标的生命值上限和当*前生命值在法术*持续时间内提高 5 点。",
    higherLevel: "你使用的法术位每比二环高一环，每个目标的生命值上限和当前生命值就额外提高 5 点。"
  },
  {
    id: "knock", name: "敲击术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "60 尺", components: "声音", duration: "立即",
    classes: ["吟游诗人","术士","法师"],
    description: "选择一个在你施法范围内你能看到的物体。这个物体可以是一扇门、一个盒子、一个箱子、一副手铐、一个挂锁，或另一个包含普通或魔法手段以阻止进入的物体。被一把普通锁锁住的目标其锁会被解开，被卡死的目标会被松开，被闩住的目标会被打开。如果目标被多把锁锁住，则只有一把锁会被打开。如果目*标被秘法锁法术*关闭，*该法术*将在10分钟内被抑制，在此期间目标可以被打开和关闭。当*你施放这个法术*时，一个响亮的敲门声会从目标处发出，声音可以传到300英尺远的地方。"
  },
  {
    id: "suggestion", name: "暗示术", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "30 尺", components: "声音, 材料 (一滴蜂蜜)", duration: "专注，至多8小时",
    classes: ["吟游诗人","术士","法师","邪术师"],
    description: "你对范围内能够听到并理解你的语言的一个生物提出一个行动建议——不超过25个字的描述。这个建议必须听起来是可行的，并且不涉及明显会对目标或其盟友造成伤害的事情。例如，你可以说：\"去拿邪教宝库的钥匙，然后把钥匙给我。\"或者你可以说：\"停止战斗，和平地离开这个图书馆，不要再回来。\"目标必须成功通过一次智慧豁免检定，否则在整个持续时间内或直到你或你的盟友对目标造成伤害之前，都会处于*魅惑*状态。处于*魅惑*状态的目标将尽其所能追求建议的行为。建议的活动可以持续整个持续时间，但如果建议的活动可以在更短的时间内完成，那么在目标完成后，法术对该目标结束。"
  },
  {
    id: "moonbeam", name: "月华之光", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "120 尺", components: "声音, 姿势, 材料 (一片月亮树的叶子)", duration: "专注，至多1分钟",
    classes: ["德鲁伊"],
    description: "一道银色的淡光束在一个5英尺半径、40英尺高的圆柱体内照射下来，这个圆柱体以范围内的一点为中心。*直到法术*结束，微光光照（微光）充满圆柱体，你可以在后续回合采取一个魔法（魔法）动作来将圆柱体移动最多60英尺。当圆柱体出现时，其中每生物都必须进行一次体质豁免。如果豁免失败，生物将受到2d10点辐射伤害，如果生物是变形的（例如，*由于变形术法术*的结果），它将恢复其真实形态，并且在离开圆柱体之前不能再变形。如果豁免成功，生物只受到一半的伤害。*当法术*的作用区域移动到生物的空间时，*当生物进入法术*的作用区域或在其内结束其回合时，生物也必须进行这次豁免。生物每回合只进行一次这次豁免。",
    higherLevel: "每高于2级的法术位，伤害增加1d10。"
  },
  {
    id: "blur", name: "朦胧术", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作", range: "自身", components: "声音", duration: "专注，至多1分钟",
    classes: ["奇械师","术士","法师"],
    description: "你的身体变得模糊。在持续时间内，任何生物攻击你的掷骰有 劣势。如果攻击者通过 盲视 或 真实视觉 感知到你，则该攻击者免疫此效果。"
  },
  {
    id: "barkskin", name: "树肤术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "附赠动作", range: "触及", components: "声音, 姿势, 材料 (一把橡树树皮)", duration: "1小时",
    classes: ["德鲁伊","游侠"],
    description: "你触摸一个愿意的生物。*直到法术*结束，目标的皮肤呈现出类似树皮的外观，如果目标的AC低于17，则其具有护甲等级17。"
  },
  {
    id: "gen-918hjr", name: "次级复原术", source: "PHB'24",
    level: 2, school: "防护", castingTime: "附赠动作", range: "触及", components: "声音, 姿势", duration: "立即",
    classes: ["吟游诗人","圣武士","奇械师","德鲁伊","游侠","牧师"],
    description: "你触摸一个生物并结束其身上的一个状态：*目盲*、*耳聋*、麻痹或*中毒*。"
  },
  {
    id: "silence", name: "沉默术", source: "PHB'24",
    level: 2, school: "幻术 (ritual)", castingTime: "动作", range: "120 尺", components: "声音, 姿势", duration: "专注，至多10分钟",
    classes: ["吟游诗人","游侠","牧师"],
    description: "在持续时间内，你选择的范围内的点为中心的20英尺半径球体内，无法产生或通过任何声音。完全在球体内的任何生物或物体对雷鸣伤害有免疫，生物在完全在球体内时具有*耳聋*状态。在那里施放包含*口头成分的法术*是不可能的。"
  },
  {
    id: "prayer-of-healing", name: "治疗祷言", source: "PHB'24",
    level: 2, school: "防护", castingTime: "10分钟", range: "30 尺", components: "声音", duration: "立即",
    classes: ["圣武士","牧师"],
    description: "多达五个你选择的生物，如果在整个施法过程中保持在射程内，将获得一次短休的好处，并且还会恢复2d8点生命值。一个生物在完成一次长休之前，不能再*次受到这个法术*的影响。",
    higherLevel: "治疗量随着高于2级的法术位增加，每级增加1d8。"
  },
  {
    id: "enthrall", name: "注目术", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "60 尺", components: "声音, 姿势", duration: "1分钟",
    classes: ["吟游诗人","邪术师"],
    description: "你编织出一串令人分心的言语，使得你能看见的范围内你所选择的生物进行一次智力豁免检定。任何你或你的同伴正在与之战斗的生物都会自动通过这次豁免。在豁免失败的情况下，目标在进行智力（察觉）检定时受到-10的惩罚，*并且在该法术*结束前，其被动 察觉 也会受到影响。"
  },
  {
    id: "levitate", name: "浮空术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (一个金属弹簧)", duration: "专注，至多10分钟",
    classes: ["奇械师","术士","法师"],
    description: "在你施法范围内，你可以看到的一个生物或松散物体垂直上升最多20英尺，并在持续时间内悬浮在那里。*这个法术*可以使重达500磅的物体悬浮。如果不愿意的生物成功通过一次体质豁免检定，则不受影响。目标只能通过推动或拉动其触及范围内的固定物体或表面（如墙壁或天花板）来移动，这使得它能够像攀爬一样移动。在你的回合中，你可以改变目标的高度，最多向上或向下移动20英尺。如果你是目标，你可以作为你移动的一部分向上或向下移动。否则，你可以采取一个魔法动作来移动目标，目标*必须保持在法术*的范围内。法术终止时，仍处于空中的目标会缓缓飘落到地面。"
  },
  {
    id: "nystuls-magic-aura", name: "涅斯图魔法灵光", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (一小块方形丝绸)", duration: "24小时",
    classes: ["法师"],
    description: "通过触摸，你可以在愿意的生物或没有被穿戴或携带的物品上放置幻觉。生物获得下面的Mask效果，物品获得下面的False Aura效果。效果持续到持续时间结束。如果你连续30天每天对同一个目*标施放这个法术*，幻觉将持续到被驱散。 掩蔽（生物）. 选择一个与目标实际类型不同的生物类型。法术和其他魔法效果将目标视为所选类型的生物。 虚假灵光（物体）. 你改*变了目标对法术*和检测魔法光环的魔法效果的呈现方式，例如侦测魔法。你可以使一个非魔法物品看起来像是魔法物品，使一个魔法物品看起来非魔法，或者改变物品的光环，使其看起来属于你选择的一个魔法学派。"
  },
  {
    id: "flame-blade", name: "火焰刀", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "附赠动作", range: "自身", components: "声音, 姿势, 材料 (一片漆树叶)", duration: "专注，至多10分钟",
    classes: ["德鲁伊","术士"],
    description: "你在空闲的手中召唤出一把火焰刀刃。这把刀刃的大小和形状类似于一把弯刀，并且持续*时间为整个法术*持续时间。如果你放开这把刀刃，它会消失，但你可以通过一个附赠动作再次召唤它。作为一次魔法行动，你可以用火焰*刀进行近战法术*攻击。命中时，目标受到等于3d6*加上你的法术*施放能力调整值的火焰伤害。火焰之刃在10英尺半径内发出明亮光照，并在额外的10英尺范围内发出微光光照。",
    higherLevel: "对于高于2级的法术位，伤害增加1d6。"
  },
  {
    id: "spiritual-weapon", name: "灵体武器", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "附赠动作", range: "60 尺", components: "声音, 姿势", duration: "专注，至多1分钟",
    classes: ["牧师"],
    description: "你创造了一个漂浮的幽灵力量，它看起来像你选择的武器，持续时间为持续时间。力量在你选择的范围内的空间中出现，你可以立即对力量周围5英尺内的生物进*行一次近战法术*攻击。命中时，目标受到等于1d8加上你的施法能力调整值的力量伤害。在你后续回合的附赠动作中，你可以将力量移动最多20英尺，并对距离它5英尺内的生物重复攻击。",
    higherLevel: "每高于2级的法术位，伤害增加1d8。"
  },
  {
    id: "scorching-ray", name: "灼热射线", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "120 尺", components: "声音, 姿势", duration: "立即",
    classes: ["术士","法师"],
    description: "你投掷三道炽热的射线。你可以将它们投向范围内的一个目标，或者分散投向多个目标。对每道射*线进行远程法术*攻击检定。击中时，目标受到2d6火焰伤害。",
    higherLevel: "每超过2级法术位，你额外创造一道射线。"
  },
  {
    id: "heat-metal", name: "灼热金属", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (一块铁和一团火焰)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","奇械师","德鲁伊"],
    description: "选择射程内你能看到的一个制造金属物品，如金属武器或重型或中型金属护甲。你使该物体发出红热的光。*当你施放法术*时，任何与物体有物理接触的生物都会受到2d8点火焰伤害。*直到法术*结束，你可以在随后的每个回合中使用附赠动作再次造成这种伤害，如果物体在射程内的话。如果一个生物持有或穿戴该物品并因此受到伤害，该生物必须进行一次体质豁免检定，否则会掉落该物品（如果它能这么做）。如果它没有掉落该物品，直到你的下一个回合开始，它在攻击掷骰和属性检定中处于劣势状态。",
    higherLevel: "每高于2级的法术位，伤害增加1d8。"
  },
  {
    id: "flaming-sphere", name: "炽焰法球", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (一个蜡球)", duration: "专注，至多1分钟",
    classes: ["德鲁伊","术士","法师"],
    description: "你在射程内的地面上一个未被占用的空间创造一个直径5英尺的火球。*它持续整个法术*持续时间。任何在其回合结束时在火球5英尺范围内的生物必须进行一次敏捷豁免检定，如果失败，则受到2d6火焰伤害，如果成功，则受到一半的伤害。作为一次附赠动作，你可以将球体沿地面滚动最多30英尺。如果你将球体移入一个生物的空间，那个生物将对球体进行豁免掷骰，然后球体在该回合停止移动。当你移动球体时，你可以让它越过高达5英尺的障碍物，并跳过宽达10英尺的坑洞。如果球体触碰到易燃物体，而这些物体没有被穿戴或携带，它们会开始焚烧，并且球体在20英尺范围内散发明亮光照，在额外的20英尺范围内散发微光光照。",
    higherLevel: "每高于2级的法术位，伤害增加1d6。"
  },
  {
    id: "locate-object", name: "物件定位术", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作", range: "自身", components: "声音, 姿势, 材料 (一根分叉的树枝)", duration: "专注，至多10分钟",
    classes: ["吟游诗人","圣武士","德鲁伊","法师","游侠","牧师"],
    description: "描述或命名一个你熟悉的物体。如果该物体在你1000英尺范围内，你能感知到它的位置方向。如果物体在移动，你知道它的移动方向。如果你曾经近距离（30英尺以内）至少一次见过一个特定的物品，*这个法术*可以定位到这个你知道的物品。或者，法术可以定位到最近的一种特定类型的物体，例如某种特定的服装、珠宝、家具、工具或武器。如果铅的任何厚度阻挡了你和物体之间的直接路径，*这个法术*就无法定位该物体。"
  },
  {
    id: "crown-of-madness", name: "疯狂冠冕", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "120 尺", components: "声音, 姿势", duration: "专注，至多1分钟",
    classes: ["吟游诗人","术士","法师","邪术师"],
    description: "射程内你能看到的一个生物必须进行一次智力豁免，否则在持续时间内会受到*魅惑*状态。如果不是人型生物，则自动成功。一个幽灵般的王冠出现在被魅惑的目标头上，它必须在每个回合开始前使用动作进行一次近战攻击，攻击你心灵选择的另一个生物（不是它自己）。如果你没有选择任何生物，或者没有任何生物在它的攻击范围内，目标可以在它的回合正常行动。目标在每个回合结束时重复进行豁免投掷，如果成功，则结*束自身上的法术*效果。在你的后续回合中，你必须采取魔法动作来维持对目标的控制，*否则法术*会结束。"
  },
  {
    id: "gen-15leu6l", name: "目盲术／耳聋术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "120 尺", components: "声音", duration: "1分钟",
    classes: ["吟游诗人","术士","法师","牧师"],
    description: "在你施法范围内，你能看到的一个生物必须进行一次体质豁免检定，*否则在法术*持续时间内，它将获得目盲或*耳聋*状态（你选择）。在它的每个回合结束时，目标可以重复进行豁免检定，*成功则结束法术*对自己的作用。",
    higherLevel: "每超过2级的法术位，你可以额外选择一个目标生物。"
  },
  {
    id: "arcane-lock", name: "秘法锁", source: "PHB'24",
    level: 2, school: "防护", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (价值25+金币的金粉，法术会消耗它)", duration: "直到被解除",
    classes: ["奇械师","法师"],
    description: "你触摸一扇关闭的门、窗、门、容器或舱口，*并在法术*持续期间用魔法将其锁定。这个锁不能被任何非魔法手段解开。你和施法时你指定的任何生物都可以无视这个锁打开和关闭物体。你还可以设置一个密码，当在物体5英尺范围内说出这个密码时，它会解锁1分钟。"
  },
  {
    id: "shatter", name: "粉碎音波", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (一片云母)", duration: "立即",
    classes: ["吟游诗人","术士","法师"],
    description: "在你选择的范围内的一个点爆发出巨大的噪音。中心处10英尺半径范围内的每个生物都必须进行一次体质豁免检定，失败则受到3d8雷鸣伤害，成功则受到一半的伤害。构造体在豁免检定上具有劣势。*如果法术*的范围内有一个不被任何生物着装携带的非魔法物件，则它也要受到该伤害。",
    higherLevel: "每超过2级的法术位，伤害增加1d8。"
  },
  {
    id: "spike-growth", name: "荆棘丛生", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "150 尺", components: "声音, 姿势, 材料 (七根荆棘)", duration: "专注，至多10分钟",
    classes: ["德鲁伊","游侠"],
    description: "在施法范围内一点为中心的20英尺半径球体内的地面上长出坚硬的尖刺和荆棘。该区域在持续时间内成为困难地形。当生物移动进入或在该区域内时，它每移动5英尺就会受到2d4穿刺伤害。地面的变形被伪装得看起来很自然。施法时，如果某个生物无法看见该区域，它必须采取搜索行动，*并在你的法术*豁免难度等级上通过一次智慧(察觉或生存)检定，才能在进入前识别出这片地形是危险的。"
  },
  {
    id: "web", name: "蛛网术", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (少许蜘蛛网)", duration: "专注，至多1小时",
    classes: ["奇械师","术士","法师"],
    description: "你在射程内的一点召唤出一团粘性的蛛网。这些蛛网在持续时间内填充了一个20英尺的立方体。蛛网是困难地形，并且它们所在的区域是轻度遮蔽。如果蛛网没有锚定在两个固体之间（例如墙壁或树木）或覆盖在地板、墙壁或天花板上，蛛网就会在自身上坍塌，法术将在你下一个回合开始时结束。覆盖在平坦表面上的蛛网深度为5英尺。当一个生物在回合中首次进入蛛网或在其回合开始时处于蛛网中，它必须成功通过一次敏捷豁免，否则在蛛网中或直到它挣脱之前，都会处于*束缚*状态。被蛛网束缚的生物可以采取行动，进行一次力量（运动）检*定对抗你的法术*豁免难度等级。如果成功，它将不再*束缚*。这些蛛网都是可燃物。每 5 尺立方的蛛网触及明火时将在 1 轮内被烧尽。而任何在燃烧区域内开始其回合的生物将因此受 2d4 点火焰伤害。"
  },
  {
    id: "spider-climb", name: "蛛行术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (一滴沥青和一只蜘蛛)", duration: "专注，至多1小时",
    classes: ["奇械师","术士","法师","邪术师"],
    description: "*直到法术*结束，你触碰的一个自愿生物获得在垂直表面和天花板上移动的能力，同时双手保持自由。目标还获得了等于其速度的攀爬速度。",
    higherLevel: "每高于2级的法术位，你可以额外选择一个目标。"
  },
  {
    id: "pass-without-trace", name: "行动无踪", source: "PHB'24",
    level: 2, school: "防护", castingTime: "动作", range: "自身 (30尺 emanation)", components: "声音, 姿势, 材料 (烧焦的槲寄生灰烬)", duration: "专注，至多1小时",
    classes: ["德鲁伊","游侠"],
    description: "你散发出一个30英尺的隐蔽光环，持续时间内。在光环中，你和每个你选择的生物在敏捷（隐匿）检定上有+10加值，且不会留下踪迹。"
  },
  {
    id: "ray-of-enfeeblement", name: "衰弱射线", source: "PHB'24",
    level: 2, school: "死灵", castingTime: "动作", range: "60 尺", components: "声音, 姿势", duration: "专注，至多1分钟",
    classes: ["法师","邪术师"],
    description: "一束消弱能量的射线从你射向范围内的一个生物。目标必须进行一次体质豁免。如果豁免成功，目标在你下一回合开始之前进行的下一次攻击检定中具有劣势。如果豁免失败，目标在持续时间内对基于力量的D20 检定具有劣势。在那段时间里，它还从所有的伤害掷骰中减去1d8。目标在每个回合结束时重复豁免，*成功则结束法术*。"
  },
  {
    id: "cordon-of-arrows", name: "警戒箭阵", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (四支或更多的箭或矢)", duration: "8小时",
    classes: ["游侠"],
    description: "你触摸最多四支非魔法箭矢或弩箭并将它们插在你所在位置的地面上。*在法术*持续时间内，这些弹药无法被物理拔起。每当一个生物在回合中首次进入距离弹药30英尺内的空间或在该空间结束其回合时，一支弹药会飞起并攻击该生物。该生物必须进行一次敏捷豁免检定，若失败则受到2d4穿刺伤害。该弹药随后被摧毁。当没有弹药留在地面上时，法术结束。*施展该法术*时，你可以指定任*意的生物使法术*的警戒效应将其排除在外。",
    higherLevel: "随着每个高于2级的法术位，受影响的弹药数量增加两个。"
  },
  {
    id: "see-invisibility", name: "识破隐形", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作", range: "自身", components: "声音, 姿势, 材料 (一小撮滑石粉)", duration: "1小时",
    classes: ["吟游诗人","奇械师","术士","法师"],
    description: "在持续时间内，你可以看到具有*隐形*状态的生物和物体，就像它们是可见的一样，并且你可以看到以太位面。那里的生物和物体看起来像幽灵。"
  },
  {
    id: "zone-of-truth", name: "诚实之域", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "60 尺", components: "声音, 姿势", duration: "10分钟",
    classes: ["吟游诗人","圣武士","牧师"],
    description: "你在射程内的一点为中心，创造一个15英尺半径的魔法区域，以防止欺骗行为。*直到法术*结束，任何*第一次进入法术*区域的生物或在其区域内开始回合的生物都必须进行一次魅力豁免检定。如果豁免失败，生物在半径范围内不能故意说谎。你会知道生物是否成功通过这次豁免。受影响的生物*意识到这个法术*，并且可以避免回答它通常会用谎言回应的问题。这样的生物可以避重就轻，但必须说真话。"
  },
  {
    id: "misty-step", name: "迷踪步", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "附赠动作", range: "自身", components: "声音", duration: "立即",
    classes: ["术士","法师","邪术师"],
    description: "你被银色雾气短暂包围，你传送至多30英尺到一个你能看到的未被占据的空间。"
  },
  {
    id: "gust-of-wind", name: "造风术", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "自身", components: "声音, 姿势, 材料 (一粒豆科植物的种子)", duration: "专注，至多1分钟",
    classes: ["德鲁伊","术士","法师","游侠"],
    description: "一道60英尺长、10英尺宽的强风从你选择的方向吹出，*持续时间为法术*持续时间。在线中的每个生物必须成功进行一次力量豁免检定，否则会被沿着线的方向从你那里推开15英尺。一个在其回合结束时位于线中的生物必须进行同样的豁免检定。任何生物在线状区域内向你移动时，其每移动 1 尺必须花费 2 尺的移动力。阵风会驱散气体或蒸汽，并熄灭区域内的蜡烛和类似的无保护火焰。它会使有保护的火焰，如提灯的火焰，剧烈摇曳，并有50%的概率将其熄灭。在你的后续回合中，你可以使用附赠动作来改变线形能量束从你发出的方向。"
  },
  {
    id: "gentle-repose", name: "遗体防腐", source: "PHB'24",
    level: 2, school: "死灵 (ritual)", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (2个铜币，法术会消耗掉它们)", duration: "10 days",
    classes: ["圣武士","法师","牧师"],
    description: "你触碰一具尸体或其他遗骸。*目标将在法术*持续时间内受保护并免于腐烂且无法转变为不死生物。*这个法术*还有效地延长了将目标从死亡中复活的时间限制，*因为在该法术*影响下度过的日子不会计入如*死者复活等法术*的时间限制。"
  },
  {
    id: "summon-beast", name: "野兽召唤术", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "动作", range: "90 尺", components: "声音, 姿势, 材料 (一根羽毛、一撮毛皮和一条鱼尾，放在一个价值200+金币的镀金橡子里)", duration: "专注，至多1小时",
    classes: ["德鲁伊","游侠"],
    description: "你召唤出一个野兽精神。它在你施法范围内你能看到的未被占据的空间中显现，并使用野兽灵魄的统计数据块。*当你施放法术*时，选择一个环境：空气、陆地或水。这个生物类似于你选择的一个原生于所选环境中的动物，这决定了其统计数据块中的某些细节。当生物的生命值降至0*或法术*结束时，生物就会消失。这个生物成为你和你的盟友的盟友。在战斗中，生物共享你的先攻计数，但它会在你之后立即行动。它服从你的口头命令（你无需动作）。如果你没有发出任何命令，它会采取回避动作，并使用它的移动来避开危险。",
    higherLevel: "在统计数据块中使用法术位的等级作为法术的等级。"
  },
  {
    id: "gen-iqkegj", name: "野兽知觉", source: "PHB'24",
    level: 2, school: "预言 (ritual)", castingTime: "动作", range: "触及", components: "姿势", duration: "专注，至多1小时",
    classes: ["德鲁伊","游侠"],
    description: "你触摸一个愿意的野兽。*在法术*持续期间，你可以通过野兽的感官感知，同时也能通过你自己的感官感知。当通过野兽的感官感知时，你会从它的任何特殊感官中受益。"
  },
  {
    id: "mirror-image", name: "镜影术", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作", range: "自身", components: "声音, 姿势", duration: "1分钟",
    classes: ["吟游诗人","术士","法师","邪术师"],
    description: "三个幻象副本出现在你的空间中。*直到法术*结束，这些副本会随着你移动并模仿你的行动，不断变换位置，使得无法追踪哪个影像是真实的。*在法术*持续时间内，每当一个生物通过攻击检定击中你时，为你剩余的每个分身掷一次 d6。如果有任何一个 d6 掷出 3 或更高，其中一个分身将代替你被击中，并且该分身被摧毁。除此之外，分身会忽略所有其他伤害和效果。当所有三个分身都被摧毁时，法术结束。如果生物具有*目盲*状态、盲视或真实视觉，*则不受该法术*影响。"
  },
  {
    id: "protection-from-poison", name: "防护毒素", source: "PHB'24",
    level: 2, school: "防护", castingTime: "动作", range: "触及", components: "声音, 姿势", duration: "1小时",
    classes: ["圣武士","奇械师","德鲁伊","游侠","牧师"],
    description: "你触摸一个生物并结束它身上的*中毒*状态。在持续时间内，目标对避免或结束*中毒*状态的豁免检定具有优势，并且对毒素伤害具有提升抗性。"
  },
  {
    id: "invisibility", name: "隐形术", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (一根被阿拉伯胶包裹的睫毛)", duration: "专注，至多1小时",
    classes: ["吟游诗人","奇械师","术士","法师","邪术师"],
    description: "你触*摸的生物在法术*结束前处于*隐形*状态。一旦目标进行攻击检定、造成*伤害或施放法术*，法术会立即提前结束。",
    higherLevel: "每超过2级的法术位，你可以额外选择一个目标生物。"
  },
  {
    id: "melfs-acid-arrow", name: "马友夫强酸箭", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "90 尺", components: "声音, 姿势, 材料 (大黄叶粉)", duration: "立即",
    classes: ["法师"],
    description: "一支闪烁着绿色光芒的箭矢飞向范围内的一个目标，并在接触时爆裂成酸液。对目*标进行远程法术*攻击。击中时，目标受到4d4点酸性伤害，并在其下一轮结束时受到2d4点酸性伤害。如果未击中，箭矢会溅射目标，造成初始伤害的一半。",
    higherLevel: "每超过2级的法术位，初始伤害和后续伤害都增加1d4。"
  },
  {
    id: "phantasmal-force", name: "魅影之力", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作", range: "60 尺", components: "声音, 姿势, 材料 (少许羊毛)", duration: "专注，至多1分钟",
    classes: ["吟游诗人","术士","法师"],
    description: "你试图在射程内你能看到的生物的脑海中制造一个幻觉。目标进行一次智力豁免检定。如果豁免失败，你创造了一个幻影物体、生物或其他现象，其大小不超过10英尺的立方体，且在持续时间内只能被目标感知。这个幻影包括声音、温度和其他刺激。目标可以执行一个研究动作，使用智力（调查）检*定对抗你的法术*豁免难度等级。如果检定成功，目标意识到幻象是幻觉，*并且该法术*结束。*在法术*影响下，目标将幻觉视为真实，并合理化与其互动时产生的任何不合逻辑的结果。例如，如果目标穿过一个幻影桥梁并从坠落中幸存，它会相信桥梁是存在的，并认为有其他原因导致它坠落。受影响的目标甚至可能从幻象中受到伤害，如果幻想代表了一个危险的生物或危险。在你的每个回合中，如果目标在幻想区域内或距离幻想5英尺以内，这样的幻想可以对目标造成2d8心灵伤害。目标将伤害感知为适合幻象的类型。"
  },
  {
    id: "magic-weapon", name: "魔化武器", source: "PHB'24",
    level: 2, school: "变化", castingTime: "附赠动作", range: "触及", components: "声音, 姿势", duration: "1小时",
    classes: ["圣武士","奇械师","术士","法师","游侠"],
    description: "你触摸一件非魔法武器。*直到法术*结束，该武器变成魔法武器，在攻击骰和伤害骰上获得+1的加值。如果你再*次施放这个法术*，法术会提前结束。",
    higherLevel: "使用3-5级法术位时，加值增加到+2。使用6级或更高级别的法术位时，加值增加到+3。"
  },
  {
    id: "magic-mouth", name: "魔嘴术", source: "PHB'24",
    level: 2, school: "幻术 (ritual)", castingTime: "1分钟", range: "30 尺", components: "声音, 姿势, 材料 (价值10+金币的玉尘，法术会消耗掉它)", duration: "直到被解除",
    classes: ["吟游诗人","奇械师","法师"],
    description: "你在射程内的物体中植入一条信息——当触发条件满足时，这条信息会被说出。选择一个你能看到的物体，这个物体不能被其他生物穿戴或携带。然后说出这条信息，信息必须少于或等于25个单词，尽管它可以在长达10分钟内传递。最后，*确定将触发法术*传递你信息的情况。当那个触发条件发生时，一个魔法嘴巴会出现在物体上，并以你的声音和音量复述信息。如果你选择的物体有一个嘴巴或看起来像嘴巴的东西（例如，雕像的嘴巴），魔法嘴巴会出现在那里，所以话语看起来像是从物体的嘴巴中发出的。当*你施放这个法术*时，*你可以让法术*在传递完信息后结束，或者它可以保留并在每次触发条件发生时重复其信息。触发条件可以是一般性的，也可以是你希望的那样详细，尽管它必须基于在物体周围30英尺内发生的视觉或听觉条件。例如，你可以指示嘴巴在任何生物移动到物体周围30英尺内时说话，或者当一个银铃在物体周围30英尺内响起时说话。"
  },
  {
    id: "rope-trick", name: "魔绳术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (一段绳子)", duration: "1小时",
    classes: ["奇械师","法师"],
    description: "你触摸一根绳子。它的一端向上悬停，直到绳子垂直于地面或达到天花板。在绳子的上端，一个隐形的3英尺乘5英尺的传送门打开，通向*一个持续到法术*结束的额外维度空间。可以通过攀爬绳子到达那个空间，也可以将绳子拉入或掉出该空间。这个空间可以容纳多达八名中等体型或更小的生物。攻击、法术和其他效果无法穿过这个空间，但空间内的生物可以通过传送门看到外面。法术结束时，空间内的所有物体都会掉出来。"
  },
  {
    id: "darkness", name: "黑暗术", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "60 尺", components: "声音, 材料 (蝙蝠毛和一块煤)", duration: "专注，至多10分钟",
    classes: ["术士","法师","邪术师"],
    description: "在持续时间内，*魔法黑暗术*从范围内某一点蔓延并充满15英尺半径的球体。黑暗视觉无法透视它，非魔法光源也无法照亮它。或者，*你可以将法术*施放在一个没有被穿戴或携带的物品上，使得15英尺*范围内的黑暗术*从该物品散发出来。用不透明的东西，比如碗或头盔，覆盖该物品，*可以阻挡黑暗术*。*如果这个法术*的区域与由2级或*更低级别的法术*创造的明亮光照或微光光照区域重叠，*那么另一个法术*将被解除。"
  },
  {
    id: "darkvision", name: "黑暗视觉", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "触及", components: "声音, 姿势, 材料 (一根干胡萝卜)", duration: "8小时",
    classes: ["奇械师","德鲁伊","术士","法师","游侠"],
    description: "在持续时间内，你触碰的一个愿意的生物拥有黑暗视觉，范围为150英尺。"
  },
  {
    id: "dragons-breath", name: "龙息术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "附赠动作", range: "触及", components: "声音, 姿势, 材料 (一枚辣椒)", duration: "专注，至多1分钟",
    classes: ["术士","法师"],
    description: "你触摸一个自愿的生物，并选择酸、冷、火、闪电或毒素。*直到法术*结束，目标可以采取一个魔法动作来呼气形成一个15英尺的锥形区域。在该区域内的每个生物都必须进行一次敏捷豁免，如果豁免失败，则受到3d6点所选类型的伤害，如果豁免成功，则受到一半的伤害。",
    higherLevel: "对于高于2级的法术位，伤害增加1d6。"
  }
];
