import { SpellItem } from '../types';

export const SPELL_DB_LEVEL_2: SpellItem[] = [
  // ==========================================
  // 2环法术 - PHB'24 Only
  // ==========================================

  {
    id: "gen-f1od6", name: "援助术", source: "PHB'24",
    level: 2, school: "防护", castingTime: "动作", range: "30 尺", components: "声音、姿势、材料（一小片白布）", duration: "8 小时",
    classes: ["吟游诗人", "牧师", "德鲁伊", "圣武士", "游侠"],
    description: "*选择法术*距离内至多三个生物。每个目标的生命值上限和当前生命值 *在法术*持续时间内提高5。",
    higherLevel: "*使用的法术*位每比二环高一环，每个目标的生命值 就额外提高5 。"
  },

  {
    id: "gen-cyxto", name: "变身术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "自身", components: "声音、姿势", duration: "专注，至多 1 小时",
    classes: ["术士", "法师"],
    description: "你变换了自身形态。施法时，从以下选项中选择其一生效，其效应维持至其持续时间结束。在持续时间内，你还能够以一个魔法动作将效应切换为另一个不同的选项。"
  },

  {
    id: "gen-idt44", name: "秘法锁", source: "PHB'24",
    level: 2, school: "防护", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（价值25GP+的金粉，作为法术耗材）", duration: "直到被解除",
    classes: ["法师"],
    description: "你触碰一个关着的门、窗、容器或出入口，*并使目标在法术*持续时间内被魔法上锁。秘法锁无法被任何非魔法方式解锁。*在你施展法术*时你可以选择允许一些其他生物，你和受你允许的生物能够无视秘法锁打开/关闭该物件。你还可以设置一条密语，在该物件5尺内念出密语时，秘法锁将被解锁（持续1分钟）。"
  },

  {
    id: "gen-bs3ilb", name: "复苏秘法", source: "PHB'24",
    level: 2, school: "防护", castingTime: "附赠动作", range: "自身", components: "声音、姿势", duration: "立即",
    classes: ["术士", "法师"],
    description: "你利用自己的生命力来治愈自身。投一枚或两枚你还未消耗的生命骰，然后恢复等于结果加你的施法属性调整值的总和的生命值。随后，这些*生命骰会被法术*消耗。",
    higherLevel: "*使用的法术*位每比二环高一环，你就能多投掷一枚未使用的生命骰。"
  },

  {
    id: "gen-ct42l", name: "卜筮术", source: "PHB'24",
    level: 2, school: "预言", castingTime: "1 分钟或仪式", range: "自身", components: "声音、姿势、材料（绘有标记的短棒、骨头、卡片、或类似的预言道具，价值25+GP）", duration: "立即",
    classes: ["牧师", "德鲁伊", "法师"],
    description: "你从异界存在处获得对某道有关你在接下来的30分钟内所计划执行的一系列行动之结果的预示。DM从下列预示中选取一个："
  },

  {
    id: "gen-fv6qk", name: "树肤术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "附赠动作", range: "触碰", components: "声音、姿势、材料（一把树皮）", duration: "1小时",
    classes: ["德鲁伊", "游侠"],
    description: "你触碰一个自愿生物。*直到法术*终止前，目标的皮肤呈现出树皮样的外貌，并且若目标AC低于17，则其AC变为17。"
  },

  {
    id: "gen-iqg9vs", name: "野兽感官", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作或仪式", range: "触碰", components: "姿势", duration: "专注，至多一小时",
    classes: ["德鲁伊", "游侠"],
    description: "你触碰一只自愿的野兽。在持续期间内，你可以借助该野兽的感官来感知周围事物，如同它们的感官是你的感官一般。以通过该野兽感官感知事物时，你同样会受益于它拥有的那些特殊感官。"
  },

  {
    id: "gen-21qpab1", name: "目盲术/耳聋术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "120尺", components: "声音", duration: "1分钟",
    classes: ["吟游诗人", "牧师", "术士", "法师"],
    description: "处于你施法范围内的一个你可见的生物必须进行一次体质豁免，豁*免失败者在法术*持续期间陷入目盲或*耳聋*状态（由你选择）。目标可以在其每个回合结束时重复此豁免，直至豁免成功时结束自己身上的效应。",
    higherLevel: "*使用的法术*位每比二环高一环，你就能多指定一*个生物作为法术*目标。"
  },

  {
    id: "gen-fqe32", name: "朦胧术", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作", range: "自身", components: "声音", duration: "专注，至多1分钟",
    classes: ["术士", "法师"],
    description: "你的身体变得模糊不定，难以捉摸。*在法术*持续时间内，所有生物对你发动的攻击检定具有劣势。不过若攻击者能通过盲视或真实视觉观测你，则*其免疫于此法术*的效应。"
  },

  {
    id: "gen-bxiigc", name: "安定心神", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "60 尺", components: "声音、姿势", duration: "专注，至多 1 分钟",
    classes: ["吟游诗人", "牧师"],
    description: "你指定施法距离内一点，以该点为源点半径20尺球状区域内的每个类人生物必须成功通过一次魅力豁免，否则将受下列效应之一影响（由你分别为每名生物选择生效的效应）。"
  },

  {
    id: "gen-abd5nm", name: "不灭明焰", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（价值50+GP的红宝石尘，作为法术耗材）", duration: "直至被解除",
    classes: ["牧师", "德鲁伊", "法师"],
    description: "你所触碰的物件上冒出火焰。这一效应发出半径20尺的明亮光照以及额外20尺的微光光照。法术效应看上去与一般火焰无异，不过其并不会发热，也不需要燃料。你可以掩盖或隐藏火焰，但无法将其闷熄或扑灭。"
  },

  {
    id: "gen-hzxdas", name: "警戒箭阵", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一根装饰性穗带）", duration: "8小时",
    classes: ["游侠"],
    description: "你触碰至多四根非魔法箭矢或弩矢，将其插在位于你所处空间的地面上。*直到法术*结束为止，这些弹药不能被物理方法拔起，且当除你之外的生物第一次进入距弹药30尺内空间或在距弹药30尺内空间结束回合时，一枚弹药便会飞起攻击此生物。那名生物必须成功于一次敏捷豁免，否则受到2d4点穿刺伤害。那枚弹药随之被摧毁。当所有弹药都没有插在地面上时，法术终止。\n*施展该法术*时，你可以指定任意名你选择的生物，法术效应将无视他们。",
    higherLevel: "*使用的法术*位每比二环高一环，可被影响的弹药数量就增加两枚。"
  },

  {
    id: "gen-fbk9wo", name: "疯狂冠冕", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "120尺", components: "声音、姿势", duration: "专注，至多1分钟",
    classes: ["吟游诗人", "术士", "邪术师", "法师"],
    description: "一名施法距离内你可见的生物必须成功于一次感知豁免，*否则于法术*持续时间内陷入*魅惑*状态。非类人生物自动成功于此豁免。\n一顶虚体王冠出现在被魅惑目标的头顶，且目标每回合必须在移动之前使用其动作对除自身以外你精神性选择的目标发动一次近战攻击。若你并未选择任何生物，或目标触及内没有生物，则目标可在其回合正常行动。目标在其每回合结束时都可以重新豁免，豁免成功则结*束其身上该法术*的效应。\n在施法后，你在每个自己回合里必须用一个魔法动作维持对目标的控制，*否则法术*将终止。"
  },

  {
    id: "gen-nrg95", name: "黑暗术", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "60尺", components: "声音、姿势、材料（蝙蝠毛与一块煤）", duration: "专注，至多10分钟",
    classes: ["术士", "邪术师", "法师"],
    description: "你指定施法距离内一点，*并在法术*持续时间内使魔法性黑暗充斥以该点为中心半径15尺的球状区域。黑暗视觉也无法看穿这种黑暗，非魔法的光照也无法将其照亮。\n或者，*你可以将此法术*施展于一个未被着装或携带的物件上，使黑暗充斥源自该物件的15尺光环区域。将该物件用不透明的东西遮掩（比如用碗或头盔盖住）时，会将黑暗隔绝。\n*如果法术*区域与任何二环*或更低环阶法术*创造的明亮光照或微光光照区域重叠，则*这些造光的法术*将被解除。"
  },

  {
    id: "gen-kgtmw9", name: "黑暗视觉", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一根干胡萝卜）", duration: "8小时",
    classes: ["德鲁伊", "游侠", "术士", "法师"],
    description: "你触碰一名自愿生物，*该生物在法术*持续时间内拥有150尺黑暗视觉。"
  },

  {
    id: "gen-ai4p0b", name: "侦测思想", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作", range: "自身", components: "声音、姿势、材料（1铜币）", duration: "专注，至多1分钟",
    classes: ["吟游诗人", "术士", "法师"],
    description: "你激活下述效应之一。*直到法术*结束为止，你可以在你随后的回合用一个魔法动作以激活下述任意效应之一。"
  },

  {
    id: "gen-cd0asl", name: "强化属性", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（毛发或羽毛）", duration: "专注，至多1小时",
    classes: ["吟游诗人", "牧师", "德鲁伊", "游侠", "术士", "法师"],
    description: "你触碰一名生物并在力量、敏捷、智力、感知、魅力中选择一项属性。法术持续时间内，目标在使用所选属性进行的属性检定具有优势。",
    higherLevel: "*使用的法术*位每比二环高一环，你就可以额外指定一个目标。你可以分别为每个目标选择一项属性。"
  },

  {
    id: "gen-1k0ssnb", name: "变巨术/缩小术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "30尺", components: "声音、姿势、材料（一撮铁粉）", duration: "专注，至多1分钟",
    classes: ["吟游诗人", "德鲁伊", "术士", "法师"],
    description: "*在法术*持续时间内，法术使施法距离内一个你可见的生物或物件的大小发生改变（见下可选效应）。若你以物件为目标，则其不能被着装或携带。如果目标为非自愿生物，则其可以进行一次体质豁免。*豁免成功则法术*无效。\n如果目标是生物，则其着装物和携带物的尺寸也随之变化。随后任何从该生物身上脱离的物品都会立即恢复为正常大小。投掷武器和弹药在命中目标或失手后会恢复为正常大小。"
  },

  {
    id: "gen-gj209", name: "注目术", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "60尺", components: "声音、姿势", duration: "专注，至多1分钟",
    classes: ["吟游诗人", "邪术师"],
    description: "你编排一段使人分心的话语，指定施法距离内任何你能看见的生物。目标生物必须进行一次感知豁免。如果你或你的同伴正在和目标生物战斗，则其自动成功于该豁免。豁免失败时，*目标直到法术*终止之前进行的感知（察觉）检定与被动察觉值具有-10减值。"
  },

  {
    id: "gen-c5dkd9", name: "寻获坐骑", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "动作", range: "30尺", components: "声音、姿势", duration: "立即",
    classes: ["圣武士"],
    description: "你召唤某个异界存在作为忠诚坐骑，坐骑会出现在施法范围内你选择的未占据空间中。**此生物使用异界坐骑** 的数据。如果你已经*有一只以此法术*获得的坐骑，则其会被新坐骑替代。\n坐骑看起来像一匹大型的可骑乘动物（由你选择），比如一匹马，一头骆驼，一只恐狼或一头赤鹿。*你在施展此法术*时从下述三种生物类型中选择坐骑的生物类型：天族、妖精、邪魔，其数据中的特定特质由坐骑的生物类型决定。"
  },

  {
    id: "gen-c0t3nh", name: "寻找陷阱", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作", range: "120尺", components: "声音、姿势", duration: "立即",
    classes: ["牧师", "德鲁伊", "游侠"],
    description: "你感测到施法距离范围内，且在你视觉线范围内的任何陷阱。*该法术*的目标“陷阱”包括任何创造意图是造成伤害或其他危害的物件或装置。*因此该法术**可以感测警报术*Alarm**和守卫刻文**，也可以发现某个陷坑型机械陷阱。不过它不能揭示地板的某处自然产生的脆弱点，或某处不稳定的天花板，又或是某个隐藏的陷坑。\n*该法术*只单纯揭示陷阱的存在而不能得知陷阱的位置。不过你可以知晓所感测到陷阱其能够构成危害的大致形式。"
  },

  {
    id: "gen-h0ha3", name: "火焰刀", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "附赠动作", range: "自身", components: "声音、姿势、材料（一片漆树叶）", duration: "专注，至多10分钟",
    classes: ["德鲁伊", "术士"],
    description: "你在一只空手上召出一把火焰刀。该刀刃的尺寸和形状近似于一*把弯刀并在法术*持续时间内持续存在。当你放下刀刃时其将消失不见，但你可以用一个附赠动作重新将其唤出。\n你可以用一个魔法动作使用该火焰刀发*动一次近战法术*攻击。若命中，则目标受到3d6+你的施法属性调整值点火焰伤害。\n火焰刀提供半径10尺的明亮光照以及额外10尺的微光光照。",
    higherLevel: "*使用的法术*位每比二环高一环，*此法术*的伤害就增加1d6。"
  },

  {
    id: "gen-ep0ftt", name: "炽焰法球", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "动作", range: "60尺", components: "声音、姿势、材料（一颗蜡球）", duration: "专注，至多1分钟",
    classes: ["德鲁伊", "术士", "法师"],
    description: "一颗直径5尺的火焰球显现在施法距离内地面上的一处未被占据的空间，*并在法术*持续时间内持续存在。任何生物在火球周围5尺内结束其回合时必须进行一次敏捷豁免。豁免失败者将受到2d6点火焰伤害，豁免成功则伤害减半。\n你可以用一个附赠动作将火球沿着地面移动30尺。如果你将火球移入某名生物所占据的空间，则该生物必须进行对抗火球伤害的豁免，而火球在该回合内停止移动。\n移动火球时，你可以指引它越过不高于5尺的障碍，或者越过不宽过10尺的陷坑。被火球触碰的任何未被着装或携带的可燃物件都会开始燃烧。火球向其周围散发出半径20尺的明亮光照以及额外20尺的微光光照。",
    higherLevel: "*使用的法术*位每比二环高一环，其伤害就增加1d6。"
  },

  {
    id: "gen-ijqnga", name: "遗体防腐", source: "PHB'24",
    level: 2, school: "死灵", castingTime: "动作或仪式", range: "触碰", components: "声音、姿势、材料（2枚铜币，作为此法术的耗材）", duration: "10日",
    classes: ["牧师", "圣武士", "法师"],
    description: "你触碰一具尸体或其他遗骸。**目*标在法术*持续时间内不会腐烂且无法被转变为亡灵**。*该法术*同样可以有效的延长复活目标的时间限制，**因*为受该法术*影响下度过的*时间不计入法术*如死者复活** 的时间限制内。"
  },

  {
    id: "gen-luiwx", name: "造风术", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一颗豆类种子）", duration: "专注，至多1分钟",
    classes: ["德鲁伊", "游侠", "术士", "法师"],
    description: "一股长60尺，宽10尺的线状强风以你为起点向你指定的方向吹去。每名位于线状区域内的生物必须成功于一次力量豁免，豁免失败则沿着线状的方向被推离你15尺。在线状区域内结束其回合的生物也必须进行同样的豁免。\n任何生物在线状区域内朝更靠近你的方向移动时，其每移动1尺必须花费2尺的移动力。\n强风吹散区域内的毒气或蒸汽，并吹熄蜡烛等不受保护的其他类似火焰。而有保护的火焰（比如提灯）则会剧烈摇晃并有50%的概率被吹熄。\n你可以在自己随后的回合内用一个附赠动作改变线状风道的方向。"
  },

  {
    id: "gen-enzpsu", name: "灼热金属", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "60尺", components: "声音、姿势、材料（一片铁片和一团火焰）", duration: "专注，至多1分钟",
    classes: ["吟游诗人", "德鲁伊"],
    description: "指定施法距离内一件你能看见的人造金属物件（例如一把金属武器，或者一套金属质的重甲或中甲），并使该物件变得炽热。*施展该法术*时，任何与该物件有物理接触的生物均受到2d8点火焰伤害。*直到法术*终止前，只要这个物件依然在施法距离内，你都可以在你随后的每个回合以一个附赠动作来再次造成此伤害。\n若握持或着装该物件的生物因此受到伤害，则该生物必须通过一次体质豁免，否则如果这个生物只要能丢下该物件，该生物就必须丢下该物件。如果该物件没有被丢下，则直至你的下一回合开始为止，该生物进行攻击检定和属性检定时具有劣势。",
    higherLevel: "*使用的法术*位每比二环高一环，*此法术*的伤害就增加1d8。"
  },

  {
    id: "gen-c5fagg", name: "定身类人", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "60尺", components: "声音、姿势、材料（一片直的小铁片）", duration: "专注，至多1分钟",
    classes: ["吟游诗人", "牧师", "德鲁伊", "术士", "邪术师", "法师"],
    description: "指定施法距离内一个你能看见的类人生物。该目标必须进行一次感知豁免，豁免*失败则其在法术*持续时间内陷入*麻痹*状态。目标在其每回合结束时可以重新进行这次豁免，豁免成功则终*止其身上该法术*的效应。",
    higherLevel: "使用*三环或更高法术**位施展该法术*时，*你使用的法术*位每比二环高一环，就可以额外指定一个类人作为目标。"
  },

  {
    id: "gen-mipb1", name: "隐形术", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一根包裹在阿拉伯胶中的睫毛）", duration: "专注，至多1小时",
    classes: ["吟游诗人", "术士", "邪术师", "法师"],
    description: "你触碰的一个生物进入*隐形*状*态并维持至法术*终止。如果目标进行攻击检定、造成*伤害或施展法术*，*则此法术*提前终止。",
    higherLevel: "使用*三环或更高法术**位施展该法术*时，*你使用的法术*位每比二环高一环，就可以额外指定一个生物作为目标。"
  },

  {
    id: "gen-f9fgm", name: "敲击术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "60尺", components: "声音", duration: "立即",
    classes: ["吟游诗人", "术士", "法师"],
    description: "指定施法距离内一个你能看见的物件。该物件可以是一扇门，一个盒子，一个箱子，一副镣铐，一把挂锁，或是一个其他的通过魔法或普通手段来防止被打开的物件。\n被一把普通锁锁住的目标其锁会被解开，被卡死的目标会被松开，被闩住的目标会被打开。如果目标被多把锁锁住，则只有一把锁会被打开。\n**若你指*定的目标被法术*秘法锁** 锁住，则该秘法锁被压制 10 分钟，这段时间内目标可被正常开启和关闭。\n*施展该法术*时，受术目标会发出一声响亮的敲击声，其声响最远 300 尺内都能听见。"
  },

  {
    id: "gen-8ly2ut", name: "次等复原术", source: "PHB'24",
    level: 2, school: "防护", castingTime: "附赠动作", range: "触碰", components: "声音、姿势", duration: "立即",
    classes: ["吟游诗人", "牧师", "德鲁伊", "圣武士", "游侠"],
    description: "你触碰一个生物，并终止正影响它的一种状态：*目盲*，*耳聋*，麻痹或中毒 。"
  },

  {
    id: "gen-gmf37", name: "浮空术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "60 尺", components: "声音、姿势、材料（一个金属弹簧）", duration: "专注，至多 10 分钟",
    classes: ["术士", "法师"],
    description: "指定施法距离内你能看见的一个生物或未固定的物件，使其垂直上升至多 20 尺，并在该处维持悬浮直至持续时间结束。*该法术*可悬浮一个重量至多 500 磅的目标。一个非自愿的*生物可以对法术*进行一次体质豁免，若成功将避免受其影响。\n目标只能通过推或拉一个固定的物件或平面（例如一面墙或者天花板）来进行移动，这种移动方式视为等同于攀爬。你可以在自己回合里将目标的悬浮高度向上或向下改变至多 20 尺：如果你*自身就是该法术*的目标，则你可以进行上升和下降并将其作为你移动的一部分；如*果你不是该法术*的目标，则你可以使用魔法动作来移动目标，但目标必须始终处于你的施法距离内。\n法术终止时，仍处于空中的目标会缓缓飘落到地面。"
  },

  {
    id: "gen-2q0neg", name: "动植物定位术", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作或仪式", range: "自身", components: "声音、姿势、材料（一块寻血猎犬的皮毛）", duration: "立即",
    classes: ["吟游诗人", "德鲁伊", "游侠"],
    description: "你点名或描述一种特定的野兽生物、植物 生物或非魔法植物。如果5里内存在该类生物或植物，你将知晓其中最近的个体与你的相对方位和距离。"
  },

  {
    id: "gen-13j63ht", name: "物件定位术", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一根分叉的树枝）", duration: "专注，至多 10 分钟",
    classes: ["吟游诗人", "牧师", "德鲁伊", "圣武士", "游侠", "法师"],
    description: "你点名或描述一个你熟悉的物件。只要该物件与你相距不超过1000尺，你就会感测到该物件的方位。如果该物件正在移动，则你也将知晓其移动的方向。\n*该法术*可定位一个你认识的特定物件，不过你需要曾经在30尺内近距离看到过该物件至少一次；或者它也可定位特定的一类物件（如某种服装、珠宝、家具、工具或武器）中距你最近个体。如果有任意厚度的铅，即使只是薄薄一片铅片阻挡了你与被定位物件间的通路，则该物件*也无法被该法术*所定位。"
  },

  {
    id: "gen-n69qn", name: "魔嘴术", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "1分钟或仪式", range: "30尺", components: "声音、姿势、材料（价值10GP+的玉粉，作为法术耗材）", duration: "直到被解除",
    classes: ["吟游诗人", "法师"],
    description: "你将一段信息植入施法距离内的一个物件中，其信息会在满足预设事件时说出。指定一个你能看见且未被另一生物穿着或携带的物件。然后，你可以使用至多10分钟来传达这段不超过25个字的信息。最后再*来设定触发法术*传达信息的事件。预设的事件发生时，目标物件上出现一张魔法嘴，并用与你相同的声音和音量复述所存储的信息。如果你指定的目标本身有一张嘴或者类似嘴的结构（例如雕像的嘴），则魔法嘴将生成在该嘴结构的位置，使其看起来如同是物件的嘴在说话一样。*施展该法术*时，*你可以让法术*在传达过信息后随即终止，或*者也可以让法术*一直持续并在每次被预设条件触发时进行复述。你所决定的触发条件可以很概括也可以很具体，不过你只能根据目标物件30尺内的视觉或听觉状况来设定条件。例如，你可以命令魔嘴在任何生物移动至物件30尺内时说出信息，或者当其30尺内有银铃响起时说出信息。"
  },

  {
    id: "gen-jxz538", name: "魔化武器", source: "PHB'24",
    level: 2, school: "变化", castingTime: "附赠动作", range: "触碰", components: "声音、姿势", duration: "1小时",
    classes: ["圣武士", "游侠", "术士", "法师"],
    description: "你触碰一件非魔法武器。*直到法术*结束前，它成为魔法武器且在进行攻击检定和伤害掷骰时具有+1 加值。你*再次施展该法术*时，先前的效应提前结束。",
    higherLevel: "使用*三至五环的法术*位时，*此法术*的加值增加至+2；使用*高于五环的法术*位时，*此法术*的加值增加至+3。"
  },

  {
    id: "gen-kd6jb7", name: "马友夫强酸箭", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "90尺", components: "声音、姿势、材料（大黄粉）", duration: "立即",
    classes: ["法师"],
    description: "一支闪烁的绿色箭矢朝一个施法距离内的目标疾速飞去，并炸裂成一滩强酸。对目标进*行一次远程法术*攻击。若命中，则目标受到4d4点强酸伤害，然后再其下一回合结束时再受到2d4点强酸伤害。若未命中，则箭矢的酸液溅射目标，造成初始伤害一半的伤害。",
    higherLevel: "*使用的法术*位每比二环高一环，*此法术*伤害（包括初始和后续）增加1d4。"
  },

  {
    id: "gen-cjqiye", name: "心灵尖刺", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作", range: "120尺", components: "姿势", duration: "专注，至多1小时",
    classes: ["术士", "邪术师", "法师"],
    description: "指定施法距离内一个可见生物，你驱动一道心灵能量的锥刺侵入目标的心智。目标必须进行一次感知豁免检定，失败则会受到3d8点心灵伤害，成功则只受一半伤害。在目标豁免失败时，*你在法术*结束之前能时刻得知目标所在的位置，只要你们还处于同一个存在位面上。当你拥有目标的位置信息时，目标将不能对你躲藏，并且如果它隐形了，在对抗你时它不能从这个状态中受益。",
    higherLevel: "*使用的法术*位每比二环高一环，*此法术*的伤害就增加1d8。"
  },

  {
    id: "gen-mcda2", name: "镜影术", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作", range: "自身", components: "声音、姿势", duration: "1分钟",
    classes: ["吟游诗人", "术士", "邪术师", "法师"],
    description: "三个你自身的幻象分身出现在你所处的空间中。*直到法术*终止前，分身都会随你移动，并模仿你的动作和位置变换，使人无法追踪判断哪一个是你的真身。\n*在法术*持续时间内，每当一个生物攻击命中你时，为每个剩余分身投掷一个d6，只要有任一d6骰出3或以上，一个分身代你承受本次命中并随之被摧毁。分身无视所有其他的伤害和效应。三个分身都被摧毁时，法术随之结束。\n如果一名生物处于*目盲*状态，或拥有盲视，或拥有真实视觉，*则该法术*无法影响该生物。"
  },

  {
    id: "gen-lrw6q", name: "迷踪步", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "附赠动作", range: "自身", components: "声音", duration: "立即",
    classes: ["术士", "邪术师", "法师"],
    description: "你短暂地被银白的雾气所笼罩，传送到至多30尺内一个你能看见且未被占据的空间。"
  },

  {
    id: "gen-dceqzo", name: "月华之光", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "120尺", components: "声音、姿势、材料（一片月籽藤叶）", duration: "专注，至多1分钟",
    classes: ["德鲁伊"],
    description: "指定施法距离内一点，一束淡淡的银光照耀在以该点为中心半径5尺、高40尺的柱状区域内。*直至法术*终止前，柱状区域内处于微光光照。*在施展该法术*的后续回合内，你能够以一个魔法动作将柱状区域移动至多60尺。柱状区域出现时，每个区域内的生物进行一次体质豁免检定，豁免失败则受到2d10的光耀伤害，且若该生物已变形（*例如受法术**变形术*Polymorph影响），其变回真实形态，且无法在离开柱状区域前变形。豁免成功则仅承受前述伤害的一半。*在法术*区域进入生物空间、*生物进入法术*区域或在其内结束回合时，目标生物也需要进行该体质豁免检定。一名生物每回合仅需进行一次该豁免检定。",
    higherLevel: "*使用的法术*位每比二环高一环，*此法术*的伤害就增加1d10。"
  },

  {
    id: "gen-6ydvvt", name: "涅斯图魔法灵光", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一小片方形丝绸）", duration: "24小时",
    classes: ["法师"],
    description: "你触碰一名自愿生物或者一个未被着装或携带的物件以在其*上设置一道幻术*。生物获得下述伪装效应，物件则获得下述虚假灵光效应。*效应持续至法术*结束。如果你持续30日每日均对同一个*目标施展此法术*，*则幻术*会的持续时间变为直至被解除。"
  },

  {
    id: "gen-jzdqpo", name: "魅影之力", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作", range: "60尺", components: "声音、姿势、材料（一点羊毛）", duration: "专注，至多1分钟",
    classes: ["吟游诗人", "术士", "法师"],
    description: "你试图向施法距离内你可见的一名生物脑*内植入一段幻术*。目标进行一次智力豁免。豁免失败时，你创造出一个不大于10尺立方且只能被目标感知到的魅影物件，生物或其他你指定的现象。魅*影将持续至法术*终止。该魅影包括声音、温度和其他感官因素。目标可以用研究动作进行*一次对抗你法术*豁免DC的智力（调查）检定来仔细研究这个魅影。检定成功则目标意识到*魅影是一道幻术*，法术终止。*目标受法术*影响期间会认定魅影是真实的，并且会合理化任何与其互动产生的不合逻辑的结果。例如，若目标试图走过一座跨越峡谷的魅影桥时从桥上坠落并存活，它仍然会相信该桥是真实存在的，并且会觉得是其他什么东西导致了自己的坠落。若魅影代表着一名危险生物或一处灾害，*则受术*目标甚*至还会受到幻术*的直接伤害。在每个你的回合中，若目标在魅影区域内或距其5尺范围内，则上述形态的魅影可以对目标造成2d8点心灵伤害。而此时目标则会感觉该伤害类型与魅影适于造成的一种伤害类型相符。"
  },

  {
    id: "gen-e7iso5", name: "治疗祷言", source: "PHB'24",
    level: 2, school: "防护", castingTime: "10分钟", range: "30尺", components: "声音", duration: "立即",
    classes: ["牧师", "圣武士"],
    description: "*在施展法术*期间一直位于施法距离内的至多五名生物获得等同于一次短休的增益，并且恢复2d8点生命值。一名生物直到完成一次长休为止不*能再次被此法术*影响。",
    higherLevel: "*使用的法术*位每比二环高一环，*此法术*的治疗量就增加1d8。"
  },

  {
    id: "gen-jcyf9c", name: "防护毒素", source: "PHB'24",
    level: 2, school: "防护", castingTime: "动作", range: "触碰", components: "声音、姿势", duration: "1小时",
    classes: ["牧师", "德鲁伊", "圣武士", "游侠"],
    description: "你触碰一名生物并结束其陷入的*中毒*状态。在持续时间内，目标为避免陷入或结束*中毒*状态所做的豁免具有优势，且具有毒素伤害的抗性。"
  },

  {
    id: "gen-hlwo8s", name: "衰弱射线", source: "PHB'24",
    level: 2, school: "死灵", castingTime: "动作", range: "60尺", components: "声音、姿势", duration: "专注，至多1分钟",
    classes: ["邪术师", "法师"],
    description: "你向施法距离内的一名生物射出一道让人衰弱的能量射线。目标必须进行一次体质豁免。豁免成功，则目标直到你的下个回合开始在下一次攻击掷骰上具有劣势。豁免失败，目标在持续时间内在使用力量属性的D20检定上具有劣势。同样的，在此期间，其所有的伤害掷骰获得1d8的减值。目标在每个其回合结束时可以重复豁免，*豁免成功则法术*终止。"
  },

  {
    id: "gen-nd78w", name: "魔绳术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一段绳子）", duration: "1小时",
    classes: ["法师"],
    description: "你接触一段绳子。绳的一端会向上升起，直到整条绳索都垂直于地面挂在空中或绳子触及天花板。绳子向上的末端存在一个隐形的3尺×5尺大小的传送门，*其通往一个法术*持续时间内一直存在的异次元空间。沿着绳子向上攀爬即可进入此空间，绳子也可被拽入空间中或从空间中丢出。空间可容纳至多八名体型不超过中型的生物。攻击，法术和其他效应均无法穿过空间而出入，但空间内的生物可以通过入口看到外面的景象。法术终止时，异次元空间内的一切东西都会掉出来。"
  },

  {
    id: "gen-enqr58", name: "灼热射线", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "120 尺", components: "声音、姿势", duration: "立即",
    classes: ["术士", "法师"],
    description: "你射出三道火焰的射线。你可以将其射向施法距离内的一个或多个目标。每道射线需要你分别进*行一次远程法术*攻击。若命中，则目标受到2d6点火焰伤害。",
    higherLevel: "*使用的法术*位每比二环高一环，你就能多创造出一道射线。"
  },

  {
    id: "gen-i4zn9c", name: "识破隐形", source: "PHB'24",
    level: 2, school: "预言", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一撮滑石粉）", duration: "1 小时",
    classes: ["吟游诗人", "术士", "法师"],
    description: "*在法术*持续时间内，你能看见任何处于*隐形*状态的生物和物件，如同其处于正常可见状态一样。你还能够看见以太位面，以太位面的生物和物件在你眼中会以幽灵般的半透明形状显现。"
  },

  {
    id: "gen-g7uxbo", name: "粉碎音波", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "动作", range: "60 尺", components: "声音、姿势、材料（一片云母）", duration: "立即",
    classes: ["吟游诗人", "术士", "法师"],
    description: "一阵震耳欲聋的噪音在你指定的施法距离内一点上爆发出来。以该点为中心半径10尺球状区域内的所有生物必须要进行一次体质豁免。豁免失败将受到3d8点雷鸣伤害；豁免成功受到半数伤害。构装生物进行该豁免时具有劣势。*如果法术*的范围内存在不被任何生物着装携带的非魔法物件，则它也要受到该伤害。",
    higherLevel: "*使用的法术*位每比二环高一环，*此法术*的伤害就增加1d8。"
  },

  {
    id: "gen-mktn7", name: "闪耀斩", source: "PHB'24",
    level: 2, school: "变化", castingTime: "附赠动作，当你使用近战武器或徒手打击命中一个生物后立即执行", range: "自身", components: "声音", duration: "专注，至多1分钟",
    classes: ["圣武士"],
    description: "被该次攻击检定命中的目标会在此次攻击中额外受到2d6点光耀伤害。目标会发出半径5尺的明*亮光照直至法术*结束。在此期间，对其进行的攻击检定具有优势，且其无法受益于*隐形*状态。\n（注：*本法术*在PHB2014**中原名印记斩** Smite）",
    higherLevel: "*使用的法术*位每比二环高一环，*此法术*的额外伤害就增加1d6。"
  },

  {
    id: "gen-gnvz4", name: "沉默术", source: "PHB'24",
    level: 2, school: "幻术", castingTime: "动作或仪式", range: "120 尺", components: "声音、姿势", duration: "专注，至多 10 分钟",
    classes: ["吟游诗人", "牧师", "游侠"],
    description: "你指定施法距离内一点，以该点为中心半径20尺的*球状区域在法术*持续时间内将无法产生任何声音，且外界的声音也无法于该区域内传播。任何完全位于该区域内的生物和物件都将免疫雷鸣伤害，而完全位于该区域内的任何生物都将陷入*耳聋*状态。此外，该区域内无法施展包含*言语成分的法术*。"
  },

  {
    id: "gen-keu7y", name: "蛛行术", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一滴沥青和一只蜘蛛）", duration: "专注，至多 1 小时",
    classes: ["术士", "邪术师", "法师"],
    description: "你触碰一个自愿的生物，*并使其在法术*终止前能够在垂直表面上下或横向移动，其甚至可以在天花板上倒挂着移动而不需要用到双手。另外，目标获得等同于其速度的攀爬速度。",
    higherLevel: "*使用的法术*位每比2环高一环，你便能额外指定一*个生物作为法术*的目标。"
  },

  {
    id: "gen-gzt0s6", name: "荆棘丛生", source: "PHB'24",
    level: 2, school: "变化", castingTime: "动作", range: "150尺", components: "声音、姿势、材料（七根棘刺）", duration: "专注，至多 10 分钟",
    classes: ["德鲁伊", "游侠"],
    description: "以施法距离内一点为中心周围20尺半径的球状区域扭曲变形，大片坚硬的棘刺破土而出。*该区域在法术*持续时间内视为困难地形。而生物进入该区域或在其中移动时，其每移动5尺就要受到2d4点穿刺伤害。法术导致的地面变形经过伪装，使其看起来并无异样。如果生物*在你施展此法术*时看不见这片区域，则它只有在执行一次搜索动作并成功进行一次感知（察觉或求生）检定后，才能在进入之前发现该区域隐藏的危险。"
  },

  {
    id: "gen-eirhz4", name: "灵体武器", source: "PHB'24",
    level: 2, school: "塑能", castingTime: "附赠动作", range: "60 尺", components: "声音、姿势", duration: "专注，至多1 分钟",
    classes: ["牧师"],
    description: "你创造出一块形似你选择的武器的浮空灵体力场，并*使其持续到法术*持续时间结束。它出现在施法距离内你选择的一点，并且你可以立即对该武器周围5尺内的一个生物发*动一次近战法术*攻击。若命中，则目标受到 1d8+你的施法属性调整值 点力场伤害。在你之后的回合内，你可以用附赠动作让该武器移动至多20尺，并再对它周围5尺内的一个生物发动一次同样的攻击。",
    higherLevel: "*使用的法术*位每比二环高一环，*此法术*的伤害就增加1d8。"
  },

  {
    id: "gen-fm51o", name: "暗示术", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "30 尺", components: "声音、材料（一滴蜂蜜）", duration: "专注，至多 8 小时",
    classes: ["吟游诗人", "术士", "邪术师", "法师"],
    description: "你以魔法影响施法距离内一个你能看见的生物，并对其施以某种行动暗示（不超过25个词）。*由你指定的受术*目标必须能听到并理解你的话语。暗示必须听起来可行，也不涉及明显会对目标及其盟友造成伤害的内容。比如说，你可以说“把邪教的宝库钥匙找来，然后给我。”或者：“别打了，让图书馆保持安静，然后出去别回来。”\n目标必须成功通过一次感知豁免，*否则在法术*持续时间内陷入*魅惑*，若你或你的盟友对其*造成伤害此法术*将提前结束。被魅惑的生物会尽其所能地执行你所描述的行为。你所暗示的行*为可能会在法术*持续时间内始终一直进行，而如果你所暗示的活动可以用更短的时间完成，*则此法术*会在目标完成了你的要求后随即终止。"
  },

  {
    id: "gen-ch5xuw", name: "野兽召唤术", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "动作", range: "90 尺", components: "声音, 姿势, 材料（一根羽毛、一簇毛皮和一条装在镀金橡果内的鱼尾、价值至少200GP）", duration: "专注，至多1小时",
    classes: ["德鲁伊", "游侠"],
    description: "你唤来一个野兽灵魄。其使用下文野兽灵魄的数据，并会在施法距离内一处你可见的未被占据的空间中显现。*当你施展法术*时，从天空、大地和海洋中选择一个环境。该生物会显化符合为你所选的环境的形态，其数据中的部分特性也受此影响。该生物会在生命值降为0*或是法术*结束时消失。\n该生物是你的盟友（对你的其他盟友亦是如此）。它在战斗中使用你的先攻，并在你回合结束后立即行动。它遵从于你的口头指令（无需任何动作）。如果你不发令，它将执行回避动作并用移动力远离危险。",
    higherLevel: "该生物的数*据使用新的法术*环阶。"
  },

  {
    id: "gen-byg65r", name: "守护之链", source: "PHB'24",
    level: 2, school: "防护", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一对铂金戒指（每个价值50GP+），你和目标在法术持续时间内需保持佩戴它们）", duration: "1小时",
    classes: ["牧师", "圣武士"],
    description: "你触碰另一个自愿的生物，*在法术*终止前在你和目标之间建立一道神秘的连接。目标位于你身边60尺内时，其AC和豁免检定具有+1加值，且对所有伤害具有抗性。此外，每当目标受到伤害时，你也会受到同样的伤害。\n如果你的生命值降至0，或你与目标距离超过60尺，*则该法术*终止。如果再有守护之链被施展于两个已被连接生物中的任意一方时，*原有的法术*将立刻终止。"
  },

  {
    id: "gen-kdb89", name: "蛛网术", source: "PHB'24",
    level: 2, school: "咒法", castingTime: "动作", range: "60尺", components: "声音、姿势、材料（少量蜘蛛网）", duration: "专注，至多1小时",
    classes: ["术士", "法师"],
    description: "你在施法距离内指定一点召唤出一大片黏黏的网状物。蛛网覆盖以该点为源点的 20 尺立方区域，*并在法术*持续时间内维持存在。蛛网范围内视为困难地形，并造成轻度遮蔽 。\n如果蛛网没有被固定在两个固体中间（例如墙和树）或跨在一片地板、墙壁、天花板中间，则蛛网会自动坍塌，*而导致法术*在你的下一回合开始时终止。摊在平面上的蛛网深度为 5 尺。\n在一个回合中首次进入蛛网，或任何在蛛网中开始其回合的生物必须进行一次敏捷豁免，否则陷入*束缚*状态，直至其离开蛛网或挣脱*束缚*。\n一名因蛛网陷入*束缚*状态的生物可以用一个动作进行一*次对抗你的法术*豁免DC的力量（运动）检定。如果成功，则其不再被*束缚*。\n蛛网是可燃的。任何5尺立方区域的蛛网在遇到火焰后会在一轮内燃烧殆尽，并对火焰中开始其回合的生物造成2d4点火焰伤害。"
  },

  {
    id: "gen-i0tcl4", name: "诚实之域", source: "PHB'24",
    level: 2, school: "惑控", castingTime: "动作", range: "60尺", components: "声音、姿势", duration: "10分钟",
    classes: ["吟游诗人", "牧师", "圣武士"],
    description: "你创造一个抵御谎言的魔法区域，该区域以施法距离内一点为中心，覆盖以该点为中心15尺半径的球状区域。*在法术*终止前，生物在一回合中首次进入该区域，或在该区域内开始其回合时，必须进行一次魅力豁免。豁免失败者在该区域内不能故意说谎。而你可以知晓每个生物进行的此豁免成功与否。\n受影响的生物可以意识到该效果的存在，因此它可以主动回避回答那些通常会以谎言答复的问题。该生物在回答问题时可以闪烁其词、避重就轻，但说的仍然需要是真话。"
  },
  {
    id: "gen-pass-without-trace", name: "行动无踪术", source: "PHB'24",
    level: 2, school: "防护", castingTime: "动作", range: "自身", components: "声音、姿势、材料（槲寄生叶燃烧后的灰烬和一根云杉嫩枝）", duration: "专注，至多 1 小时",
    classes: ["德鲁伊", "游侠", "牧师"],
    description: "光影与静默的面纱从你身上散发出来，掩盖你不被侦测。法术持续期间，你选择的你周围 30 尺内的每个生物（包括你）的敏捷（隐匿）检定获得 +10 加值，且除非使用魔法手段否则无法被追踪。获得此加值的生物不会留下踪迹。"
  }
];

