import { SpellItem } from './types';

export const SPELL_DB_LEVEL_3: SpellItem[] = [
  // ==========================================
  // 3环法术 - PHB'24 Only
  // ==========================================

  {
    id: "gen-e4nyjc", name: "活化死尸", source: "PHB'24",
    level: 3, school: "死灵", castingTime: "1 分钟", range: "10 尺", components: "声音、姿势、材料（一滴血、一块肉、以及一点骨灰）", duration: "立即",
    classes: ["牧师","法师"],
    description: "在施法距离内指定一具中型或小型类人遗骨或遗体。目标将变为一名亡灵生物：**遗骨变为骷髅**，**遗体则变为丧尸**。（这些生物的资料卡见附录B）。\n在你的每个回合内，你可以使用一个附赠动作并以精神命令操纵距离你 60 尺内，*任何你用此法术*制造的生物（如果你操纵多个生物，则你的命令可以同时传达给它们全部或是其中的某几个，不过每次只能为它们下达同一命令）。你决定被操纵生物下回合执行的动作和如何移动。或者，你也可以选择下达一条宽泛的命令（比如守护某个房间或走廊）。如果你没有下达命令，该生物将执行回避动作且只会为躲避危险而移动。一旦被下达命令，该生物会持续执行命令直到任务完成。\n这些受操纵生物只会在 24小时内服从你的命令，在之后，它们会停止遵守你下达的命令。若你想将对这些生物的控制时间再延长24小时，则你必须在当前24小时的时间段终止前再次对这些*生物施展该法术*。法术的此种用法只能延长你对至多四*个你使用此法术*所创造生物的控制时间，而不会创造新的生物。",
    higherLevel: "*使用的法术*位每比三环高一环，你就能多唤起两只亡灵生物，或是多延长对两只亡灵生物的控制。你无法用同一具骸骨或遗体唤起多个亡灵生物。"
  },

  {
    id: "gen-e4m7n8", name: "活力灵光", source: "PHB'24",
    level: 3, school: "塑能", castingTime: "动作", range: "自身", components: "声音", duration: "专注，至多 1 分钟",
    classes: ["牧师","德鲁伊","圣武士"],
    description: "一道灵光自你身上发出并形成30尺半径的光环 。当你创造灵光时和它持续时你的每个回合开始，你可以为区域内的一名生物恢复2d6生命值。"
  },

  {
    id: "gen-caiy39", name: "希望信标", source: "PHB'24",
    level: 3, school: "防护", castingTime: "动作", range: "30尺", components: "声音、姿势", duration: "专注，至多一分钟",
    classes: ["牧师"],
    description: "在施法距离内指定任意数量的生物，*并使其在法术*持续时间内进行的感知豁免和死亡豁免具有优势。此外，其获得的所有治疗的生命值恢复量都取最大值。"
  },

  {
    id: "gen-q12d", name: "降咒", source: "PHB'24",
    level: 3, school: "死灵", castingTime: "动作", range: "触碰", components: "声音、姿势", duration: "专注，至多1分钟",
    classes: ["吟游诗人","牧师","法师"],
    description: "你触碰一名生物。该生物必须进行一次感知豁免并成功通过，*否则将在法术*持续时间内被诅咒。直到诅咒终止前，目标会遭受以下一项效应，由你选择："
  },

  {
    id: "gen-jm12j", name: "致盲斩", source: "PHB'24",
    level: 3, school: "塑能", castingTime: "附赠动作，当你使用近战武器或徒手打击命中一个生物后立即执行", range: "自身", components: "声音", duration: "1分钟",
    classes: ["圣武士"],
    description: "被该次攻击检定命中的目标会在此次攻击中额外受到3d8点光耀伤害，并且目标陷入*目盲*状*态直至法术*结束。陷入目盲的目标在其每回合结束时可以进行一次体质豁免，豁免成功则终*止其身上的法术*。",
    higherLevel: "*你使用的法术*位每比三环高一环，*此法术*的额外伤害提升1d8。"
  },

  {
    id: "gen-miqjt", name: "闪现术", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作", range: "自身", components: "声音、姿势", duration: "1分钟",
    classes: ["术士","法师"],
    description: "*你在法术*持续时间内每次自己回合结束时掷一次d6。结果为4~6时，你从你现在身处的存在位面消失，**并出现在以太位面** （若你本已身处以太位面，*此法术*会立即终止）。在你身处以太位面期间，你可以观测到你所离开位面的黑白影像，但只限于60尺之内。你只能影响其他身处以太位面的生物，或被其影响。并且处于其他位面的生物在没有能够观测到以太位面事物的特殊能力的情况下，同样无法观测到你。\n你会在你的下一回合开始时返回其他位面；*如果当你法术*终止时身处以太位面，你同样会返回其他位面。你返回原先位面时会出现在一个你原先位置10尺之内你可见的未被占据的空间之中。若在此范围内没有未被占据的空间，则你会出现在最近的未被占据的空间之中"
  },

  {
    id: "gen-d0rgk", name: "召雷术", source: "PHB'24",
    level: 3, school: "咒法", castingTime: "动作", range: "120 尺", components: "声音、姿势", duration: "专注，至多 10 分钟",
    classes: ["德鲁伊"],
    description: "一朵风暴云在施法距离内你上方可见的一点出现。风暴云表现为高10尺、半径60尺的柱状形状。\n当*你施展这道法术*时，选择风暴云下方你可见的一点。一束闪电从云端射向该点。位于该点5尺内的生物进行一次敏捷豁免。豁免失败者受到3d10闪电伤害，豁免成功则仅受半数伤害。\n*直至法术*结束前，你都可以执行一个魔法动作以此法再次降下闪电，并指定闪电射向同一点或另选一点。\n若施法时你身处暴风雨环境下的室外，*则该法术*令你得以控制空中的风暴而非创造一朵新的风暴云。在这种状况下，法术伤害增加1d10。",
    higherLevel: "*使用的法术*位每比三环高一环，*此法术*的伤害就增加 1d10。"
  },

  {
    id: "gen-nsa8z", name: "鹰眼术", source: "PHB'24",
    level: 3, school: "预言", castingTime: "10 分钟", range: "1 里", components: "声音、姿势、材料（一件价值100GP+的法具：选择聆听则为一个以珠宝装饰的号角，选择观察则为一颗玻璃眼珠）", duration: "专注，至多 10 分钟",
    classes: ["吟游诗人","牧师","术士","法师"],
    description: "你在施法距离内某处创造一个隐形的传感器，该处可以是你熟悉的地点（你曾到访过或看见过的地方），也可以是你不熟悉的显眼处（比如一扇门后，拐角位置或树林里）。这一无形体且不受伤害的*传感器会在法术*持续期间停留在该地。\n*施展该法术*时，你可以选择进行观察或是聆听。你可以通过传感器以所选的感官方式感测，如同你处在传感器所在的空间。你能够以一个附赠动作在观察和聆听之间切换。\n可以看见传感器的生物（**例如一名生物受益于识破隐形** Invisibility或真实视觉时）会看到传感器是一个拳头大小的发光球体。"
  },

  {
    id: "gen-b0vk7t", name: "咒唤兽群", source: "PHB'24",
    level: 3, school: "咒法", castingTime: "动作", range: "60 尺", components: "声音、姿势", duration: "专注，至多10分钟",
    classes: ["德鲁伊","游侠"],
    description: "你将显现为幽灵般虚幻的大型兽群的自然精魂咒唤在施法距离内一处你可见的未占据空间中。兽群在持续时间内一直存在，并且你可以选择动物精魂的形态——例如狼群、蛇群或是鸟群。\n在你位于兽群5尺内期间，你的力量豁免检定具有优势。当你在你的回合移动时，你可以令兽群也移动至多30尺到一处你可见的未被占据的空间中。\n每当兽群在移动中进入了一名你可见的生物10尺内时、一名你可见的生物进入位于兽群10尺内的空间或是在该空间结束其回合时，你都可以迫使该生物进行一次敏捷豁免检定。失败则该生物受到3d10挥砍伤害。一名生物一回合只需要进行一次该豁免。",
    higherLevel: "*使用的法术*位每比三环高一环，*此法术*的伤害就增加1d10。"
  },

  {
    id: "gen-fzee6w", name: "箭如雨下", source: "PHB'24",
    level: 3, school: "咒法", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一把价值1+CP的近战或远程武器）", duration: "立即",
    classes: ["游侠"],
    description: "你挥舞作为施法材料的武器，令无数外形相似的灵体武器（或是适合这把武器的弹药）显现，它们将向前射出并在之后消失。每名由你选择且你可见的位于60尺锥形区域内的生物进行一次敏捷豁免检定，豁免失败者将受到5d8点力场伤害，豁免成功则只受一半伤害。",
    higherLevel: "*使用的法术*位每比三环高一环，*此法术*的伤害就增加1d8。"
  },

  {
    id: "gen-e5opz7", name: "法术反制", source: "PHB'24",
    level: 3, school: "防护", castingTime: "反应，当你看见60尺内一名生物施展一道具有言语、姿势或材料成分的法术时可用", range: "60尺", components: "姿势", duration: "立即",
    classes: ["术士","邪术师","法师"],
    description: "你试图打断一名正在施法的生物。该生物进行一次体质豁免。*豁免失败则法术*消散且毫无效果，并*且用于施展法术*的动作、附赠动作或反应随之浪费。*如果那道法术**是使用法术*位施展的，*则法术*位并不会被消耗。"
  },

  {
    id: "gen-lpqox", name: "造粮术", source: "PHB'24",
    level: 3, school: "咒法", castingTime: "动作", range: "30尺", components: "声音、姿势", duration: "立即",
    classes: ["牧师","圣武士"],
    description: "你在施法距离内的地面上或容器中创造45磅食物和30加仑淡水，*该法术*创造的食物和水均可用于避免饥饿和脱水 的危害。食物味道寡淡却营养丰富，并且看起来像一种你选择的食物，水也是干净的。食物24小时内未被食用即会变坏。"
  },

  {
    id: "gen-hrmnx4", name: "十字军披风", source: "PHB'24",
    level: 3, school: "塑能", castingTime: "动作", range: "自身", components: "声音", duration: "专注，至多1分钟",
    classes: ["圣武士"],
    description: "你在30尺光环区域内散发出魔法灵光。位于灵光范围期间，你和你盟友以一把武器或一次徒手打击命中时将额外造成1d4光耀伤害。"
  },

  {
    id: "gen-fh065", name: "昼明术", source: "PHB'24",
    level: 3, school: "塑能", castingTime: "动作", range: "60尺", components: "声音、姿势", duration: "1小时",
    classes: ["牧师","德鲁伊","圣武士","游侠","术士"],
    description: "法术持续时间内，日光从施法距离内一点发散而出，充斥一个60尺半径的球状区域。日光区域视为明亮光照，且会再额外散发出60尺微光光照。\n或者，*你可以将此法术*施展于一个未被着装或携带的物件上，使日光充斥以该物件为中心的60尺光环区域。将该物件用不透明的东西遮掩（比如用碗或头盔盖住）时，会将日光隔绝。\n*如果法术*区域与任何三环*或更低环阶法术*创造的黑暗 区域重叠，则*这些造暗的法术*将被解除。"
  },

  {
    id: "gen-i0vaua", name: "解除魔法", source: "PHB'24",
    level: 3, school: "防护", castingTime: "动作", range: "120尺", components: "声音、姿势", duration: "立即",
    classes: ["吟游诗人","牧师","德鲁伊","圣武士","游侠","术士","邪术师","法师"],
    description: "在施法距离内指定一名生物、一个物件或一处魔法效应。所有影响该目标的三环*或更低环阶法术*即告终止。每个影响目标的四环*或更高环阶法术*都需要以你的施法属性进行一次属性检定（DC 10+*目标法术*环阶），检定*成功时目标法术*终止。",
    higherLevel: "你直接终止影响目标的小于等于该*施法环阶的法术*效应。"
  },

  {
    id: "gen-artqyn", name: "元素武器", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作", range: "触碰", components: "声音、姿势", duration: "专注，至多1小时",
    classes: ["德鲁伊","圣武士","游侠"],
    description: "你触碰的一把非魔法武器变成魔法武器。选择下述伤害类型之一：强酸、寒冷、火焰、闪电、雷鸣。法术持续时间内，用那把武器发动的攻击检定具有+1加值，且在命中时造成额外1d4点你所选伤害类型的伤害。",
    higherLevel: "使用*五环或六环法术*位时，攻击检定的加值变为+2，额外伤害变为2d4。使用*七环或更高法术*位时，攻击检定的加值变为+3，额外伤害变为3d4。"
  },

  {
    id: "gen-ekwhk", name: "恐惧术", source: "PHB'24",
    level: 3, school: "幻术", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一根白羽毛）", duration: "专注，至多1分钟",
    classes: ["吟游诗人","术士","邪术师","法师"],
    description: "30尺锥状区域内的所有生物必须通过一次感知豁免，豁免失败者将丢弃其所有持握物，*并在法术*持续时间内陷入*恐慌*状态。\n以此法被恐慌的生物必须在自己回合中执行疾走动作，并以此寻找最安全的路线远离你，直至其无路可走为止。如果该生物结束其回合时位于一处使其视觉线中没有你的空间，则其可以再进行一次感知豁免，*豁免成功则法术*对该生物的效应终止。"
  },

  {
    id: "gen-ca5cr", name: "假死术", source: "PHB'24",
    level: 3, school: "死灵", castingTime: "动作或仪式", range: "触碰", components: "声音、姿势、材料（一撮墓土）", duration: "1小时",
    classes: ["吟游诗人","牧师","德鲁伊","法师"],
    description: "你触碰一名自愿生物并将其变得如死者般的僵直。\n*在法术*持续时间内，对目标进行的任何*肉体检查和法术*检测都显示目标已死亡。该状况下的目标陷入目盲以及*失能*状态，且其速度降至0。\n目标对除了心灵伤害外的所有伤害类型具有抗性，也免疫*中毒*状态。"
  },

  {
    id: "gen-h12rb", name: "火球术", source: "PHB'24",
    level: 3, school: "塑能", castingTime: "动作", range: "150尺", components: "声音、姿势、材料（一颗蝙蝠粪和硫磺搓成的小球）", duration: "立即",
    classes: ["术士","法师"],
    description: "明亮的闪光从你的指间飞驰向施法距离内你指定的一点，并随着一声低吼迸成一片烈焰。目标点周围半径20尺球状区域内的每个生物必须进行一次敏捷豁免。豁免失败者将受到8d6点火焰伤害，豁免成功则伤害减半。\n区域内所有未被着装或携带的可燃物件会开始燃烧。",
    higherLevel: "*使用的法术*位每比三环高一环，此伤害就增加1d6。"
  },

  {
    id: "gen-n1tc1", name: "飞行术", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一根羽毛）", duration: "专注，至多10分钟",
    classes: ["术士","邪术师","法师"],
    description: "你触碰一个自愿生物。*目标在法术*持续时间内获得60尺的飞行速度且可以悬浮。法术终止时，如果目标仍在空中，否则其随即坠落，除非其有办法阻止坠落。",
    higherLevel: "*使用的法术*位每比三环高一环，你就可以额外再指定一*名生物作为法术*目标。"
  },

  {
    id: "gen-dzdgs3", name: "气化形体", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一小块纱布）", duration: "专注，至多1小时",
    classes: ["术士","邪术师","法师"],
    description: "*在法术*持续时间内，你将触碰到的一名自愿生物连同其穿着携带物一起转化为一团云雾。如果目标的生命值降至0或其用一个魔法动作终*止其身上的法术*效应，则该*目标身上的法术*终止。\n在该形态下，目标唯一的移动方式即是10尺的飞行速度，且可以悬浮。该目标可以进入并占据一个已有生物占据的空间。其拥有钝击、穿刺和挥砍伤害的抗性，其对*倒地*状态免疫，且进行的力量、敏捷、体质豁免具有优势。该目标可以穿过狭隙，但会将液态物质视为固体表面。\n云雾形态的目标不能讲话或操作物件，其随身携带或持握的物件不会掉落，也不能被使用或与之互动。另外，目标也不能攻击或施法。",
    higherLevel: "*使用的法术*位每比三环高一环，你就可以额外再指定一*名生物作为法术*目标。"
  },

  {
    id: "gen-bw8g75", name: "守卫刻纹", source: "PHB'24",
    level: 3, school: "防护", castingTime: "1小时", range: "触碰", components: "声音、姿势、材料（价值200GP+的钻石尘，作为法术耗材）", duration: "直到被解除或触发",
    classes: ["吟游诗人","牧师","法师"],
    description: "*施展该法术*时，你在某个表面（诸如桌面或地板）或某个能被关闭以隐藏刻纹的物件里（诸如书本或宝箱）刻画一个会释放魔法效应的刻纹。该刻纹可以覆盖直径不超过10尺的区域。*如果受术*的物件或表面从被施法位置被移开超过10尺，则其刻*纹被破坏且法术*不被触发即告终止。\n结界刻纹近乎不可察觉，其*需要以你的法术*豁免DC进行一次成功的感知（察觉）检定才能被发现。\n刻画刻纹时，你可以设定其触发条件，并从*爆炸符文和法术*刻纹两者中选择其一。"
  },

  {
    id: "gen-csrdc", name: "加速术", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作", range: "30尺", components: "声音、姿势、材料（一片甘草根切片）", duration: "专注，至多1分钟",
    classes: ["术士","法师"],
    description: "指定施法距离内一个你能看见的自愿生物。*直至法术*终止前，目标速度翻倍；其AC获得+2加值；其进行敏捷豁免时具有优势；其每个回合都可作出一个额外的动作，但该动作只能用于执行攻击动作（仅一次攻击），或者疾走、撤离、躲藏和操作动作。\n法术终止时，目标将泛起一阵倦意使其失能并且速度为0，持续至其下一回合结束。"
  },

  {
    id: "gen-baee2l", name: "哈达之欲", source: "PHB'24",
    level: 3, school: "咒法", castingTime: "动作", range: "150尺", components: "声音、姿势、材料（一条酸洗过的触须）", duration: "专注，至多1分钟",
    classes: ["邪术师"],
    description: "你打开了通往遥远国度的大门，展现其中难以名状的恐怖。以施法距离内一点为中心，一个半径 20 尺的黑暗球状区域显现*并持续至该法术*终止。这个球状区域是困难地形，并同时发散着能在30尺内听到的不谐耳语和啜嚼噪音。任何光照，无论是魔法光照还是其他光照都无法照亮这个区域，而完全进入该区域内的生物将陷入*目盲*状态。\n任何在区域内开始其回合的生物将受到 2d6 点寒冷伤害。任何在区域内结束其回合的生物必须进行一次敏捷豁免，豁免失败者将因异界软体触手的触碰而受到2d6点强酸伤害。",
    higherLevel: "*使用的法术*位每比三环高一环，*此法术*造成的寒冷或者强酸伤害（由你选择）就增加1d6。"
  },

  {
    id: "gen-ao6fzj", name: "催眠图纹", source: "PHB'24",
    level: 3, school: "幻术", castingTime: "动作", range: "120尺", components: "姿势、材料（一撮五彩纸屑）", duration: "专注，至多1分钟",
    classes: ["吟游诗人","术士","邪术师","法师"],
    description: "你在施法距离内一处边长 30 尺的立方区域内创造出一个在空中舞动旋转的彩色图纹。图纹在出现片刻后消失，然后迫使区域内每个看到它的生物进行一次感知豁免，豁免*失败者将在法术*持续时间内陷入*魅惑*状态。*在被该法术*魅惑期间，*被该法术*魅惑的生物陷入*失能*状态，且速度降为0。\n*如果受术*生物受到任何伤害，或有其他生物用一个动作将其从恍惚中摇醒，则其身上的此效应将提前终止。"
  },

  {
    id: "gen-876lz8", name: "李欧蒙小屋", source: "PHB'24",
    level: 3, school: "塑能", castingTime: "1分钟或仪式", range: "自身", components: "声音、姿势、材料（一个小水晶珠子）", duration: "8 小时",
    classes: ["吟游诗人","法师"],
    description: "你释放出半径10尺的光环，*光环会在法术*持续时间内保持存在并固定在原地。*施展此法术*时，若光环的大小不足以完全覆盖其区域内的所有生物，法术的施展会失败。\n*在施展此法术*时即处于光环内的生物和物件可以自由进出光环。而所有其他生物和物件都将被阻挡而无法进出。三环或*更低级别的法术*既无法直接穿过光环施展，*也无法使法术*效果延伸至穿过光环。\n光环内的空气干爽舒适，而无论外侧气候如何。*你可以在法术*终止前使光环内的光照变为微光光照或黑暗（无需任何动作）。光环从外侧看是不透明的，并且呈现出由你选定的颜色，但从内侧看它则是透明的。\n当你离开该区域，或试图*再次施展该法术*时，法术将提前终止。"
  },

  {
    id: "gen-jeh0o0", name: "闪电箭矢", source: "PHB'24",
    level: 3, school: "变化", castingTime: "附赠动作，在你使用武器发动远程攻击命中一个目标或失手时紧接可用", range: "自身", components: "声音、姿势", duration: "立即",
    classes: ["游侠"],
    description: "当你的攻击命中一个目标或失手时，该武器的弹药或该武器本身变为一束闪电。作为目标从这次攻击中受到的任何伤害或其他效果的替代，若该攻击命中，则目标受到4d8点闪电伤害，若该攻击未命中，则受到一半伤害。无论你的攻击是否命中，目标周围10尺范围内的每个生物都必须进行一次敏捷豁免，豁免失败则受到2d8点闪电伤害，豁免成功则受到半数伤害。\n在此之后，该弹药或武器变回其正常形态。",
    higherLevel: "*使用的法术*位每比三环高一环，上述两种效应的伤害都各增加1d8。"
  },

  {
    id: "gen-mizw4", name: "闪电束", source: "PHB'24",
    level: 3, school: "塑能", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一些毛皮和一把水晶权杖）", duration: "立即",
    classes: ["术士","法师"],
    description: "一束100 尺长，5尺宽的线状闪电从你的位置向你指定的方向爆发迸出。在线状区域内的每个生物必须进行一次敏捷豁免，豁免失败者将受到8d6点闪电伤害，豁免成功则受到一半伤害。",
    higherLevel: "*使用的法术*位每比三环高一环，*此法术*的伤害就增加1d6。"
  },

  {
    id: "gen-jcyqeq", name: "防护法阵", source: "PHB'24",
    level: 3, school: "防护", castingTime: "1分钟", range: "10尺", components: "声音、姿势、材料（总价值100GP+的盐和银粉，作为法术耗材）", duration: "1小时",
    classes: ["牧师","圣武士","邪术师","法师"],
    description: "指定施法距离内地面上你能看见的一点，并以该处为中心创造一个 10 尺半径、20 尺高的柱状魔法能量。承载能量柱的地面或其他平面上会显现出闪光的符文。\n指定以下生物类型中的一种或多种：天族、元素、妖精、邪魔、亡灵。法阵将会对被指定类型的生物产生以下效应："
  },

  {
    id: "gen-k23jhh", name: "高级幻影", source: "PHB'24",
    level: 3, school: "幻术", castingTime: "动作", range: "120尺", components: "声音、姿势、材料（一撮羊毛）", duration: "专注，至多10分钟",
    classes: ["吟游诗人","术士","邪术师","法师"],
    description: "你创造一个影像，其形象来自一个大小不超过边长20尺立方体的物件或生物，或是其他的可视现象。影像出现在施法距离内你能看见的一*处位置并在法术*持续时间内维持存在。它看起来完全是真实的，并且还具有相应的声音、气味和温度。但它无法造成伤害或让人陷入任何状态。\n在该幻象施法距离内时，你可以用一个魔法动作将影像移动到施法距离内的另一个位置。影像改变位置时，你可以改变影像的外表来使它移动得更自然。例如，如果你创造了一个生物的影像并移动它，则你可以改变影像，使它看起来就像是在走路。或者你也可以让影像在不同的时间发出不同的声音，甚至可以让它参与一场对话。\n由于影像可以被穿过，任何与该影像进行的物理互动都会暴露其幻象的本质。一个生物用研究动作调查影像时，它可以进行一*次对抗你的法术*豁免 DC 的智力（调查）检定，以判定是否看穿幻象。辨出幻象的生物可以看破该影像，而影像的其他感官效应在该生物看来会变得微弱而模糊。",
    higherLevel: "使用*高于三环的法术*位时，法术时间持续至被解除且无需专注。"
  },

  {
    id: "gen-18dpnhf", name: "群体治愈真言", source: "PHB'24",
    level: 3, school: "防护", castingTime: "附赠动作", range: "60尺", components: "声音", duration: "立即",
    classes: ["吟游诗人","牧师"],
    description: "指定施法距离内至多六个你能看见的生物，使它们恢复 2d4+你的施法属性调整值 点生命值。",
    higherLevel: "*使用的法术*位每比三环高一环，*此法术*的治疗量就增加1d4。"
  },

  {
    id: "gen-hos86k", name: "融身入石", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作或仪式", range: "触碰", components: "声音、姿势", duration: "8小时",
    classes: ["牧师","德鲁伊","游侠"],
    description: "你进入一个足以完全容纳你身体的石料物件或石料表面内，使你自己和你携带的*所有装备在法术*持续时间内与石料融为一体。你必须触碰该石料来做到这件事。此后，任何非魔法的感官都无法看到或侦测到你的存在。\n与石料融合后，你看不到外界发生了什么，并且你为了聆听外界声音而进行的任何感知（察觉）检定都具有劣势。与石头融合时，你仍能感觉到时间的流逝，也可以*对自己施展法术*。你无法移动，但可以消耗5尺移动力从进入石头的地方离开石内，法术随之终止。\n石头所受的轻微损伤不会对你造成伤害，不过石头部分损毁或者形状改变时（改变到不再适合容纳你的程度），会将你从石中排挤出并对你造成6d6点力场伤害。石头完全损毁（或材质改变）时，也会将你从石中排挤出并对你造成50点力场伤害。被排挤出石头时，你移动至距离第一次进入石头处最近的一处未被占据的空间位置，并陷入*倒地*状态。"
  },

  {
    id: "gen-bjzkw6", name: "回避侦测", source: "PHB'24",
    level: 3, school: "防护", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一撮价值25+GP的钻石尘，作为法术耗材）", duration: "8小时",
    classes: ["吟游诗人","游侠","法师"],
    description: "法术持续时间内，你使你触碰的目标*不会被预言法术*发现。目标可以是一名自愿生物，或者是在任何方向上都不超过10尺的一处地点或一个物件。目标不能*被任何预言法术*选为目标，也不能被魔法探知传感器感测到。"
  },

  {
    id: "gen-n7tbh", name: "魅影驹", source: "PHB'24",
    level: 3, school: "幻术", castingTime: "1分钟或仪式", range: "30尺", components: "声音、姿势", duration: "1小时",
    classes: ["法师"],
    description: "一匹拟真的大型马形生物出现在施法距离内你选择的一处地面上的未占据空间中。你决定该生物的样貌，且它装备着鞍座、嚼子和缰绳。*这些随法术*创造的装备一旦离开坐骑10尺即化作一阵烟消失不见。\n*在法术*持续时间内，你或者一名你指定的生物可以骑乘此坐骑。**坐骑使用乘用马** Horse的数据（见附录B），不过其具有100尺速度，每小时可行进13里。法术终止时，坐骑会慢慢消失，骑手有1分钟的时间下马。坐骑受到伤害时，法术将提前终止。"
  },

  {
    id: "gen-dqascw", name: "植物滋长", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作（繁茂）或8小时（丰产）", range: "150尺", components: "声音、姿势", duration: "立即",
    classes: ["吟游诗人","德鲁伊","游侠"],
    description: "*该法术*将活力引导给特定区域中的植物。*本法术*的施法时间取决于你选择下述效应之一：繁茂或丰产。"
  },

  {
    id: "gen-jd24ys", name: "防护能量", source: "PHB'24",
    level: 3, school: "防护", castingTime: "动作", range: "触碰", components: "声音、姿势", duration: "专注，至多1小时",
    classes: ["牧师","德鲁伊","游侠","术士","法师"],
    description: "法术持续时间内，你触碰的一名自愿生物具有你选择的一种伤害类型的抗性：强酸、寒冷、火焰、闪电、雷鸣。"
  },

  {
    id: "gen-g0kg6u", name: "移除诅咒", source: "PHB'24",
    level: 3, school: "防护", castingTime: "动作", range: "触碰", components: "声音、姿势", duration: "立即",
    classes: ["牧师","圣武士","邪术师","法师"],
    description: "你触碰一名生物或一个物件，使影响其的所有诅咒终止。如果该物件是一件诅咒魔法物品，则其上的诅咒将维持，*不过该法术*可以打破诅咒物品与其所有者之间的同调，使其所有者可以将其卸下或丢弃。"
  },

  {
    id: "gen-dajbi", name: "回生术", source: "PHB'24",
    level: 3, school: "死灵", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一颗价值300+GP的钻石，作为法术耗材）", duration: "立即",
    classes: ["牧师","德鲁伊","圣武士","游侠"],
    description: "你接触在前一分钟内刚刚死亡的一名生物。该生物以1点生命值回生。*该法术*不能复活老死的生物，也不能恢复失去的身体部位。"
  },

  {
    id: "gen-i8owd", name: "短讯术", source: "PHB'24",
    level: 3, school: "预言", castingTime: "动作", range: "无限", components: "声音、姿势、材料（一段铜线）", duration: "立即",
    classes: ["吟游诗人","牧师","法师"],
    description: "你向你所遇到过的或某人遇到过且向你描述的一个生物发送一小段二十五个词以内的信息。该生物将在心中听到你的信息，它可以认出你是发讯人（如果他认识你），还可以用同样的方式立即回复一条讯息。法术会让目标能够理解你短讯的信息。\n你的传讯可以跨越任意长的距离，甚至能跨越位面。但如果目标和你不在同一个存在位面，*则短讯术*有5%的概率无法到达。如果讯息没能传达，你将得知这一结果。\n在收到你的信息后，一个生物能够屏*蔽你以这个法术*再次对他发信的能力，持续8小时。如果你在这段时间内试图送出另一条信息，你会得知你的短讯被屏蔽，*并且法术*失败。"
  },

  {
    id: "gen-mtzxy", name: "雪雨暴", source: "PHB'24",
    level: 3, school: "咒法", castingTime: "动作", range: "150 尺", components: "声音、姿势、材料（一把迷你雨伞）", duration: "专注，至多 1 分钟",
    classes: ["德鲁伊","术士","法师"],
    description: "你指定施法距离内一点，并使以该点为中心，高40尺、半径20尺的柱状区域内降下冷冻刺骨的冻雨*和冰雹直至法术*终止。该区域将造成重度遮蔽，且该区域内的一切外露的暴露在外的明火都将被浇熄。\n该区域的地面变成困难地形。生物在一个回合内首次进入该区域或在区域内开始其回合时，它必须成功通过一次敏捷豁免，否则将陷入*倒地*状态并失去专注。"
  },

  {
    id: "gen-j36u8", name: "缓慢术", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作", range: "120 尺", components: "声音、姿势、材料（一滴糖浆）", duration: "专注，至多 1 分钟",
    classes: ["吟游诗人","术士","法师"],
    description: "你在施法距离内一处 40 尺立方区域内指定至多六个生物并扭曲其周围的时间流。每个目标都要进行一次感知豁免，豁免失*败则受到该法术**影响直至法术*终止。\n被影响的生物的速度减半，而其 AC 和敏捷豁免都获得-2减值，且不能执行反应。该生物在其回合中仅可以执行一个动作或一个附赠动作，但不能同时执行二者。且当它执行攻击动作时，它只能发动一次攻击。\n如果该生物尝试施展一个具有*姿势成分的法术*，*则其法术*有25%的概率会因为生物的动作太慢而施展失败。\n受术生物在其每个回合结束时可以再进行一次该感知豁免，豁免成功则终止*其身上的该法术*效应。"
  },

  {
    id: "gen-e366vi", name: "死者交谈", source: "PHB'24",
    level: 3, school: "死灵", castingTime: "动作", range: "10 尺", components: "声音、姿势、材料（燃烧的香）", duration: "10 分钟",
    classes: ["吟游诗人","牧师","法师"],
    description: "你给施法距离内一具你所选择的尸体施以复生的表象，让其可回答你的问题。这具尸体必须还有一张嘴，且如果该生物死亡时是亡灵生物，则施法失败。若目标尸体在最近十日内*曾被作为该法术*的目标，则本次施法失败。\n*在法术*终止前，你可以向尸体提出最多五个问题。尸体的知识和它讲述的语言仅限于其生前所知。回答通常是简短，含糊或重复的语句，而且如果你对尸体抱有敌意或者尸体认为你是其敌人，它也不是一定要给你正确的答复。*该法术*并不能让该生物的灵魂返回其身体中，只是活化了其精神。因此，该尸体不能认知新的信息，不能理解它死后发生的任何事情，也不能对未来的事件作出猜测。"
  },

  {
    id: "gen-dq59ls", name: "植物交谈", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作", range: "自身（半径 30 尺）", components: "声音、姿势", duration: "10 分钟",
    classes: ["吟游诗人","德鲁伊","游侠"],
    description: "你给周围30尺固定灵光范围内的植物赋予有限的知觉与活力，使其能够与你沟通和按你的简单命令行事。你可以向植物询问*最近一日该法术*区域内所发生的事，由此了解有关于曾路过这里的生物、天气和其他状况的信息。\n你可以让区域内因植物生长形成的困难地形（如灌木丛）*在法术*持续时间内变为普通地形。*你也可以在法术*持续时间内将有植物生长的普通地形变成困难地形。\n*虽然该法术*并不能让植物拔根而起或移动位置，但它们可以依你的意愿而活动自己的树枝、藤蔓和茎秆。\n*如果法术*区域内有一个植物生物，你可以如同有共同语言一般与其交流。"
  },

  {
    id: "gen-einfmm", name: "灵体卫士", source: "PHB'24",
    level: 3, school: "咒法", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一卷祷文）", duration: "专注，至多 10 分钟",
    classes: ["牧师"],
    description: "*在法术*持续时间内，保护性的灵体环绕在你的周围15尺灵光范围内飞舞。如果你属于善良或中立阵营，则它们飘渺的身形看起来像是天使或妖精（由你选择）。如果你属于邪恶阵营，则它们将形如邪魔。\n*施展此法术*时，你可以指定特定生物*让其不受该法术*影响。除此之外的生物在灵光*区域内将受法术*影响致速度被减半。当灵光进入一个生物的空间、一个生物进入灵光或在灵光内结束回合时，其必须进行一次感知豁免。豁免失败将受到3d8点光耀伤害（如果你属于善良或中立）或3d8点暗蚀伤害（如果你属于邪恶），豁免成功则只受到一半伤害。一名生物一回合仅需进行一次该豁免。",
    higherLevel: "*使用的法术*位每比三环高一环，*此法术*的伤害就增加 1d8。"
  },

  {
    id: "gen-jf0x7", name: "臭云术", source: "PHB'24",
    level: 3, school: "咒法", castingTime: "动作", range: "90 尺", components: "声音、姿势、材料（一个臭鸡蛋）", duration: "专注，至多 1 分钟",
    classes: ["吟游诗人","术士","法师"],
    description: "你以施法距离内一点为中心创造出一团半径 20 尺的黄色恶心气体云团球状区域。云团内形成重度遮蔽。云团会一直留在空中，*直至法术*持续时间结束或一阵强风（**比如造风术** Wind创造的强风）将其吹散为止。\n如果一个生物在其回合开始时位于云团内，则它必须成功通过一次体质豁免。否则将陷入*中毒*状态直到其当前回合结束。因此而陷入*中毒*状态期间，该生物无法执行动作或附赠动作。"
  },

  {
    id: "gen-b7lhu7", name: "妖精召唤术", source: "PHB'24",
    level: 3, school: "咒法", castingTime: "动作", range: "90 尺", components: "声音, 姿势, 材料（一朵价值300+GP的镀金花）", duration: "专注，至多1小时",
    classes: ["德鲁伊","游侠","邪术师","法师"],
    description: "你唤来一个妖精灵魄。其使用下文妖精灵魄的数据，并会在施法距离内一处你可见的未被占据的空间中显现。*当你施展法术*时，从愤怒、欢欣、诡诈中选择一种情绪，该生物会显现为一个受你所选情绪所影响的妖精生物，其数据中的部分特性也受此影响。该生物会在生命值降为0*或是法术*结束时消失。\n该生物是你的盟友（对你的其他盟友亦是如此）。它在战斗中使用你的先攻，并在你回合结束后立即行动。它遵从于你的口头指令（无需任何动作）。如果你不发令，它将执行回避动作并用移动力远离危险。",
    higherLevel: "该生物的数*据使用新的法术*环阶。"
  },

  {
    id: "gen-x6hkal", name: "亡灵召唤术", source: "PHB'24",
    level: 3, school: "死灵", castingTime: "动作", range: "90 尺", components: "声音, 姿势, 材料（一个价值300+GP的镀金头骨）", duration: "专注，至多1小时",
    classes: ["邪术师","法师"],
    description: "你唤来一个亡灵灵魄。其使用下文亡灵灵魄的数据，并会在施法距离内一处你可见的未被占据的空间中显现。*当你施展法术*时，从幽体、腐尸、骸骨中选择一类，该生物会显现为你所选的那类形态的亡灵生物，其数据中的部分特性也受此影响。该生物会在生命值降为0*或是法术*结束时消失。\n该生物是你的盟友（对你的其他盟友亦是如此）。它在战斗中使用你的先攻，并在你回合结束后立即行动。它遵从于你的口头指令（无需任何动作）。如果你不发令，它将执行回避动作并用移动力远离危险。",
    higherLevel: "该生物的数*据使用新的法术*环阶。"
  },

  {
    id: "gen-ef6mu", name: "巧言术", source: "PHB'24",
    level: 3, school: "预言", castingTime: "动作", range: "触碰", components: "声音、材料（一座微缩庙塔）", duration: "1小时",
    classes: ["吟游诗人","牧师","术士","邪术师","法师"],
    description: "*此法术*赋予你触碰的一名生物理解任何其能看见或听见的口语或手语的能力。此外，当目标生物以口语或手语进行交流时，任何能听见其话语或看见其手语，且知道至少一门语言的生物都能理解它。"
  },

  {
    id: "gen-817o41", name: "吸血鬼之触", source: "PHB'24",
    level: 3, school: "死灵", castingTime: "动作", range: "自身", components: "声音、姿势", duration: "专注，至多1分钟",
    classes: ["术士","邪术师","法师"],
    description: "你的阴影环绕着的手可以吸取他人的生命力来为自己疗伤。对你触及范围内的一名生物进*行一次近战法术*攻击。若命中，则目标受到3d6点暗蚀伤害，而你则恢复数值等同于所造成暗蚀伤害一半的生命值。\n*该法术*终止前，你可以在你的每个回合内用魔法动作对相同或不同的生物进行一次这样的攻击。",
    higherLevel: "*使用的法术*位每比三环高一环，*此法术*的伤害就提高1d6。"
  },

  {
    id: "gen-dz5har", name: "水下呼吸", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作或仪式", range: "30尺", components: "声音、姿势、材料（一根短芦苇）", duration: "24小时",
    classes: ["德鲁伊","游侠","术士","法师"],
    description: "*在法术*终止前，*该法术*让施法距离内你所选择的至多十个自愿生物获得在水下呼吸的能力。此外，受术者依然保有正常的呼吸能力。"
  },

  {
    id: "gen-dzel4q", name: "水上行走", source: "PHB'24",
    level: 3, school: "变化", castingTime: "动作或仪式", range: "30尺", components: "声音、姿势、材料（一个软木塞）", duration: "1小时",
    classes: ["牧师","德鲁伊","游侠","术士"],
    description: "*此法术*赋予你选择的位于施法距离内的至多十名生物在持续时间内将任何液体表面（比如水、酸、泥、雪、流沙、岩浆等）视作无害的固体地面穿越的能力（穿越熔岩的生物仍然会因炽热受到伤害）。\n一名受影响的目标必须用一个附赠动作才能穿过液体表面进入其内部，反之亦然。然而若目标将因坠落而进入液体中，则其会直接穿过液体表面，如常进入其内部。"
  },

  {
    id: "gen-mtddw", name: "风墙术", source: "PHB'24",
    level: 3, school: "塑能", castingTime: "动作", range: "120尺", components: "声音、姿势、材料（一把扇子和一根羽毛）", duration: "专注，至多1分钟",
    classes: ["德鲁伊","游侠"],
    description: "你指定施法距离内地面上一点并从中升起了一道烈风形成的墙壁。你可以造出长度至多 50 尺、高度至多15尺、厚度至多1尺的风墙。你可以自由塑造该墙的形状，不过它必须沿着地面形成一条连续的轨道。风墙*持续存在至法术*终止。\n风墙出现时，所有位于风墙所占据区域内的生物必须进行一次力量豁免。豁免失败，受到4d8点钝击伤害。豁免成功，则只受一半伤害。\n烈风可以阻隔浓雾、烟尘和其他气体。体型为小型或更小的飞行生物或物件无法穿过风墙。重量轻的物质带进风墙中时将被向上吹飞。对墙后目标射出的箭、矢和其他普通飞行物会被朝上吹走而直接判为打失。巨人或攻城器械投出的巨石和类似的飞行物不受影响。处于气化形态的生物无法穿过风墙。"
  }
];
