import { SpellItem } from '../types';

export const SPELL_DB_LEVEL_4: SpellItem[] = [
  // ==========================================
  // 4环法术 - PHB'24 Only
  // ==========================================

  {
    id: "gen-idn8f", name: "秘法眼", source: "PHB'24",
    level: 4, school: "预言", castingTime: "动作", range: "30 尺", components: "声音、姿势、材料（一点蝙蝠毛皮）", duration: "专注，至多 1 小时",
    classes: ["法师"],
    description: "你在施法距离内创造出一个漂浮在空中，不受伤害的隐形魔法眼。你通过精神连接接收秘法眼传来的视觉信息。秘法眼拥有30尺黑暗视觉且可以观察任何方向。\n以一个附赠动作，你可以让秘法眼向任意方向移动30尺。固体障碍物会阻挡秘法眼的移动，但它可以穿过任何直径大于1寸的缝隙。"
  },

  {
    id: "gen-f4pyk2", name: "生命灵光", source: "PHB'24",
    level: 4, school: "防护", castingTime: "动作", range: "自身", components: "声音", duration: "专注，至多 10 分钟",
    classes: ["牧师", "圣武士"],
    description: "一道灵光自你身上发出并形成 30 尺半径的光环。在灵光范围内时，你和你的盟友获得对暗蚀伤害的抗性，生命值上限也无法被降低。另外，生命值为0的盟友在灵光范围内开始其回合时，恢复1点生命值。"
  },

  {
    id: "gen-anwq4q", name: "净化灵光", source: "PHB'24",
    level: 4, school: "防护", castingTime: "动作", range: "自身", components: "声音", duration: "专注，至多 10 分钟",
    classes: ["牧师", "圣武士"],
    description: "一道灵光自你身上发出并形成 30 尺半径的光环。在灵光范围内时，你和你的盟友获得毒素伤害的抗性，并且在为抵抗和结束下列状态所做的豁免时具有优势：*目盲*、*魅惑*、*耳聋*、*恐慌*、*麻痹*、*中毒*、震慑 。"
  },

  {
    id: "gen-fix25", name: "放逐术", source: "PHB'24",
    level: 4, school: "防护", castingTime: "动作", range: "30尺", components: "声音、姿势、材料（一颗五芒星）", duration: "专注，至多1分钟",
    classes: ["牧师", "圣武士", "术士", "邪术师", "法师"],
    description: "一个在你施法距离内你可见的生物必须进行一次魅力豁免，豁免*失败者会在法术*持续期间被转移到一个无害的半位面，身处半位面期间，目标会陷入*失能*状态。*当法术*终止时，目标将重新出现在其被放逐前的位置。如果该位置被占据，则目标将出现在距离该位置最近的一个未被占据空间。\n若该目标的生物类型为异怪、天族、元素、妖精或邪魔，*则在法术*持续一分钟后，目标不会返回。该目标会被改为转移到与其生物类型相关的一个位面（由DM决定）中的随机地点。",
    higherLevel: "*使用的法术*位每比四环高一环，你就能多指定一个*生物作为此法术*的目标。"
  },

  {
    id: "gen-ftqz4", name: "枯萎术", source: "PHB'24",
    level: 4, school: "死灵", castingTime: "动作", range: "30尺", components: "声音、姿势", duration: "立即",
    classes: ["德鲁伊", "术士", "邪术师", "法师"],
    description: "一个在你施法距离内你可见的生物必须进行一次体质豁免，豁免失败者受到8d8暗蚀伤害，成功则只受到一半伤害。生物类型为植物的生物在此豁免中自动失败。\n*作为此法术*的另一种用法，你可以指定一个并非生物的非魔法植物为目标（如树木或灌木），该植物不进行豁免，直接凋谢死亡。",
    higherLevel: "*使用的法术*位每比四环高一环，*此法术*的伤害就提升1d8。"
  },

  {
    id: "gen-jzo7fv", name: "魅惑怪物", source: "PHB'24",
    level: 4, school: "惑控", castingTime: "动作", range: "30 尺", components: "声音、姿势", duration: "1 小时",
    classes: ["吟游诗人", "德鲁伊", "术士", "邪术师", "法师"],
    description: "一名你可见的施法距离内的生物进行一次感知豁免，如果你或者你的盟友正在与它战斗，它在这次豁免上具有优势。豁免失败，则目标陷入*魅惑*状*态直至法术*结束，或在你或你的盟友对它造成伤害时提前结束。魅惑生物将对你友好。*当法术*结束时，目标会知道它曾被你*魅惑*。",
    higherLevel: "*使用的法术*位每比四环高一环，你就可以额外指定一名*生物作为此法术*的目标。"
  },

  {
    id: "gen-en68u", name: "强迫术", source: "PHB'24",
    level: 4, school: "惑控", castingTime: "动作", range: "30 尺", components: "声音、姿势", duration: "专注，至多 1 分钟",
    classes: ["吟游诗人"],
    description: "每名你所选择的，施法距离内你可见的生物必须成功通过一次感知豁免，否则陷入*魅惑*状*态直至法术*结束。\n法术持续期间，你能够以一个附赠动作指向你的某个水平方向。随后，每个魅惑目标在其下一回合里必须使用其所有的移动力，采取最安全的路线，尽可能的向该方向移动。在以此法移动后，目标可以重新豁免，豁免成功则结*束其身上该法术*的效应。"
  },

  {
    id: "gen-d7gby", name: "困惑术", source: "PHB'24",
    level: 4, school: "惑控", castingTime: "动作", range: "90 尺", components: "声音、姿势、材料（三颗坚果壳）", duration: "专注，至多 1 分钟",
    classes: ["吟游诗人", "德鲁伊", "术士", "法师"],
    description: "你选择施法距离内一点为中心，半径10尺球状区域内的每名生物必须成功通过一次感知豁免，否则目标不能执行反应和附赠动作，并且必须在其每个回合开始时掷1d10，根据下表内容来决定当前回合的行为。"
  },

  {
    id: "gen-cezotn", name: "咒唤微元素群", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "自身", components: "声音、姿势", duration: "专注，至多10分钟",
    classes: ["德鲁伊", "法师"],
    description: "你在持续时间内将来自元素位面的精魂咒唤在你身周15尺光环区域内，让它们环绕着你飞舞。*直到法术*结束为止，你进行的任何攻击检定命中光环区域内的生物时，都会额外造成2d8点伤害。额外伤害的类型为强酸、寒冷、火焰或闪电的一种（在你发动攻击时选择）。\n此外，光环区域内的地面对你的敌人而言是困难地形。",
    higherLevel: "*使用的法术*位每比四环高一环，*此法术*的伤害就增加1d8。"
  },

  {
    id: "gen-dfkn3f", name: "咒唤林地卫士", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "自身", components: "声音、姿势", duration: "专注，至多10分钟",
    classes: ["德鲁伊", "游侠"],
    description: "你在持续时间内将许多自然精魂咒唤在你身周10尺光环区域内。每当光环区域进入一名你可见生物所在的空间时、一名你可见的生物进入光环区域或是在该区域结束其回合时，你都可以迫使该生物进行一次感知豁免检定。失败则该生物受到5d8力场伤害，成功则只受一半伤害。一名生物一回合只需要进行一次该豁免。\n此外，在持续时间内，你能够以附赠动作执行撤离动作。",
    higherLevel: "*使用的法术*位每比四环高一环，*此法术*的伤害就增加1d8。"
  },

  {
    id: "gen-d4tfh5", name: "操控水体", source: "PHB'24",
    level: 4, school: "变化", castingTime: "动作", range: "300尺", components: "声音、姿势、材料（水尘混合物）", duration: "专注，至多10分钟",
    classes: ["牧师", "德鲁伊", "法师"],
    description: "你控制你指定的一处边长至多100尺的立方区域中的任*意水体直至法术*结束，从以下效应中选择其一生效。在后续的你的回合中，你能够以一个魔法动作重复同一效应，或是选择另一效应。"
  },

  {
    id: "gen-jec84i", name: "防死结界", source: "PHB'24",
    level: 4, school: "防护", castingTime: "动作", range: "触碰", components: "声音、姿势", duration: "8小时",
    classes: ["牧师", "圣武士"],
    description: "你触摸一名生物，并给予其对死亡的防护。*在法术*结束前，当目标的生命值首次降至0时，该目标的生命值改为降至1，*随后法术*终止。\n目标受到直接致死而不造成伤害的效应影响时，*若该法术*仍在生效，则改为目标受到的致死效应失效，*随后法术*终止。"
  },

  {
    id: "gen-c1sl0", name: "任意门", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "500尺", components: "声音", duration: "立即",
    classes: ["吟游诗人", "术士", "邪术师", "法师"],
    description: "你将传送至施法距离内的一处地点。你会准确到达该目的地。法术的目的地可以是你能看见的、可想象的地点，也可以是通过距离和方向说明的地点，比如“径直向下200尺”，“西北偏上45度300尺”。\n你还可以带上一名自愿生物一同传送。该生物在你传送时必须距你5尺内，且其传送终点也位于你所选目的地的5尺内。\n如果你、你携带的生物、或两者均将被传送至一处已被一名生物占据、或被一个或更多物件填满的空间中，则你和任何与你一起传送的生物都将受到4d6点力场伤害，且传送失败。"
  },

  {
    id: "gen-n090z", name: "预言术", source: "PHB'24",
    level: 4, school: "预言", castingTime: "动作或仪式", range: "自身", components: "声音、姿势、材料（价值25+GP的熏香，作为法术耗材）", duration: "立即",
    classes: ["牧师", "德鲁伊", "法师"],
    description: "*此法术*让你得以与一名神祇或其仆人取得联络。你可以就某个未来7日内将要发生的特定目标、事件或活动提出一个问题。DM将给予你真实的答复，这个答复可能是一段短语或一节神秘的短诗。*此法术*的回答并不会顾及所有可能影响结果的情况。*例如其他法术*的影响。\n若你在完成一次长休前施展*多于一次该法术*，*则法术*有概率不给出任何结果。此概率从第二次施展起每次累计25％。"
  },

  {
    id: "gen-ddf46l", name: "支配野兽", source: "PHB'24",
    level: 4, school: "惑控", castingTime: "动作", range: "60尺", components: "声音、姿势", duration: "专注，至多1分钟",
    classes: ["德鲁伊", "游侠", "术士"],
    description: "一名施法距离内你可见的野兽必须成功于一次感知豁免，否则在持续时间内陷入*魅惑*状态。若你或你的盟友正在与其战斗，则目标进行的此次豁免具有优势。目标受到伤害时，可以重复进行豁免，豁免成功则*其身上的此法术*终止。\n该野兽被魅惑期间，只要你与其处于同一位面就可以与之保持心灵感应。在你的回合，你可以通过心灵感应命令该生物（无需动作），比如“攻击那个生物”“跑到那个位置”或是“去拿那个物品”。该生物会在其回合内尽其所能以遵守你的指令。生物完成一项指令却未收到你的进一步指示时，将会凭自身喜好行动，尽可能的保护自己。\n你可以用自己的反应去要求目标执行一项反应。",
    higherLevel: "使*用更高环阶法术*位施展时，你的专注能持续更长时间，五环至多10分钟，六环至多1小时，七环及以上至多8小时。"
  },

  {
    id: "gen-1be07vg", name: "艾伐黑触手", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "90尺", components: "声音、姿势、材料（一根触手）", duration: "专注，至多1分钟",
    classes: ["法师"],
    description: "蠕动的乌黑触须填满了一处施法距离内你可见的20尺方状地面。*在法术*持续时间内，这些触手会将此区域地面变为困难地形。\n每名区域内的生物进行一次力量豁免。豁免失败受到3d6点钝击伤害，*并且直到法术*结束为止陷入*束缚*状态。一名进入此区域或在区域内结束回合的生物也要进行此豁免。一名生物一回合只进行一次此豁免。\n一名被束缚的生物可以用一个动作进行一次力量（运动）**检*定对抗你的法术*豁免**，若检定成功则结束其身上的*束缚*状态。"
  },

  {
    id: "gen-k0c4tu", name: "鬼斧神工", source: "PHB'24",
    level: 4, school: "变化", castingTime: "10分钟", range: "120尺", components: "声音、姿势", duration: "立即",
    classes: ["法师"],
    description: "你将一种原材料转化成该材料制作的成品。例如，你可以将一丛树木转化为一座木桥，一把麻草化为绳子，或是将亚麻和羊毛化作衣物。\n指定施法距离内你能看见的原材料。只要有足够的材料，你就可以将他们转化为一件体型不超过大型的物件（至多占据10尺立方区域或八个相邻的5尺立方区域）。如果你的目标材料是金属、石料或者其他矿石材料，那么被制造的物件不能大于中型（至多占据 5 尺立方区域），制成品的质量和原材料质量相同。\n*该法术*不能创造生物或魔法物品。你只有对制作某物品的工匠工具拥有熟练时，*才能使用此法术*去制作相应需要高工艺水平制作的物品，如武器、护甲等。"
  },

  {
    id: "gen-enid33", name: "火焰护盾", source: "PHB'24",
    level: 4, school: "塑能", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一小块磷或一只萤火虫）", duration: "10分钟",
    classes: ["德鲁伊", "术士", "法师"],
    description: "轻薄缥*缈的火焰在法术*持续期间环绕着你的身体，散发出10尺半径的明亮光照和额外10尺的微光光照。\n这层火焰可以为你提供一面温暖护盾或冻寒护盾，由你选择。温暖护盾将赋予你对寒冷伤害的抗性，而冻寒护盾则会赋予你对火焰伤害的抗性。\n此外，每当一名距你5尺内的生物以一次近战攻击命中你时，这个护盾将迸发出火焰。温暖护盾将对攻击者造成2d8点火焰伤害，冻寒护盾将对攻击者造成2d8点寒冷伤害。"
  },

  {
    id: "gen-dc9kfy", name: "月光涌泉", source: "PHB'24",
    level: 4, school: "塑能", castingTime: "动作", range: "自身", components: "声音、姿势", duration: "专注，至多10分钟",
    classes: ["吟游诗人", "德鲁伊"],
    description: "一道*冷冽光芒在法术*持续时间内缭绕你身，散发出20尺半径的明亮光照和额外20尺的微光光照。\n*直到法术*结束，你具有光耀伤害的抗性，并且你的近战攻击在命中时额外造成2d6点光耀伤害。\n此外，在你受到距你60尺内一名你可见的生物的伤害后，你可以立即用一个反应，强迫其进行一次体质豁免。豁免失败者直到你的下个回合结束为止陷入*目盲*状态。"
  },

  {
    id: "gen-hjltx0", name: "行动自如", source: "PHB'24",
    level: 4, school: "防护", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一条皮带）", duration: "1小时",
    classes: ["吟游诗人", "牧师", "德鲁伊", "游侠"],
    description: "你触碰一个自愿生物，*并使目标在法术*持续时间内移动时不受困难地形限制，*并且任何法术*或其他魔法效应都不能降低目标的速度，或者使目标陷入麻痹或*束缚*状态。目标还会获得等同于其速度的游泳速度。\n此外，该目标还可以花费5尺移动力直接从非魔法的束缚物中挣脱（诸如镣铐或其他生物对其施加的受擒状态）。",
    higherLevel: "*使用的法术*位每比四环高一环，你就可以额外再指定一名*生物作为此法术*的目标。"
  },

  {
    id: "gen-eelfw", name: "巨虫术", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "60尺", components: "声音、姿势", duration: "专注，至多10分钟",
    classes: ["德鲁伊"],
    description: "你召唤一只巨化的蜈蚣、蜘蛛或黄蜂（你施法时选择）。**其使用下文巨虫** Insect的数据，并会在施法距离内一处你可见的未被占据的空间中显现。你选择的形态决定了其数据中的部分细节。该生物会在生命值降为0*或是法术*结束时消失。\n该生物是你和你盟友的盟友。它在战斗中使用你的先攻，并在你回合结束后立即执行其回合。它遵从于你的口头指令（无需任何动作）。如果你不发令，它将执行回避动作并使用其移动力以远离危险。",
    higherLevel: "在生物数据中*使用更高的法术*环阶。"
  },

  {
    id: "gen-f957p", name: "擒抱藤", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "附赠动作", range: "60尺", components: "声音、姿势", duration: "专注，至多1分钟",
    classes: ["德鲁伊", "游侠"],
    description: "你指定施法距离内一个你能够看见的未被占据的空间，并召唤一条藤蔓使其从该空间的地面上破土而出。*藤蔓直到法术*结束为止会一直存在。\n对一名距藤蔓30尺内的生物进*行一次近战法术*攻击。命中时，目标受到4d8点钝击伤害并被往藤蔓所在方向拉近30尺。如果目标体型不超过巨型，则目标同时陷入受擒状态（逃脱DC*等同于你的法术*豁免DC）。藤蔓在同一时间只能擒抱一名生物，但你随时可以让藤蔓放开一名受擒的生物（无需动作）。\n*直至该法术*终止前，你可以在你随后的回合里用一个附赠动作再次对一名距其30尺内的生物进行这样的攻击。",
    higherLevel: "*使用的法术*位每比四环高一环，藤蔓便可额外擒抱一名生物。"
  },

  {
    id: "gen-ho0uic", name: "高等隐形术", source: "PHB'24",
    level: 4, school: "幻术", castingTime: "动作", range: "触碰", components: "声音、姿势", duration: "专注，至多1分钟",
    classes: ["吟游诗人", "术士", "法师"],
    description: "触碰一名生物，*该生物直到法术*结束之前具有*隐形*状态。"
  },

  {
    id: "gen-aepg7m", name: "信仰守卫", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "30尺", components: "声音", duration: "8小时",
    classes: ["牧师"],
    description: "一名大型灵体守护者出现在施法距离内一处由你指定的，你可见且未被占据的空间，*并在法术*持续时间内在该处悬浮。占据该空间的守护者是无敌的，并且会以适合你神祇或神系的形态出现。\n任何敌人在一回合内首次进入距守护者10尺内或于其10尺内开始其回合时，必须进行一次敏捷豁免。豁免失败受到20点光耀伤害，豁免成功则伤害减半。守护者在造成总计60点伤害后随即消失。"
  },

  {
    id: "gen-gms4", name: "幻景", source: "PHB'24",
    level: 4, school: "幻术", castingTime: "10分钟", range: "300尺", components: "声音、姿势、材料（一颗蘑菇）", duration: "24小时",
    classes: ["吟游诗人", "德鲁伊", "邪术师", "法师"],
    description: "你使施法距离内一处150尺立方区域内的自然地形在视觉、听觉、嗅觉上都像是另一种自然地形。因此，开阔的平原或者道路可能会变得像是一片沼泽，或是丘陵、裂谷以及其他难以通过，甚至是无法通过的地形。一个池塘可能变得看起来像一片草地，一个悬崖像是一个缓坡，或者使一条乱石沟像是一条宽阔平坦的道路。区域内经过加工的建筑、装备或生物的外表不会改变。\n地形的触觉特征不会改变，所以进入这片区域的生物可能会看穿幻象。如果触觉区别不明显，一个仔细调查幻象的生物可以采取研究动作，尝试进*行一次对抗法术*豁免 DC 的智力（调查）检定以识破之。对于一个识破了幻象本体的生物，幻象看起来就像是一层模糊的图像叠加在真实地形上。"
  },

  {
    id: "gen-cpahi", name: "冰风暴", source: "PHB'24",
    level: 4, school: "塑能", castingTime: "动作", range: "300尺", components: "声音、姿势、材料（一只连指手套）", duration: "立即",
    classes: ["德鲁伊", "术士", "法师"],
    description: "以施法距离内一点为中心的一处半径20尺，高40尺的柱状区域内，岩石般坚硬的冰雹重重地砸向地面。每个处在范围内的生物都必须进行一次敏捷豁免，豁免失败者将受到2d10点钝击伤害和 4d6 点寒冷伤害，豁免成功则受到一半伤害。\n冰雹使柱状区域内的地面变为困难地形，直至你的下一回合结束。",
    higherLevel: "*使用的法术*位每比四环高一环，*此法术*的钝击伤害就增加1d10。"
  },

  {
    id: "gen-u2c396", name: "李欧蒙秘藏箱", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（一个3尺×2尺×2尺、由稀有材料制成的、价值5000GP+的箱子；以及由同样材料制成的一个箱子的微缩模型（价值50GP+））", duration: "直至解除",
    classes: ["法师"],
    description: "你将一个箱子及其内容物藏在以太位面。你必须同时接触*箱子和作为法术*材料成分的微缩模型。箱子最多可容纳12立方尺的非活体物质（3×2×2 尺）。\n箱子处于以太位面时，你可以用一个魔法动作并触碰箱子的模型来召回箱子。箱子出现在你 5 尺内一个未被占据空间的地面。随后，你可以使用一个魔法动作并同时触碰箱子与微缩模型来把箱子送回以太位面。\n60日之后，法术的效应会每日累计5%的概率自动结束。如果你*再次施展该法术*或箱子的模型被摧毁，*该法术*的效应也将随之终止。*如果法术*终止时箱子处于以太界，则其留在那里等待被你或者其他人找到。"
  },

  {
    id: "gen-ogm9qm", name: "生物定位术", source: "PHB'24",
    level: 4, school: "预言", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一块寻血猎犬的皮毛）", duration: "专注，至多 1 小时",
    classes: ["吟游诗人", "牧师", "德鲁伊", "圣武士", "游侠", "法师"],
    description: "你点名或描述一个你熟悉的生物。只要该生物与你相距不超过1000尺，你就会感测到该生物的方位。如果该生物正在移动，则你也将知晓其移动的方向。\n*该法术*可以定位一个你认识的特定生物；或者它也可以定位特定的一类生物（例如人类或独角兽）中距你最近的个体，不过你需要曾经在 30 尺的近距离内看到过该类生物至少一次。如果被点名或描述的生物并不处于其原本的形态（例如*正被一个变形术*Polymorph**或石化术** Stone*的法术*效应影响），*则该法术*无法定位该生物。\n如果有任意厚度的铅，即使只是薄薄一片铅片阻挡了你与被定位物件间的通路，则该生物*也无法被该法术*所定位。"
  },

  {
    id: "gen-d6dmck", name: "魔邓肯忠犬", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "30尺", components: "声音、姿势、材料（一支银哨）", duration: "8小时",
    classes: ["法师"],
    description: "指定施法距离内一处你能看见且未被占据的空间，你在该处创造出一只幻影守护犬。守护犬*持续存在至法术*结束或你们之间的距离超过300 尺。\n只有你能看见守护犬，它无法被触及且不会受伤。当一个体型不小于小型的生物进入守护犬 30 尺内时，如果该生物无法说出你在施法时设定的口令，守护犬则会开始大声吠叫。守护犬拥有30尺真实视觉。\n在你的每回合开始时，守护犬会尝试啮咬其5尺范围内的一个敌人。该生物进行一次敏捷豁免，失败则受到4d8点力场伤害。\n*在你施展法术*的后续回合里，你能够以一个魔法动作令守护犬移动至多30尺。"
  },

  {
    id: "gen-gmv0s9", name: "魔邓肯私人密室", source: "PHB'24",
    level: 4, school: "防护", castingTime: "10分钟", range: "120尺", components: "声音、姿势、材料（一片薄铅）", duration: "24小时",
    classes: ["法师"],
    description: "你对施法距离内一片区域施以魔法防护。该区域为一立方区域，其边长至小5尺，大至 100 尺。*该法术*持续至持续时间结束。\n*施展该法术*时，其提供的防护效应由你决定。从下列词条中选择一种或多种生效："
  },

  {
    id: "gen-dsfx9n", name: "欧提路克弹力法球", source: "PHB'24",
    level: 4, school: "防护", castingTime: "动作", range: "30尺", components: "声音、姿势、材料（一颗玻璃球）", duration: "专注，至多1分钟",
    classes: ["法师"],
    description: "一颗微微发光的法球将施法距离内一个大型或更小的生物或物件封在其中。非自愿的生物必须成功通过一次敏捷豁免，*否则在法术*持续时间内被封在球体中。\n任何事物，包括实体物件、*能量或其他法术*效应，都不能穿透障壁进出其内，不过生物在球内仍可以正常呼吸。球体免疫一切伤害，且球内的生物或物件不能被来自球外的攻击或效应所伤害，球内的生物也不能对球外的任何事物造成伤害。\n该球体没有重量，而其尺寸恰好可以容纳球内的生物或物件。被封住的生物可以使用一个动作推动球壁并以至多该生物速度一半的速度滚动球体。另外，球体也可以被其他生物拿起或移动。\n以球体为目标*施展一道解离术*Disintegrate可以摧毁球体而不伤害球内的任何事物。"
  },

  {
    id: "gen-jzi2mv", name: "魅影杀手", source: "PHB'24",
    level: 4, school: "幻术", castingTime: "动作", range: "120尺", components: "声音、姿势", duration: "专注，至多1分钟",
    classes: ["吟游诗人", "法师"],
    description: "你指定施法距离内一名你可见的生物，窥探其噩梦，依此创造一道只有目标能看见的幻象。目标生物进行一次感知豁免。豁免失败时，目标受到4d10点心灵伤害，*且在法术*持续时间内进行的所有属性检定与攻击检定都具有劣势。豁免成功，则目标只受一半伤害，法术终止。\n法术持续时间内，目标在其每回合结束时进行一次感知豁免，豁免失败将再次受到心灵伤害。*豁免成功则法术*终止。",
    higherLevel: "*使用的法术*位每比四环高一环，*此法术*的伤害就增加1d10。"
  },

  {
    id: "gen-cqw9x", name: "变形术", source: "PHB'24",
    level: 4, school: "变化", castingTime: "动作", range: "60尺", components: "声音、姿势、材料（一枚毛毛虫茧）", duration: "专注，至多1小时",
    classes: ["吟游诗人", "德鲁伊", "术士", "法师"],
    description: "你尝试将施法距离内你可见的一名生物转变为一只野兽。目标必须成功于一次感知豁免，否则在持续时间内被变形为野兽形态。这种野兽形态可以是你所选的挑战等级不大于目标（若目标没有挑战等级，则使用目标的等级）的任意野兽。目标的游戏数据被替换为所选野兽的数据，但目标保留其阵营、性格、生物类型、生命值、生命值骰。\n目标获得等于其野兽形态生命值的临时生命值。法术结束时目标失*去所有因此法术*获得的临时生命值。*此法术*会在目标不具有剩余的临时生命值时提前结束。\n该生物只可做出其新形态的生理结构所允许的动作。它不能说话也不能施法。\n目标的装备融入新形态中。目标不能使用装备或者通过其他方式从装备中获得增益。"
  },

  {
    id: "gen-eneng", name: "惊惧斩", source: "PHB'24",
    level: 4, school: "惑控", castingTime: "附赠动作，当你使用近战武器或徒手打击命中一个生物后立即执行", range: "自身", components: "声音", duration: "立即",
    classes: ["圣武士"],
    description: "被该次攻击检定命中的目标会在此次攻击中额外受到4d6点心灵伤害。该目标必须进行一次感知豁免，豁免失败则目标陷入*震慑*状态直到你的下个回合结束。",
    higherLevel: "使用*高于四环的法术**位施展本法术*时，*你使用的法术*位每比四环高一环，额外伤害就增加1d6。"
  },

  {
    id: "gen-dinql", name: "塑石术", source: "PHB'24",
    level: 4, school: "变化", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（软粘土）", duration: "立即",
    classes: ["牧师", "德鲁伊", "法师"],
    description: "你触碰一个体积为中型或更小的石质物件或某块岩石在任何方向都不超过 5 尺的一部分，并将其塑造成你想要的任意形状。例如你可以将一块大石头塑造成一件武器、一尊塑像、或一个保险箱，也可以在石墙上开出一条小通道，前提是墙的厚度不能超过 5 尺。你也可以使一扇石门或石质门框变形来将门封死。你创造的物件最多可以有两条铰链和一道闩，除此之*外不能以该法术*塑造出更复杂的机械结构。"
  },

  {
    id: "gen-i6xq6", name: "石肤术", source: "PHB'24",
    level: 4, school: "防护", castingTime: "动作", range: "触碰", components: "声音、姿势、材料（价值100GP+的钻石粉末，作为法术耗材）", duration: "专注，至多 1 小时",
    classes: ["德鲁伊", "游侠", "术士", "法师"],
    description: "*在法术*结束前，你触碰的一个自愿生物获得对钝击、穿刺、挥砍伤害的抗性。"
  },

  {
    id: "gen-1683kkx", name: "异怪召唤术", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "90 尺", components: "声音, 姿势, 材料（一条腌制触手和一颗装在白金瓶中的眼球、价值400GP+）", duration: "专注，至多 1 小时",
    classes: ["邪术师", "法师"],
    description: "你唤来一个异怪灵魄。其使用下文异怪灵魄的数据，并会在施法距离内一处你可见的未被占据的空间中显现。*当你施展法术*时，从类眼魔，夺心魔和史拉蟾中选择一个类别。该生物会显化为你所选的那一类异怪，其数据中的部分特性也受此影响。该生物会在生命值降为0*或是法术*结束时消失。\n该生物是你的盟友（对你的其他盟友亦是如此）。它在战斗中使用你的先攻，并在你回合结束后立即行动。它遵从于你的口头指令（无需任何动作）。如果你不发令，它将执行回避动作并远离危险。",
    higherLevel: "该生物的数*据使用新的法术*环阶。"
  },

  {
    id: "gen-3u67l6", name: "构装召唤术", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "90 尺", components: "声音, 姿势, 材料（一个金属密码箱、价值400GP+）", duration: "专注，至多1小时",
    classes: ["法师"],
    description: "你唤来一个构装灵魄。其使用下文构装灵魄的数据，并会在施法距离内一处你可见的未被占据的空间中显现。*当你施展法术*时，从粘土、金属、岩石中选择一种材料，该生物会显现为以该种材料制成的活化雕像（由你决定其外观），其数据中的部分特性也受此影响。该生物会在生命值降为0*或是法术*结束时消失。\n该生物是你的盟友（对你的其他盟友亦是如此）。它在战斗中使用你的先攻，并在你回合结束后立即行动。它遵从于你的口头指令（无需任何动作）。如果你不发令，它将执行回避动作并远离危险。",
    higherLevel: "该生物的数*据使用新的法术*环阶。"
  },

  {
    id: "gen-ladhwm", name: "元素召唤术", source: "PHB'24",
    level: 4, school: "咒法", castingTime: "动作", range: "90 尺", components: "声音, 姿势, 材料（一个价值400GP+的、装有空气、一块鹅卵石、灰烬与水的镶金瓶）", duration: "专注，至多1小时",
    classes: ["德鲁伊", "游侠", "法师"],
    description: "你唤来一个元素灵魄。其使用下文元素灵魄的数据，并会在施法距离内一处你可见的未被占据的空间中显现。*当你施展法术*时，从气、土、火、水中选择一种元素，该生物会显现为由你所选元素组成的二足模糊人影，其数据中的部分特性也受此影响。该生物会在生命值降为0*或是法术*结束时消失。\n该生物是你的盟友（对你的其他盟友亦是如此）。它在战斗中使用你的先攻，并在你回合结束后立即行动。它遵从于你的口头指令（无需任何动作）。如果你不发令，它将执行回避动作并用移动力远离危险。",
    higherLevel: "该生物的数*据使用新的法术*环阶。"
  },

  {
    id: "gen-gpue6", name: "浓酸球", source: "PHB'24",
    level: 4, school: "塑能", castingTime: "动作", range: "150尺", components: "声音、姿势、材料（一滴胆汁）", duration: "立即",
    classes: ["术士", "法师"],
    description: "你指向施法距离内一点，一颗发光的直径1尺的酸液球飞向那个位置，随后爆炸，波及20尺半径球状区域。在该区域中的每名生物进行一次敏捷豁免。豁免失败的生物不仅将受到10d4点强酸伤害，其下个回合结束时还将再受到5d4点强酸伤害。若豁免成功，该生物只受到初始伤害的一半伤害。",
    higherLevel: "*使用的法术*位每比四环高一环，*此法术*的初始伤害便增加2d4。"
  },

  {
    id: "gen-gwew1", name: "火墙术", source: "PHB'24",
    level: 4, school: "塑能", castingTime: "动作", range: "120尺", components: "声音、姿势、材料（一块木炭）", duration: "专注，至多1分钟",
    classes: ["德鲁伊", "术士", "法师"],
    description: "你在施法距离内一块固体表面上创造出一面火墙。你可以选择创造长不过 60 尺、高不过 20 尺、厚不过 1 尺的直线型火墙；或是直径不过 20 尺、高不过 20 尺、厚不过 1 尺的环形火墙。火墙不透明，且将*持续存在至法术*终止。\n火墙出现时，所有位于火墙所占据的区域内的生物必须进行一次敏捷豁免。豁免失败，受到 5d8 火焰伤害。豁免成功，则只受一半伤害。\n*施展该法术*时，你选择火墙的哪一侧会造成伤害。生物在火墙造成伤害一侧10尺内或火墙所占据的区域内结束其回合时将受到5d8火焰伤害。在一个回合内首次进入火墙或在火墙所占据的区域内结束自己的回合时也会受到同样的伤害。火墙的另一侧不会造成伤害。",
    higherLevel: "*使用的法术*位每比四环高一环，*此法术*造成的伤害就提高1d8。"
  }
];
