import { SpellItem } from '../types';

export const SPELL_DB_LEVEL_8: SpellItem[] = [
  // ==========================================
  // 8环法术 - PHB'24 Only
  // ==========================================

  {
    id: "gen-awj7mo", name: "动物形态", source: "PHB'24",
    level: 8, school: "变化", castingTime: "动作", range: "30 尺", components: "声音、姿势", duration: "24 小时",
    classes: ["德鲁伊"],
    description: "选择施法距离内任意数量的自愿生物。每个目标都变形为一只挑战等级不超过4，体型不超过大型的野兽。你可以将每个目标变为不同的形态。*在法术*持续时间内之后的回合中，你可以使用一个魔法动作将这些目标再度变形。\n生物的游戏数据被选择的野兽资料卡替换，但目标保留其生物类型、生命值、生命骰、阵营、交流的能力以及智力、感知、魅力属性值。目标的动作受到新形态身体结构的限制，并且无法施法。目标的装备会融入其新形态，而且处于此形态时无法使用这些被融入的装备。\n目标获得等于其变形的首个形态生命值的临时生命值。法术结束时目标失*去所有因此法术*获得的临时生命值。该形态持续至持续时间结束，目标也能以一个附赠*动作结束此法术*。"
  },

  {
    id: "gen-b7sar0", name: "反魔法场", source: "PHB'24",
    level: 8, school: "防护", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一撮铁粉或铁屑）", duration: "专注，至多 1 小时",
    classes: ["牧师", "法师"],
    description: "一道反魔法灵光环绕着你形成10尺光环区域。在灵光内*部无法施展法术*，使用魔法动作或创造魔法效应，并且这些事物也无法以灵光内的任何事物为目标或影响灵光内部的任何事物。魔法物品的魔法属性在灵光内部不起作用，也无法影响处于灵光内部的任何事物。\n法术和其他魔法效应产生的效应区域无法延伸至灵光内部。传送无法进出其范围，位面旅行在该范围内无法使用。当传送门处于灵光内部时，传送门会暂时关闭。\n正*在持续中的法术*在区域内会被压制，*除非该法术*为某个神器或某位神明所施展。压制的魔法效应不会生效，但该魔法效应受压制的时间仍然如常计入其总持续时间。\n**解除魔法** 对灵光无效，而由不*同反魔法场法术*所创造的灵光之间也不会相互抵消。"
  },

  {
    id: "gen-r9gs9k", name: "嫌恶术/关怀术", source: "PHB'24",
    level: 8, school: "惑控", castingTime: "1 小时", range: "60 尺", components: "声音、姿势、材料（醋和蜂蜜的混合）", duration: "10天",
    classes: ["吟游诗人", "德鲁伊", "法师"],
    description: "*当你施展此法术*时，选择它是产生嫌恶还是关怀效应，并选择一个巨型或更小体型的生物或物件。然后指定特定类型的生物，比如红龙、地精或吸血鬼。当此类生物进入被选择的生物120尺内时，它必须进行一次感知豁免。你选择的嫌恶或关怀效应会决定当豁免失败时，这个生物身上产生的效应。"
  },

  {
    id: "gen-f69v7", name: "摧心术", source: "PHB'24",
    level: 8, school: "惑控", castingTime: "动作", range: "150尺", components: "声音、姿势、材料（一把没有钥匙的钥匙圈）", duration: "立即",
    classes: ["吟游诗人", "德鲁伊", "邪术师", "法师"],
    description: "你将一个施法距离内你可见的生物的心灵爆破。该目标必须进行一次智力豁免。\n若豁免失败，目标受到10d12心灵伤害，并*且无法施展法术*也无法执行魔法动作。受术生物每过 30 日即可在当日结束时重复进行该豁免，豁*免成功则此法术*效应终止。**此效应也可以被高等复原术** Restoration、*医疗术*Heal、**祈愿术** 法术终止。\n若豁免成功，则目标只会受到一半伤害。\n（注：*本法术*在PHB2014*中原名弱智术*Feeblemind）"
  },

  {
    id: "gen-cmtpw", name: "克隆术", source: "PHB'24",
    level: 8, school: "死灵", castingTime: "1 小时", range: "触碰", components: "声音、姿势、材料（一枚价值1000GP+的钻石作为法术耗材。以及一副价值2000GP+的带密封功能的大容器，其尺寸必须足以存放一个要被克隆的生物）", duration: "立即",
    classes: ["法师"],
    description: "你触碰一名被生物或其不小于1立方寸的血肉。*在施展法术*使用的容器中，一具该生物的无生命克隆体成形，你可以选择克隆体是和该生物同龄或是更年轻的版本。在容器未被外界影响时，其中的躯体会一直保持无意识的静止状态。这个克隆体在120日后成熟。\n如果本体生物在克隆体成熟后死亡，则其灵魂转移到克隆体中，前提是该灵魂必须保持自由且愿意归来。克隆体的肉体特质与本体相同，并具有相同的个性、记忆和能力，但不具有本体的随身装备。由于灵魂已经转移到别处，该生物原本的遗体（如果依然存在）失去活力，且不能被复活。"
  },

  {
    id: "gen-d4qcjp", name: "操控天气", source: "PHB'24",
    level: 8, school: "变化", castingTime: "10分钟", range: "自身", components: "声音、姿势、材料（燃烧的熏香）", duration: "专注，至多8小时",
    classes: ["牧师", "德鲁伊", "法师"],
    description: "*你在法术*持续时间内操控距你5里内的天气。你在施法时必须位于户外，并且若你回到室内，法术会提前终止。\n*你施展此法术*时，可以改变现有的天气状况（由DM决定）。你可以改变降水、气温和风势。新状况需要1d4×10分钟才能起效。一旦新状况起效，你便能再次改变天气状况。法术结束时，天气状况会逐渐回归正常。\n改变天气状况时，你可以从下述表格查明与目前状况对应的等级，再选择同一表格中高一级或低一级的状况作为其改变结果。改变风势时，你还可以同时改变其风向。 **降水** **气温** **风势**\n阶段 状况  阶段 状况  阶段 状况\n1 晴  1 酷热  1 无风\n2 薄云  2 炎热  2 和风\n3 多云或有雾  3 温暖  3 强风\n4 雨、雹或雪  4 凉爽  4 大风\n5 倾盆大雨、猛烈冰雹\n或漫天暴雪\n5 寒冷  5 暴风\n6 极寒"
  },

  {
    id: "gen-cli0v", name: "半位面", source: "PHB'24",
    level: 8, school: "咒法", castingTime: "动作", range: "60尺", components: "姿势", duration: "1小时",
    classes: ["术士", "邪术师", "法师"],
    description: "你在施法距离内你可见的一处平坦固体表面上创造一扇中型的通向半位面的虚幻门。这扇门可以被关闭和开启。半位面是一间各边均长30尺，木质或石质（由你选择）的空房间。\n法术终止时，门消失不见，任何仍然位于半位面中的物件会留在内部。任何仍然位于半位面中的生物也会留在那里，除非他们选择在门消失的时候被抛出，在距门先前占据的空间中最近的未占空间中落地，陷入*倒地*状态。\n你*每次施展此法术*时都可以创造一个新的半位面，也可以将门连向*你先前用此法术*创造的半位面。此外，如果你知晓了某个其*他生物用此法术*创造的半位面的本质和内容物，则你也*可以通过此法术*连接到那里。"
  },

  {
    id: "gen-dd6upp", name: "支配怪物", source: "PHB'24",
    level: 8, school: "惑控", castingTime: "动作", range: "60尺", components: "声音、姿势", duration: "专注，至多1小时",
    classes: ["吟游诗人", "术士", "邪术师", "法师"],
    description: "选择一名施法距离内你可见的生物，该生物必须成功于一次感知豁免，否则在持续时间内陷入*魅惑*状态。若你或你的盟友正在与其战斗，则目标在此豁免上具有优势。目标受到伤害时，可以重复进行豁免，豁免成功则*其身上的此法术*终止。\n目标被魅惑期间，只要你与其处于同一位面就可以与之保持心灵感应。在你的回合，你可以通过心灵感应命令该生物（无需动作），比如“攻击那个生物”“跑到那个位置”或是“去拿那个物品”。目标完成一项指令却未收到你的进一步指示时，将会凭自身喜好行动，尽可能的保护自己。\n你可以用自己的反应去要求目标执行一项反应。",
    higherLevel: "使*用更高环阶法术*位施展时，你的专注能持续更长时间，九环至多8小时。"
  },

  {
    id: "gen-dhzqw", name: "地震术", source: "PHB'24",
    level: 8, school: "变化", castingTime: "动作", range: "500尺", components: "声音、姿势、材料（一块碎岩）", duration: "专注，至多1分钟",
    classes: ["牧师", "德鲁伊", "术士"],
    description: "选择施法距离内你可见的地面上一点。法术持续时间内，一股强烈的震颤在以震源为中心半径100尺的圆形范围内传递。处于此范围内的地面被视为困难地形 。\n*你施展此法术*时，*以及法术*持续时间内每个你的回合结束时，区域地面上的每个生物都必须进行一次敏捷豁免，豁免失败则其陷入*倒地*状态，且其专注被打断。\n你也可以应用下述的额外效应："
  },

  {
    id: "gen-h23ixh", name: "花言巧语", source: "PHB'24",
    level: 8, school: "惑控", castingTime: "动作", range: "自身", components: "声音", duration: "1小时",
    classes: ["吟游诗人", "邪术师"],
    description: "*直至法术*终止前，你每次进行魅力检定时可以用15代替你掷出的数值。此外，无论你说什么，判断你是否说谎的魔法都会将你的话视为真实。"
  },

  {
    id: "gen-bg5wz6", name: "圣洁灵光", source: "PHB'24",
    level: 8, school: "防护", castingTime: "动作", range: "自身", components: "声音、姿势、材料（一个价值1000+GP 的小圣物箱）", duration: "专注，至多1分钟",
    classes: ["牧师"],
    description: "你在持续时间中发出灵光形成半径30尺的光环。你可以指定若干生物，在光环内时，他们进行的所有豁免均具有优势，而其他生物对它们进行的攻击检定具有劣势。另外，当一个邪魔或亡灵生物以近*战攻击命中受术*生物时，攻击者必须进行一次体质豁免，豁免失败者将陷入*目盲*状态，持续至它的下一回合结束。"
  },

  {
    id: "gen-gyb88", name: "焚云术", source: "PHB'24",
    level: 8, school: "咒法", castingTime: "动作", range: "150尺", components: "声音、姿势", duration: "专注，至多1分钟",
    classes: ["德鲁伊", "术士", "法师"],
    description: "一片充满了炽热灰烬的旋转烟云显现，并以施法距离内一点为中心的蔓延至半径20尺的球状区域。烟云区域被重度遮蔽。烟云会存在直至持续时间结束，或是直至被一阵强风（**例如被造风术** 所创造）所吹散。\n烟云出现时，每个处在其内的生物都必须通过一次敏捷豁免，豁免失败者将受到10d8点火焰伤害，豁免成功则受到一半伤害。该球状区域移动至生物所占据的空间，或者生物进入球状区域内，或者生物在球状 区域内结束其回合时，该生物也必须进行该豁免。一名生物每回合仅需进行一次该豁免。\n在你的每回合开始时，烟云会向你指定的、远离你的方向直线移动10尺。"
  },

  {
    id: "gen-lja57", name: "迷宫术", source: "PHB'24",
    level: 8, school: "咒法", castingTime: "动作", range: "60尺", components: "声音、姿势", duration: "专注，至多10分钟",
    classes: ["法师"],
    description: "你将施法距离内一个你能看见的生物放逐到一个迷宫般错综复杂的半位面。目标将一直留*在该处直至法术*持续时间结束，或者直到它逃出该迷宫。\n目标可以使用研究动作尝试逃出迷宫。此时它可以进行一次DC20 （调查 ）的智力检定，检定成功将逃出迷宫，*而该法术*随之终止。\n法术终止时，目标将重新出现在它之前消失的位置。如果该位置被占据，则目标出现在最近的未占据位置。"
  },

  {
    id: "gen-cjqxtr", name: "心灵屏障", source: "PHB'24",
    level: 8, school: "防护", castingTime: "动作", range: "触碰", components: "声音、姿势", duration: "24小时",
    classes: ["吟游诗人", "法师"],
    description: "*直到法术*终止前，你所触碰的一个自愿生物对下列项目具有免疫：心灵伤害；*魅惑*状态；任何可以感知到其情绪、阵营或阅读其思想的效应；可以侦测其位置的魔法。*任何法术*，**哪怕是祈愿术**，都不能收集目标信息、远程监视之或控制其心智。"
  },

  {
    id: "gen-ce3vs3", name: "律令震慑", source: "PHB'24",
    level: 8, school: "惑控", castingTime: "动作", range: "60尺", components: "声音", duration: "立即",
    classes: ["吟游诗人", "术士", "邪术师", "法师"],
    description: "你压垮施法距离内一名你可见生物的心灵。若目标生命值不超过150点，则其陷入*震慑*状态；否则，目标的速度直至你下个回合开始前变为0。\n被震慑目标在每个其回合结束时进行一次体质豁免。豁免成功时其身上的此状态终止。"
  },

  {
    id: "gen-mjrmz", name: "阳炎爆", source: "PHB'24",
    level: 8, school: "塑能", castingTime: "动作", range: "150尺", components: "声音、姿势、材料（一块太阳石）", duration: "立即",
    classes: ["牧师", "德鲁伊", "术士", "法师"],
    description: "指定施法距离内一点，以其为中心周围 60 尺半径的球状区域闪耀出灿烂的阳光。所有球状区域中的生物进行一次体质豁免。豁免失败者将受到12d6点光耀伤害，并陷入持续1分钟的*目盲*状态。豁免成功则仅受到一半伤害。\n*因该法术*陷入目盲的生物在其每回合结束时都可以再进行一次体质豁免。豁免成功则不再*目盲*。\n*该法术**将驱散法术*区*域内所有由法术*所创造的黑暗。"
  },

  {
    id: "gen-cjrg87", name: "心灵感应", source: "PHB'24",
    level: 8, school: "预言", castingTime: "动作", range: "无限", components: "声音、姿势、材料（一对银连环）", duration: "24小时",
    classes: ["法师"],
    description: "你与一个你熟识的自愿生物建起心灵连接。该生物可以身处你所在的存在位面的任意位置。一旦你与目标生物不再位于同一位面，*则该法术*随即终止。\n*直至法术*终止，你可以和目标生物通过心灵连接即时共享任何言语、图像、声音以及其他形式的感官信息，而目标也能够辨认出与之交流的对象正是你本人。*该法术*可以让目标生物理解你所发送的话语和任何感官信息。"
  },

  {
    id: "gen-ggb5a", name: "海啸术", source: "PHB'24",
    level: 8, school: "咒法", castingTime: "1分钟", range: "1里", components: "声音、姿势", duration: "专注，至多6轮",
    classes: ["德鲁伊"],
    description: "一面水墙从施法范围内你指定的一点成型。水墙至多长300尺，高300尺，厚50尺，且*持续存在至法术*终止。\n水墙出现时，所有位于范围内的生物进行一次力量豁免。豁免失败者受到6d10点钝击伤害，豁免成功则只受一半伤害。\n水墙出现后你的每回合开始时，水墙将带着其内的所有生物一起向远离你的方向移动50尺。当水墙进入一个体型不超过巨型的生物所占据的空间，或他们原本就处于墙内时，该生物必须进行一次力量豁免，豁免失败则受到5d10点钝击伤害。一名生物一轮只能受到一次此伤害。在你的回合结束时，水墙的高度减少50尺，且其随后每轮对生物造成的伤害也减少1d10。当水墙高度变为0尺时，法术终止。\n淹没在水墙中的生物可以用游泳的方式移动，由于波涛阻力影响，该生物必须成功于*一次对抗你法术*豁免DC的力量（运动）检定以决定其能否成功移动。检定失败者无法移动。移动离开水墙区域的生物会直接掉到地上。"
  }
];
